ir_version: 3
producer_name: "onnx.quantize"
producer_version: "0.1.0"
graph {
  node {
    input: "data"
    input: "scalar_op2"
    output: "_minusscalar0"
    name: "_minusscalar0"
    op_type: "Sub"
  }
  node {
    input: "_minusscalar0"
    input: "scalar_op3"
    output: "_mulscalar0"
    name: "_mulscalar0"
    op_type: "Mul"
  }
  node {
    input: "_mulscalar0"
    input: "_mulscalar0_scale"
    input: "_mulscalar0_zero_point"
    output: "_mulscalar0_conv0_QuantizeLinear"
    name: "_mulscalar0_conv0_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "_mulscalar0_conv0_QuantizeLinear"
    input: "_mulscalar0_scale"
    input: "_mulscalar0_zero_point"
    input: "ConvBnFusion_W_conv0_weight_quantized"
    input: "ConvBnFusion_W_conv0_weight_scale"
    input: "ConvBnFusion_W_conv0_weight_zero_point"
    input: "bn0_scale"
    input: "bn0_zero_point"
    input: "ConvBnFusion_BN_B_bn0_beta_quantized"
    output: "bn0_quantized"
    name: "conv0_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "bn0_quantized"
    input: "bn0_scale"
    input: "bn0_zero_point"
    output: "bn0"
    name: "bn0_conv0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "bn0"
    input: "slope12"
    output: "relu0"
    name: "relu0"
    op_type: "PRelu"
  }
  node {
    input: "relu0"
    input: "stage1_unit1_bn1_gamma"
    input: "stage1_unit1_bn1_beta"
    input: "stage1_unit1_bn1_moving_mean"
    input: "stage1_unit1_bn1_moving_var"
    output: "stage1_unit1_bn1"
    name: "stage1_unit1_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "relu0"
    input: "relu0_scale"
    input: "relu0_zero_point"
    output: "relu0_stage1_unit1_conv1sc_QuantizeLinear"
    name: "relu0_stage1_unit1_conv1sc_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit1_bn1"
    input: "stage1_unit1_bn1_scale"
    input: "stage1_unit1_bn1_zero_point"
    output: "stage1_unit1_bn1_stage1_unit1_conv1_QuantizeLinear"
    name: "stage1_unit1_bn1_stage1_unit1_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "relu0_stage1_unit1_conv1sc_QuantizeLinear"
    input: "relu0_scale"
    input: "relu0_zero_point"
    input: "ConvBnFusion_W_stage1_unit1_conv1sc_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit1_conv1sc_weight_scale"
    input: "ConvBnFusion_W_stage1_unit1_conv1sc_weight_zero_point"
    input: "stage1_unit1_sc_scale"
    input: "stage1_unit1_sc_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit1_sc_beta_quantized"
    output: "stage1_unit1_sc_quantized"
    name: "stage1_unit1_conv1sc_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_bn1_stage1_unit1_conv1_QuantizeLinear"
    input: "stage1_unit1_bn1_scale"
    input: "stage1_unit1_bn1_zero_point"
    input: "ConvBnFusion_W_stage1_unit1_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit1_conv1_weight_scale"
    input: "ConvBnFusion_W_stage1_unit1_conv1_weight_zero_point"
    input: "stage1_unit1_bn2_scale"
    input: "stage1_unit1_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit1_bn2_beta_quantized"
    output: "stage1_unit1_bn2_quantized"
    name: "stage1_unit1_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_bn2_quantized"
    input: "stage1_unit1_bn2_scale"
    input: "stage1_unit1_bn2_zero_point"
    output: "stage1_unit1_bn2"
    name: "stage1_unit1_bn2_stage1_unit1_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage1_unit1_bn2"
    input: "slope26"
    output: "stage1_unit1_relu1"
    name: "stage1_unit1_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit1_relu1"
    input: "stage1_unit1_relu1_scale"
    input: "stage1_unit1_relu1_zero_point"
    output: "stage1_unit1_relu1_stage1_unit1_conv2_QuantizeLinear"
    name: "stage1_unit1_relu1_stage1_unit1_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit1_relu1_stage1_unit1_conv2_QuantizeLinear"
    input: "stage1_unit1_relu1_scale"
    input: "stage1_unit1_relu1_zero_point"
    input: "ConvBnFusion_W_stage1_unit1_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit1_conv2_weight_scale"
    input: "ConvBnFusion_W_stage1_unit1_conv2_weight_zero_point"
    input: "stage1_unit1_bn3_scale"
    input: "stage1_unit1_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit1_bn3_beta_quantized"
    output: "stage1_unit1_bn3_quantized"
    name: "stage1_unit1_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_bn3_quantized"
    input: "stage1_unit1_bn3_scale"
    input: "stage1_unit1_bn3_zero_point"
    input: "stage1_unit1_sc_quantized"
    input: "stage1_unit1_sc_scale"
    input: "stage1_unit1_sc_zero_point"
    input: "_plus0_scale"
    input: "_plus0_zero_point"
    output: "_plus0_quantized"
    name: "_plus0_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus0_quantized"
    input: "_plus0_scale"
    input: "_plus0_zero_point"
    output: "_plus0"
    name: "_plus0__plus0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus0"
    input: "stage1_unit2_bn1_gamma"
    input: "stage1_unit2_bn1_beta"
    input: "stage1_unit2_bn1_moving_mean"
    input: "stage1_unit2_bn1_moving_var"
    output: "stage1_unit2_bn1"
    name: "stage1_unit2_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit2_bn1"
    input: "stage1_unit2_bn1_scale"
    input: "stage1_unit2_bn1_zero_point"
    output: "stage1_unit2_bn1_stage1_unit2_conv1_QuantizeLinear"
    name: "stage1_unit2_bn1_stage1_unit2_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit2_bn1_stage1_unit2_conv1_QuantizeLinear"
    input: "stage1_unit2_bn1_scale"
    input: "stage1_unit2_bn1_zero_point"
    input: "ConvBnFusion_W_stage1_unit2_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit2_conv1_weight_scale"
    input: "ConvBnFusion_W_stage1_unit2_conv1_weight_zero_point"
    input: "stage1_unit2_bn2_scale"
    input: "stage1_unit2_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit2_bn2_beta_quantized"
    output: "stage1_unit2_bn2_quantized"
    name: "stage1_unit2_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit2_bn2_quantized"
    input: "stage1_unit2_bn2_scale"
    input: "stage1_unit2_bn2_zero_point"
    output: "stage1_unit2_bn2"
    name: "stage1_unit2_bn2_stage1_unit2_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage1_unit2_bn2"
    input: "slope55"
    output: "stage1_unit2_relu1"
    name: "stage1_unit2_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit2_relu1"
    input: "stage1_unit2_relu1_scale"
    input: "stage1_unit2_relu1_zero_point"
    output: "stage1_unit2_relu1_stage1_unit2_conv2_QuantizeLinear"
    name: "stage1_unit2_relu1_stage1_unit2_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit2_relu1_stage1_unit2_conv2_QuantizeLinear"
    input: "stage1_unit2_relu1_scale"
    input: "stage1_unit2_relu1_zero_point"
    input: "ConvBnFusion_W_stage1_unit2_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit2_conv2_weight_scale"
    input: "ConvBnFusion_W_stage1_unit2_conv2_weight_zero_point"
    input: "stage1_unit2_bn3_scale"
    input: "stage1_unit2_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit2_bn3_beta_quantized"
    output: "stage1_unit2_bn3_quantized"
    name: "stage1_unit2_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit2_bn3_quantized"
    input: "stage1_unit2_bn3_scale"
    input: "stage1_unit2_bn3_zero_point"
    input: "_plus0_quantized"
    input: "_plus0_scale"
    input: "_plus0_zero_point"
    input: "_plus1_scale"
    input: "_plus1_zero_point"
    output: "_plus1_quantized"
    name: "_plus1_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus1_quantized"
    input: "_plus1_scale"
    input: "_plus1_zero_point"
    output: "_plus1"
    name: "_plus1__plus1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus1"
    input: "stage1_unit3_bn1_gamma"
    input: "stage1_unit3_bn1_beta"
    input: "stage1_unit3_bn1_moving_mean"
    input: "stage1_unit3_bn1_moving_var"
    output: "stage1_unit3_bn1"
    name: "stage1_unit3_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit3_bn1"
    input: "stage1_unit3_bn1_scale"
    input: "stage1_unit3_bn1_zero_point"
    output: "stage1_unit3_bn1_stage1_unit3_conv1_QuantizeLinear"
    name: "stage1_unit3_bn1_stage1_unit3_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit3_bn1_stage1_unit3_conv1_QuantizeLinear"
    input: "stage1_unit3_bn1_scale"
    input: "stage1_unit3_bn1_zero_point"
    input: "ConvBnFusion_W_stage1_unit3_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit3_conv1_weight_scale"
    input: "ConvBnFusion_W_stage1_unit3_conv1_weight_zero_point"
    input: "stage1_unit3_bn2_scale"
    input: "stage1_unit3_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit3_bn2_beta_quantized"
    output: "stage1_unit3_bn2_quantized"
    name: "stage1_unit3_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit3_bn2_quantized"
    input: "stage1_unit3_bn2_scale"
    input: "stage1_unit3_bn2_zero_point"
    output: "stage1_unit3_bn2"
    name: "stage1_unit3_bn2_stage1_unit3_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage1_unit3_bn2"
    input: "slope77"
    output: "stage1_unit3_relu1"
    name: "stage1_unit3_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit3_relu1"
    input: "stage1_unit3_relu1_scale"
    input: "stage1_unit3_relu1_zero_point"
    output: "stage1_unit3_relu1_stage1_unit3_conv2_QuantizeLinear"
    name: "stage1_unit3_relu1_stage1_unit3_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage1_unit3_relu1_stage1_unit3_conv2_QuantizeLinear"
    input: "stage1_unit3_relu1_scale"
    input: "stage1_unit3_relu1_zero_point"
    input: "ConvBnFusion_W_stage1_unit3_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage1_unit3_conv2_weight_scale"
    input: "ConvBnFusion_W_stage1_unit3_conv2_weight_zero_point"
    input: "stage1_unit3_bn3_scale"
    input: "stage1_unit3_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage1_unit3_bn3_beta_quantized"
    output: "stage1_unit3_bn3_quantized"
    name: "stage1_unit3_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit3_bn3_quantized"
    input: "stage1_unit3_bn3_scale"
    input: "stage1_unit3_bn3_zero_point"
    input: "_plus1_quantized"
    input: "_plus1_scale"
    input: "_plus1_zero_point"
    input: "_plus2_scale"
    input: "_plus2_zero_point"
    output: "_plus2_quantized"
    name: "_plus2_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus2_quantized"
    input: "_plus2_scale"
    input: "_plus2_zero_point"
    output: "_plus2"
    name: "_plus2__plus2_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus2_quantized"
    input: "_plus2_scale"
    input: "_plus2_zero_point"
    input: "ConvBnFusion_W_stage2_unit1_conv1sc_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit1_conv1sc_weight_scale"
    input: "ConvBnFusion_W_stage2_unit1_conv1sc_weight_zero_point"
    input: "stage2_unit1_sc_scale"
    input: "stage2_unit1_sc_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit1_sc_beta_quantized"
    output: "stage2_unit1_sc_quantized"
    name: "stage2_unit1_conv1sc_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "_plus2"
    input: "stage2_unit1_bn1_gamma"
    input: "stage2_unit1_bn1_beta"
    input: "stage2_unit1_bn1_moving_mean"
    input: "stage2_unit1_bn1_moving_var"
    output: "stage2_unit1_bn1"
    name: "stage2_unit1_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit1_bn1"
    input: "stage2_unit1_bn1_scale"
    input: "stage2_unit1_bn1_zero_point"
    output: "stage2_unit1_bn1_stage2_unit1_conv1_QuantizeLinear"
    name: "stage2_unit1_bn1_stage2_unit1_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit1_bn1_stage2_unit1_conv1_QuantizeLinear"
    input: "stage2_unit1_bn1_scale"
    input: "stage2_unit1_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit1_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit1_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit1_conv1_weight_zero_point"
    input: "stage2_unit1_bn2_scale"
    input: "stage2_unit1_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit1_bn2_beta_quantized"
    output: "stage2_unit1_bn2_quantized"
    name: "stage2_unit1_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit1_bn2_quantized"
    input: "stage2_unit1_bn2_scale"
    input: "stage2_unit1_bn2_zero_point"
    output: "stage2_unit1_bn2"
    name: "stage2_unit1_bn2_stage2_unit1_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit1_bn2"
    input: "slope99"
    output: "stage2_unit1_relu1"
    name: "stage2_unit1_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit1_relu1"
    input: "stage2_unit1_relu1_scale"
    input: "stage2_unit1_relu1_zero_point"
    output: "stage2_unit1_relu1_stage2_unit1_conv2_QuantizeLinear"
    name: "stage2_unit1_relu1_stage2_unit1_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit1_relu1_stage2_unit1_conv2_QuantizeLinear"
    input: "stage2_unit1_relu1_scale"
    input: "stage2_unit1_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit1_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit1_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit1_conv2_weight_zero_point"
    input: "stage2_unit1_bn3_scale"
    input: "stage2_unit1_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit1_bn3_beta_quantized"
    output: "stage2_unit1_bn3_quantized"
    name: "stage2_unit1_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage2_unit1_bn3_quantized"
    input: "stage2_unit1_bn3_scale"
    input: "stage2_unit1_bn3_zero_point"
    input: "stage2_unit1_sc_quantized"
    input: "stage2_unit1_sc_scale"
    input: "stage2_unit1_sc_zero_point"
    input: "_plus3_scale"
    input: "_plus3_zero_point"
    output: "_plus3_quantized"
    name: "_plus3_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus3_quantized"
    input: "_plus3_scale"
    input: "_plus3_zero_point"
    output: "_plus3"
    name: "_plus3__plus3_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus3"
    input: "stage2_unit2_bn1_gamma"
    input: "stage2_unit2_bn1_beta"
    input: "stage2_unit2_bn1_moving_mean"
    input: "stage2_unit2_bn1_moving_var"
    output: "stage2_unit2_bn1"
    name: "stage2_unit2_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit2_bn1"
    input: "stage2_unit2_bn1_scale"
    input: "stage2_unit2_bn1_zero_point"
    output: "stage2_unit2_bn1_stage2_unit2_conv1_QuantizeLinear"
    name: "stage2_unit2_bn1_stage2_unit2_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit2_bn1_stage2_unit2_conv1_QuantizeLinear"
    input: "stage2_unit2_bn1_scale"
    input: "stage2_unit2_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit2_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit2_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit2_conv1_weight_zero_point"
    input: "stage2_unit2_bn2_scale"
    input: "stage2_unit2_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit2_bn2_beta_quantized"
    output: "stage2_unit2_bn2_quantized"
    name: "stage2_unit2_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit2_bn2_quantized"
    input: "stage2_unit2_bn2_scale"
    input: "stage2_unit2_bn2_zero_point"
    output: "stage2_unit2_bn2"
    name: "stage2_unit2_bn2_stage2_unit2_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit2_bn2"
    input: "slope128"
    output: "stage2_unit2_relu1"
    name: "stage2_unit2_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit2_relu1"
    input: "stage2_unit2_relu1_scale"
    input: "stage2_unit2_relu1_zero_point"
    output: "stage2_unit2_relu1_stage2_unit2_conv2_QuantizeLinear"
    name: "stage2_unit2_relu1_stage2_unit2_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit2_relu1_stage2_unit2_conv2_QuantizeLinear"
    input: "stage2_unit2_relu1_scale"
    input: "stage2_unit2_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit2_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit2_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit2_conv2_weight_zero_point"
    input: "stage2_unit2_bn3_scale"
    input: "stage2_unit2_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit2_bn3_beta_quantized"
    output: "stage2_unit2_bn3_quantized"
    name: "stage2_unit2_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit2_bn3_quantized"
    input: "stage2_unit2_bn3_scale"
    input: "stage2_unit2_bn3_zero_point"
    input: "_plus3_quantized"
    input: "_plus3_scale"
    input: "_plus3_zero_point"
    input: "_plus4_scale"
    input: "_plus4_zero_point"
    output: "_plus4_quantized"
    name: "_plus4_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus4_quantized"
    input: "_plus4_scale"
    input: "_plus4_zero_point"
    output: "_plus4"
    name: "_plus4__plus4_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus4"
    input: "stage2_unit3_bn1_gamma"
    input: "stage2_unit3_bn1_beta"
    input: "stage2_unit3_bn1_moving_mean"
    input: "stage2_unit3_bn1_moving_var"
    output: "stage2_unit3_bn1"
    name: "stage2_unit3_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit3_bn1"
    input: "stage2_unit3_bn1_scale"
    input: "stage2_unit3_bn1_zero_point"
    output: "stage2_unit3_bn1_stage2_unit3_conv1_QuantizeLinear"
    name: "stage2_unit3_bn1_stage2_unit3_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit3_bn1_stage2_unit3_conv1_QuantizeLinear"
    input: "stage2_unit3_bn1_scale"
    input: "stage2_unit3_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit3_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit3_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit3_conv1_weight_zero_point"
    input: "stage2_unit3_bn2_scale"
    input: "stage2_unit3_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit3_bn2_beta_quantized"
    output: "stage2_unit3_bn2_quantized"
    name: "stage2_unit3_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit3_bn2_quantized"
    input: "stage2_unit3_bn2_scale"
    input: "stage2_unit3_bn2_zero_point"
    output: "stage2_unit3_bn2"
    name: "stage2_unit3_bn2_stage2_unit3_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit3_bn2"
    input: "slope150"
    output: "stage2_unit3_relu1"
    name: "stage2_unit3_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit3_relu1"
    input: "stage2_unit3_relu1_scale"
    input: "stage2_unit3_relu1_zero_point"
    output: "stage2_unit3_relu1_stage2_unit3_conv2_QuantizeLinear"
    name: "stage2_unit3_relu1_stage2_unit3_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit3_relu1_stage2_unit3_conv2_QuantizeLinear"
    input: "stage2_unit3_relu1_scale"
    input: "stage2_unit3_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit3_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit3_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit3_conv2_weight_zero_point"
    input: "stage2_unit3_bn3_scale"
    input: "stage2_unit3_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit3_bn3_beta_quantized"
    output: "stage2_unit3_bn3_quantized"
    name: "stage2_unit3_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit3_bn3_quantized"
    input: "stage2_unit3_bn3_scale"
    input: "stage2_unit3_bn3_zero_point"
    input: "_plus4_quantized"
    input: "_plus4_scale"
    input: "_plus4_zero_point"
    input: "_plus5_scale"
    input: "_plus5_zero_point"
    output: "_plus5_quantized"
    name: "_plus5_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus5_quantized"
    input: "_plus5_scale"
    input: "_plus5_zero_point"
    output: "_plus5"
    name: "_plus5__plus5_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus5"
    input: "stage2_unit4_bn1_gamma"
    input: "stage2_unit4_bn1_beta"
    input: "stage2_unit4_bn1_moving_mean"
    input: "stage2_unit4_bn1_moving_var"
    output: "stage2_unit4_bn1"
    name: "stage2_unit4_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit4_bn1"
    input: "stage2_unit4_bn1_scale"
    input: "stage2_unit4_bn1_zero_point"
    output: "stage2_unit4_bn1_stage2_unit4_conv1_QuantizeLinear"
    name: "stage2_unit4_bn1_stage2_unit4_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit4_bn1_stage2_unit4_conv1_QuantizeLinear"
    input: "stage2_unit4_bn1_scale"
    input: "stage2_unit4_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit4_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit4_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit4_conv1_weight_zero_point"
    input: "stage2_unit4_bn2_scale"
    input: "stage2_unit4_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit4_bn2_beta_quantized"
    output: "stage2_unit4_bn2_quantized"
    name: "stage2_unit4_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit4_bn2_quantized"
    input: "stage2_unit4_bn2_scale"
    input: "stage2_unit4_bn2_zero_point"
    output: "stage2_unit4_bn2"
    name: "stage2_unit4_bn2_stage2_unit4_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit4_bn2"
    input: "slope172"
    output: "stage2_unit4_relu1"
    name: "stage2_unit4_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit4_relu1"
    input: "stage2_unit4_relu1_scale"
    input: "stage2_unit4_relu1_zero_point"
    output: "stage2_unit4_relu1_stage2_unit4_conv2_QuantizeLinear"
    name: "stage2_unit4_relu1_stage2_unit4_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit4_relu1_stage2_unit4_conv2_QuantizeLinear"
    input: "stage2_unit4_relu1_scale"
    input: "stage2_unit4_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit4_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit4_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit4_conv2_weight_zero_point"
    input: "stage2_unit4_bn3_scale"
    input: "stage2_unit4_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit4_bn3_beta_quantized"
    output: "stage2_unit4_bn3_quantized"
    name: "stage2_unit4_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit4_bn3_quantized"
    input: "stage2_unit4_bn3_scale"
    input: "stage2_unit4_bn3_zero_point"
    input: "_plus5_quantized"
    input: "_plus5_scale"
    input: "_plus5_zero_point"
    input: "_plus6_scale"
    input: "_plus6_zero_point"
    output: "_plus6_quantized"
    name: "_plus6_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus6_quantized"
    input: "_plus6_scale"
    input: "_plus6_zero_point"
    output: "_plus6"
    name: "_plus6__plus6_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus6"
    input: "stage2_unit5_bn1_gamma"
    input: "stage2_unit5_bn1_beta"
    input: "stage2_unit5_bn1_moving_mean"
    input: "stage2_unit5_bn1_moving_var"
    output: "stage2_unit5_bn1"
    name: "stage2_unit5_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit5_bn1"
    input: "stage2_unit5_bn1_scale"
    input: "stage2_unit5_bn1_zero_point"
    output: "stage2_unit5_bn1_stage2_unit5_conv1_QuantizeLinear"
    name: "stage2_unit5_bn1_stage2_unit5_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit5_bn1_stage2_unit5_conv1_QuantizeLinear"
    input: "stage2_unit5_bn1_scale"
    input: "stage2_unit5_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit5_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit5_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit5_conv1_weight_zero_point"
    input: "stage2_unit5_bn2_scale"
    input: "stage2_unit5_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit5_bn2_beta_quantized"
    output: "stage2_unit5_bn2_quantized"
    name: "stage2_unit5_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit5_bn2_quantized"
    input: "stage2_unit5_bn2_scale"
    input: "stage2_unit5_bn2_zero_point"
    output: "stage2_unit5_bn2"
    name: "stage2_unit5_bn2_stage2_unit5_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit5_bn2"
    input: "slope194"
    output: "stage2_unit5_relu1"
    name: "stage2_unit5_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit5_relu1"
    input: "stage2_unit5_relu1_scale"
    input: "stage2_unit5_relu1_zero_point"
    output: "stage2_unit5_relu1_stage2_unit5_conv2_QuantizeLinear"
    name: "stage2_unit5_relu1_stage2_unit5_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit5_relu1_stage2_unit5_conv2_QuantizeLinear"
    input: "stage2_unit5_relu1_scale"
    input: "stage2_unit5_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit5_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit5_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit5_conv2_weight_zero_point"
    input: "stage2_unit5_bn3_scale"
    input: "stage2_unit5_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit5_bn3_beta_quantized"
    output: "stage2_unit5_bn3_quantized"
    name: "stage2_unit5_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit5_bn3_quantized"
    input: "stage2_unit5_bn3_scale"
    input: "stage2_unit5_bn3_zero_point"
    input: "_plus6_quantized"
    input: "_plus6_scale"
    input: "_plus6_zero_point"
    input: "_plus7_scale"
    input: "_plus7_zero_point"
    output: "_plus7_quantized"
    name: "_plus7_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus7_quantized"
    input: "_plus7_scale"
    input: "_plus7_zero_point"
    output: "_plus7"
    name: "_plus7__plus7_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus7"
    input: "stage2_unit6_bn1_gamma"
    input: "stage2_unit6_bn1_beta"
    input: "stage2_unit6_bn1_moving_mean"
    input: "stage2_unit6_bn1_moving_var"
    output: "stage2_unit6_bn1"
    name: "stage2_unit6_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit6_bn1"
    input: "stage2_unit6_bn1_scale"
    input: "stage2_unit6_bn1_zero_point"
    output: "stage2_unit6_bn1_stage2_unit6_conv1_QuantizeLinear"
    name: "stage2_unit6_bn1_stage2_unit6_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit6_bn1_stage2_unit6_conv1_QuantizeLinear"
    input: "stage2_unit6_bn1_scale"
    input: "stage2_unit6_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit6_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit6_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit6_conv1_weight_zero_point"
    input: "stage2_unit6_bn2_scale"
    input: "stage2_unit6_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit6_bn2_beta_quantized"
    output: "stage2_unit6_bn2_quantized"
    name: "stage2_unit6_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit6_bn2_quantized"
    input: "stage2_unit6_bn2_scale"
    input: "stage2_unit6_bn2_zero_point"
    output: "stage2_unit6_bn2"
    name: "stage2_unit6_bn2_stage2_unit6_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit6_bn2"
    input: "slope216"
    output: "stage2_unit6_relu1"
    name: "stage2_unit6_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit6_relu1"
    input: "stage2_unit6_relu1_scale"
    input: "stage2_unit6_relu1_zero_point"
    output: "stage2_unit6_relu1_stage2_unit6_conv2_QuantizeLinear"
    name: "stage2_unit6_relu1_stage2_unit6_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit6_relu1_stage2_unit6_conv2_QuantizeLinear"
    input: "stage2_unit6_relu1_scale"
    input: "stage2_unit6_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit6_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit6_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit6_conv2_weight_zero_point"
    input: "stage2_unit6_bn3_scale"
    input: "stage2_unit6_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit6_bn3_beta_quantized"
    output: "stage2_unit6_bn3_quantized"
    name: "stage2_unit6_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit6_bn3_quantized"
    input: "stage2_unit6_bn3_scale"
    input: "stage2_unit6_bn3_zero_point"
    input: "_plus7_quantized"
    input: "_plus7_scale"
    input: "_plus7_zero_point"
    input: "_plus8_scale"
    input: "_plus8_zero_point"
    output: "_plus8_quantized"
    name: "_plus8_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus8_quantized"
    input: "_plus8_scale"
    input: "_plus8_zero_point"
    output: "_plus8"
    name: "_plus8__plus8_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus8"
    input: "stage2_unit7_bn1_gamma"
    input: "stage2_unit7_bn1_beta"
    input: "stage2_unit7_bn1_moving_mean"
    input: "stage2_unit7_bn1_moving_var"
    output: "stage2_unit7_bn1"
    name: "stage2_unit7_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit7_bn1"
    input: "stage2_unit7_bn1_scale"
    input: "stage2_unit7_bn1_zero_point"
    output: "stage2_unit7_bn1_stage2_unit7_conv1_QuantizeLinear"
    name: "stage2_unit7_bn1_stage2_unit7_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit7_bn1_stage2_unit7_conv1_QuantizeLinear"
    input: "stage2_unit7_bn1_scale"
    input: "stage2_unit7_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit7_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit7_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit7_conv1_weight_zero_point"
    input: "stage2_unit7_bn2_scale"
    input: "stage2_unit7_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit7_bn2_beta_quantized"
    output: "stage2_unit7_bn2_quantized"
    name: "stage2_unit7_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit7_bn2_quantized"
    input: "stage2_unit7_bn2_scale"
    input: "stage2_unit7_bn2_zero_point"
    output: "stage2_unit7_bn2"
    name: "stage2_unit7_bn2_stage2_unit7_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit7_bn2"
    input: "slope238"
    output: "stage2_unit7_relu1"
    name: "stage2_unit7_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit7_relu1"
    input: "stage2_unit7_relu1_scale"
    input: "stage2_unit7_relu1_zero_point"
    output: "stage2_unit7_relu1_stage2_unit7_conv2_QuantizeLinear"
    name: "stage2_unit7_relu1_stage2_unit7_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit7_relu1_stage2_unit7_conv2_QuantizeLinear"
    input: "stage2_unit7_relu1_scale"
    input: "stage2_unit7_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit7_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit7_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit7_conv2_weight_zero_point"
    input: "stage2_unit7_bn3_scale"
    input: "stage2_unit7_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit7_bn3_beta_quantized"
    output: "stage2_unit7_bn3_quantized"
    name: "stage2_unit7_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit7_bn3_quantized"
    input: "stage2_unit7_bn3_scale"
    input: "stage2_unit7_bn3_zero_point"
    input: "_plus8_quantized"
    input: "_plus8_scale"
    input: "_plus8_zero_point"
    input: "_plus9_scale"
    input: "_plus9_zero_point"
    output: "_plus9_quantized"
    name: "_plus9_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "_plus9_quantized"
    input: "_plus9_scale"
    input: "_plus9_zero_point"
    output: "_plus9"
    name: "_plus9__plus9_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "_plus9"
    input: "stage2_unit8_bn1_gamma"
    input: "stage2_unit8_bn1_beta"
    input: "stage2_unit8_bn1_moving_mean"
    input: "stage2_unit8_bn1_moving_var"
    output: "stage2_unit8_bn1"
    name: "stage2_unit8_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "epsilon"
      f: 2e-05
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit8_bn1"
    input: "stage2_unit8_bn1_scale"
    input: "stage2_unit8_bn1_zero_point"
    output: "stage2_unit8_bn1_stage2_unit8_conv1_QuantizeLinear"
    name: "stage2_unit8_bn1_stage2_unit8_conv1_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit8_bn1_stage2_unit8_conv1_QuantizeLinear"
    input: "stage2_unit8_bn1_scale"
    input: "stage2_unit8_bn1_zero_point"
    input: "ConvBnFusion_W_stage2_unit8_conv1_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit8_conv1_weight_scale"
    input: "ConvBnFusion_W_stage2_unit8_conv1_weight_zero_point"
    input: "stage2_unit8_bn2_scale"
    input: "stage2_unit8_bn2_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit8_bn2_beta_quantized"
    output: "stage2_unit8_bn2_quantized"
    name: "stage2_unit8_conv1_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit8_bn2_quantized"
    input: "stage2_unit8_bn2_scale"
    input: "stage2_unit8_bn2_zero_point"
    output: "stage2_unit8_bn2"
    name: "stage2_unit8_bn2_stage2_unit8_conv1_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "stage2_unit8_bn2"
    input: "slope260"
    output: "stage2_unit8_relu1"
    name: "stage2_unit8_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit8_relu1"
    input: "stage2_unit8_relu1_scale"
    input: "stage2_unit8_relu1_zero_point"
    output: "stage2_unit8_relu1_stage2_unit8_conv2_QuantizeLinear"
    name: "stage2_unit8_relu1_stage2_unit8_conv2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "stage2_unit8_relu1_stage2_unit8_conv2_QuantizeLinear"
    input: "stage2_unit8_relu1_scale"
    input: "stage2_unit8_relu1_zero_point"
    input: "ConvBnFusion_W_stage2_unit8_conv2_weight_quantized"
    input: "ConvBnFusion_W_stage2_unit8_conv2_weight_scale"
    input: "ConvBnFusion_W_stage2_unit8_conv2_weight_zero_point"
    input: "stage2_unit8_bn3_scale"
    input: "stage2_unit8_bn3_zero_point"
    input: "ConvBnFusion_BN_B_stage2_unit8_bn3_beta_quantized"
    output: "stage2_unit8_bn3_quantized"
    name: "stage2_unit8_conv2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
