ir_version: 7
producer_name: "onnx-caffe2"
graph {
  node {
    input: "data_0"
    input: "conv1_w_0"
    output: "conv1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
  }
  node {
    input: "conv1_1"
    input: "conv1/bn_scale_0"
    input: "conv1/bn_bias_0"
    input: "conv1/bn_mean_0"
    input: "conv1/bn_var_0"
    output: "conv1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv1/bn_w_0"
    output: "OC2_DUMMY_0"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv1/bn_1"
    input: "OC2_DUMMY_0"
    output: "conv1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv1/bn_b_0"
    output: "OC2_DUMMY_1"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv1/bn_internal_1"
    input: "OC2_DUMMY_1"
    output: "conv1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv1/bn_2"
    output: "conv1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv1/bn_3"
    output: "pool1_1"
    op_type: "MaxPool"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "pool1_1"
    input: "conv2_1/x1/bn_scale_0"
    input: "conv2_1/x1/bn_bias_0"
    input: "conv2_1/x1/bn_mean_0"
    input: "conv2_1/x1/bn_var_0"
    output: "conv2_1/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_1/x1/bn_w_0"
    output: "OC2_DUMMY_2"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_1/x1/bn_1"
    input: "OC2_DUMMY_2"
    output: "conv2_1/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_1/x1/bn_b_0"
    output: "OC2_DUMMY_3"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_1/x1/bn_internal_1"
    input: "OC2_DUMMY_3"
    output: "conv2_1/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_1/x1/bn_2"
    output: "conv2_1/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_1/x1/bn_3"
    input: "conv2_1/x1_w_0"
    output: "conv2_1/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_1/x1_1"
    input: "conv2_1/x2/bn_scale_0"
    input: "conv2_1/x2/bn_bias_0"
    input: "conv2_1/x2/bn_mean_0"
    input: "conv2_1/x2/bn_var_0"
    output: "conv2_1/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_1/x2/bn_w_0"
    output: "OC2_DUMMY_4"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_1/x2/bn_1"
    input: "OC2_DUMMY_4"
    output: "conv2_1/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_1/x2/bn_b_0"
    output: "OC2_DUMMY_5"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_1/x2/bn_internal_1"
    input: "OC2_DUMMY_5"
    output: "conv2_1/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_1/x2/bn_2"
    output: "conv2_1/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_1/x2/bn_3"
    input: "conv2_1/x2_w_0"
    output: "conv2_1/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "pool1_1"
    input: "conv2_1/x2_1"
    output: "concat_2_1_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_1_1"
    input: "conv2_2/x1/bn_scale_0"
    input: "conv2_2/x1/bn_bias_0"
    input: "conv2_2/x1/bn_mean_0"
    input: "conv2_2/x1/bn_var_0"
    output: "conv2_2/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_2/x1/bn_w_0"
    output: "OC2_DUMMY_6"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_2/x1/bn_1"
    input: "OC2_DUMMY_6"
    output: "conv2_2/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_2/x1/bn_b_0"
    output: "OC2_DUMMY_7"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_2/x1/bn_internal_1"
    input: "OC2_DUMMY_7"
    output: "conv2_2/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_2/x1/bn_2"
    output: "conv2_2/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_2/x1/bn_3"
    input: "conv2_2/x1_w_0"
    output: "conv2_2/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_2/x1_1"
    input: "conv2_2/x2/bn_scale_0"
    input: "conv2_2/x2/bn_bias_0"
    input: "conv2_2/x2/bn_mean_0"
    input: "conv2_2/x2/bn_var_0"
    output: "conv2_2/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_2/x2/bn_w_0"
    output: "OC2_DUMMY_8"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_2/x2/bn_1"
    input: "OC2_DUMMY_8"
    output: "conv2_2/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_2/x2/bn_b_0"
    output: "OC2_DUMMY_9"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_2/x2/bn_internal_1"
    input: "OC2_DUMMY_9"
    output: "conv2_2/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_2/x2/bn_2"
    output: "conv2_2/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_2/x2/bn_3"
    input: "conv2_2/x2_w_0"
    output: "conv2_2/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_2_1_1"
    input: "conv2_2/x2_1"
    output: "concat_2_2_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_2_1"
    input: "conv2_3/x1/bn_scale_0"
    input: "conv2_3/x1/bn_bias_0"
    input: "conv2_3/x1/bn_mean_0"
    input: "conv2_3/x1/bn_var_0"
    output: "conv2_3/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_3/x1/bn_w_0"
    output: "OC2_DUMMY_10"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_3/x1/bn_1"
    input: "OC2_DUMMY_10"
    output: "conv2_3/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_3/x1/bn_b_0"
    output: "OC2_DUMMY_11"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_3/x1/bn_internal_1"
    input: "OC2_DUMMY_11"
    output: "conv2_3/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_3/x1/bn_2"
    output: "conv2_3/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_3/x1/bn_3"
    input: "conv2_3/x1_w_0"
    output: "conv2_3/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_3/x1_1"
    input: "conv2_3/x2/bn_scale_0"
    input: "conv2_3/x2/bn_bias_0"
    input: "conv2_3/x2/bn_mean_0"
    input: "conv2_3/x2/bn_var_0"
    output: "conv2_3/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_3/x2/bn_w_0"
    output: "OC2_DUMMY_12"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_3/x2/bn_1"
    input: "OC2_DUMMY_12"
    output: "conv2_3/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_3/x2/bn_b_0"
    output: "OC2_DUMMY_13"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_3/x2/bn_internal_1"
    input: "OC2_DUMMY_13"
    output: "conv2_3/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_3/x2/bn_2"
    output: "conv2_3/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_3/x2/bn_3"
    input: "conv2_3/x2_w_0"
    output: "conv2_3/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_2_2_1"
    input: "conv2_3/x2_1"
    output: "concat_2_3_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_3_1"
    input: "conv2_4/x1/bn_scale_0"
    input: "conv2_4/x1/bn_bias_0"
    input: "conv2_4/x1/bn_mean_0"
    input: "conv2_4/x1/bn_var_0"
    output: "conv2_4/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_4/x1/bn_w_0"
    output: "OC2_DUMMY_14"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_4/x1/bn_1"
    input: "OC2_DUMMY_14"
    output: "conv2_4/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_4/x1/bn_b_0"
    output: "OC2_DUMMY_15"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_4/x1/bn_internal_1"
    input: "OC2_DUMMY_15"
    output: "conv2_4/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_4/x1/bn_2"
    output: "conv2_4/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_4/x1/bn_3"
    input: "conv2_4/x1_w_0"
    output: "conv2_4/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_4/x1_1"
    input: "conv2_4/x2/bn_scale_0"
    input: "conv2_4/x2/bn_bias_0"
    input: "conv2_4/x2/bn_mean_0"
    input: "conv2_4/x2/bn_var_0"
    output: "conv2_4/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_4/x2/bn_w_0"
    output: "OC2_DUMMY_16"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_4/x2/bn_1"
    input: "OC2_DUMMY_16"
    output: "conv2_4/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_4/x2/bn_b_0"
    output: "OC2_DUMMY_17"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_4/x2/bn_internal_1"
    input: "OC2_DUMMY_17"
    output: "conv2_4/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_4/x2/bn_2"
    output: "conv2_4/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_4/x2/bn_3"
    input: "conv2_4/x2_w_0"
    output: "conv2_4/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_2_3_1"
    input: "conv2_4/x2_1"
    output: "concat_2_4_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_4_1"
    input: "conv2_5/x1/bn_scale_0"
    input: "conv2_5/x1/bn_bias_0"
    input: "conv2_5/x1/bn_mean_0"
    input: "conv2_5/x1/bn_var_0"
    output: "conv2_5/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_5/x1/bn_w_0"
    output: "OC2_DUMMY_18"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_5/x1/bn_1"
    input: "OC2_DUMMY_18"
    output: "conv2_5/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_5/x1/bn_b_0"
    output: "OC2_DUMMY_19"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_5/x1/bn_internal_1"
    input: "OC2_DUMMY_19"
    output: "conv2_5/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_5/x1/bn_2"
    output: "conv2_5/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_5/x1/bn_3"
    input: "conv2_5/x1_w_0"
    output: "conv2_5/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_5/x1_1"
    input: "conv2_5/x2/bn_scale_0"
    input: "conv2_5/x2/bn_bias_0"
    input: "conv2_5/x2/bn_mean_0"
    input: "conv2_5/x2/bn_var_0"
    output: "conv2_5/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_5/x2/bn_w_0"
    output: "OC2_DUMMY_20"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_5/x2/bn_1"
    input: "OC2_DUMMY_20"
    output: "conv2_5/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_5/x2/bn_b_0"
    output: "OC2_DUMMY_21"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_5/x2/bn_internal_1"
    input: "OC2_DUMMY_21"
    output: "conv2_5/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_5/x2/bn_2"
    output: "conv2_5/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_5/x2/bn_3"
    input: "conv2_5/x2_w_0"
    output: "conv2_5/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_2_4_1"
    input: "conv2_5/x2_1"
    output: "concat_2_5_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_5_1"
    input: "conv2_6/x1/bn_scale_0"
    input: "conv2_6/x1/bn_bias_0"
    input: "conv2_6/x1/bn_mean_0"
    input: "conv2_6/x1/bn_var_0"
    output: "conv2_6/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_6/x1/bn_w_0"
    output: "OC2_DUMMY_22"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_6/x1/bn_1"
    input: "OC2_DUMMY_22"
    output: "conv2_6/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_6/x1/bn_b_0"
    output: "OC2_DUMMY_23"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_6/x1/bn_internal_1"
    input: "OC2_DUMMY_23"
    output: "conv2_6/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_6/x1/bn_2"
    output: "conv2_6/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_6/x1/bn_3"
    input: "conv2_6/x1_w_0"
    output: "conv2_6/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_6/x1_1"
    input: "conv2_6/x2/bn_scale_0"
    input: "conv2_6/x2/bn_bias_0"
    input: "conv2_6/x2/bn_mean_0"
    input: "conv2_6/x2/bn_var_0"
    output: "conv2_6/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_6/x2/bn_w_0"
    output: "OC2_DUMMY_24"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_6/x2/bn_1"
    input: "OC2_DUMMY_24"
    output: "conv2_6/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_6/x2/bn_b_0"
    output: "OC2_DUMMY_25"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_6/x2/bn_internal_1"
    input: "OC2_DUMMY_25"
    output: "conv2_6/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_6/x2/bn_2"
    output: "conv2_6/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_6/x2/bn_3"
    input: "conv2_6/x2_w_0"
    output: "conv2_6/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_2_5_1"
    input: "conv2_6/x2_1"
    output: "concat_2_6_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_2_6_1"
    input: "conv2_blk/bn_scale_0"
    input: "conv2_blk/bn_bias_0"
    input: "conv2_blk/bn_mean_0"
    input: "conv2_blk/bn_var_0"
    output: "conv2_blk/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv2_blk/bn_w_0"
    output: "OC2_DUMMY_26"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_blk/bn_1"
    input: "OC2_DUMMY_26"
    output: "conv2_blk/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv2_blk/bn_b_0"
    output: "OC2_DUMMY_27"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv2_blk/bn_internal_1"
    input: "OC2_DUMMY_27"
    output: "conv2_blk/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv2_blk/bn_2"
    output: "conv2_blk/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv2_blk/bn_3"
    input: "conv2_blk_w_0"
    output: "conv2_blk_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv2_blk_1"
    output: "pool2_1"
    op_type: "AveragePool"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "pool2_1"
    input: "conv3_1/x1/bn_scale_0"
    input: "conv3_1/x1/bn_bias_0"
    input: "conv3_1/x1/bn_mean_0"
    input: "conv3_1/x1/bn_var_0"
    output: "conv3_1/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_1/x1/bn_w_0"
    output: "OC2_DUMMY_28"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_1/x1/bn_1"
    input: "OC2_DUMMY_28"
    output: "conv3_1/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_1/x1/bn_b_0"
    output: "OC2_DUMMY_29"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_1/x1/bn_internal_1"
    input: "OC2_DUMMY_29"
    output: "conv3_1/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_1/x1/bn_2"
    output: "conv3_1/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_1/x1/bn_3"
    input: "conv3_1/x1_w_0"
    output: "conv3_1/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_1/x1_1"
    input: "conv3_1/x2/bn_scale_0"
    input: "conv3_1/x2/bn_bias_0"
    input: "conv3_1/x2/bn_mean_0"
    input: "conv3_1/x2/bn_var_0"
    output: "conv3_1/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_1/x2/bn_w_0"
    output: "OC2_DUMMY_30"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_1/x2/bn_1"
    input: "OC2_DUMMY_30"
    output: "conv3_1/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_1/x2/bn_b_0"
    output: "OC2_DUMMY_31"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_1/x2/bn_internal_1"
    input: "OC2_DUMMY_31"
    output: "conv3_1/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_1/x2/bn_2"
    output: "conv3_1/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_1/x2/bn_3"
    input: "conv3_1/x2_w_0"
    output: "conv3_1/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "pool2_1"
    input: "conv3_1/x2_1"
    output: "concat_3_1_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_1_1"
    input: "conv3_2/x1/bn_scale_0"
    input: "conv3_2/x1/bn_bias_0"
    input: "conv3_2/x1/bn_mean_0"
    input: "conv3_2/x1/bn_var_0"
    output: "conv3_2/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_2/x1/bn_w_0"
    output: "OC2_DUMMY_32"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_2/x1/bn_1"
    input: "OC2_DUMMY_32"
    output: "conv3_2/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_2/x1/bn_b_0"
    output: "OC2_DUMMY_33"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_2/x1/bn_internal_1"
    input: "OC2_DUMMY_33"
    output: "conv3_2/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_2/x1/bn_2"
    output: "conv3_2/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_2/x1/bn_3"
    input: "conv3_2/x1_w_0"
    output: "conv3_2/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_2/x1_1"
    input: "conv3_2/x2/bn_scale_0"
    input: "conv3_2/x2/bn_bias_0"
    input: "conv3_2/x2/bn_mean_0"
    input: "conv3_2/x2/bn_var_0"
    output: "conv3_2/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_2/x2/bn_w_0"
    output: "OC2_DUMMY_34"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_2/x2/bn_1"
    input: "OC2_DUMMY_34"
    output: "conv3_2/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_2/x2/bn_b_0"
    output: "OC2_DUMMY_35"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_2/x2/bn_internal_1"
    input: "OC2_DUMMY_35"
    output: "conv3_2/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_2/x2/bn_2"
    output: "conv3_2/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_2/x2/bn_3"
    input: "conv3_2/x2_w_0"
    output: "conv3_2/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_1_1"
    input: "conv3_2/x2_1"
    output: "concat_3_2_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_2_1"
    input: "conv3_3/x1/bn_scale_0"
    input: "conv3_3/x1/bn_bias_0"
    input: "conv3_3/x1/bn_mean_0"
    input: "conv3_3/x1/bn_var_0"
    output: "conv3_3/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_3/x1/bn_w_0"
    output: "OC2_DUMMY_36"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_3/x1/bn_1"
    input: "OC2_DUMMY_36"
    output: "conv3_3/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_3/x1/bn_b_0"
    output: "OC2_DUMMY_37"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_3/x1/bn_internal_1"
    input: "OC2_DUMMY_37"
    output: "conv3_3/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_3/x1/bn_2"
    output: "conv3_3/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_3/x1/bn_3"
    input: "conv3_3/x1_w_0"
    output: "conv3_3/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_3/x1_1"
    input: "conv3_3/x2/bn_scale_0"
    input: "conv3_3/x2/bn_bias_0"
    input: "conv3_3/x2/bn_mean_0"
    input: "conv3_3/x2/bn_var_0"
    output: "conv3_3/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_3/x2/bn_w_0"
    output: "OC2_DUMMY_38"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_3/x2/bn_1"
    input: "OC2_DUMMY_38"
    output: "conv3_3/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_3/x2/bn_b_0"
    output: "OC2_DUMMY_39"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_3/x2/bn_internal_1"
    input: "OC2_DUMMY_39"
    output: "conv3_3/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_3/x2/bn_2"
    output: "conv3_3/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_3/x2/bn_3"
    input: "conv3_3/x2_w_0"
    output: "conv3_3/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_2_1"
    input: "conv3_3/x2_1"
    output: "concat_3_3_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_3_1"
    input: "conv3_4/x1/bn_scale_0"
    input: "conv3_4/x1/bn_bias_0"
    input: "conv3_4/x1/bn_mean_0"
    input: "conv3_4/x1/bn_var_0"
    output: "conv3_4/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_4/x1/bn_w_0"
    output: "OC2_DUMMY_40"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_4/x1/bn_1"
    input: "OC2_DUMMY_40"
    output: "conv3_4/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_4/x1/bn_b_0"
    output: "OC2_DUMMY_41"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_4/x1/bn_internal_1"
    input: "OC2_DUMMY_41"
    output: "conv3_4/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_4/x1/bn_2"
    output: "conv3_4/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_4/x1/bn_3"
    input: "conv3_4/x1_w_0"
    output: "conv3_4/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_4/x1_1"
    input: "conv3_4/x2/bn_scale_0"
    input: "conv3_4/x2/bn_bias_0"
    input: "conv3_4/x2/bn_mean_0"
    input: "conv3_4/x2/bn_var_0"
    output: "conv3_4/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_4/x2/bn_w_0"
    output: "OC2_DUMMY_42"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_4/x2/bn_1"
    input: "OC2_DUMMY_42"
    output: "conv3_4/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_4/x2/bn_b_0"
    output: "OC2_DUMMY_43"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_4/x2/bn_internal_1"
    input: "OC2_DUMMY_43"
    output: "conv3_4/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_4/x2/bn_2"
    output: "conv3_4/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_4/x2/bn_3"
    input: "conv3_4/x2_w_0"
    output: "conv3_4/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_3_1"
    input: "conv3_4/x2_1"
    output: "concat_3_4_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_4_1"
    input: "conv3_5/x1/bn_scale_0"
    input: "conv3_5/x1/bn_bias_0"
    input: "conv3_5/x1/bn_mean_0"
    input: "conv3_5/x1/bn_var_0"
    output: "conv3_5/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_5/x1/bn_w_0"
    output: "OC2_DUMMY_44"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_5/x1/bn_1"
    input: "OC2_DUMMY_44"
    output: "conv3_5/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_5/x1/bn_b_0"
    output: "OC2_DUMMY_45"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_5/x1/bn_internal_1"
    input: "OC2_DUMMY_45"
    output: "conv3_5/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_5/x1/bn_2"
    output: "conv3_5/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_5/x1/bn_3"
    input: "conv3_5/x1_w_0"
    output: "conv3_5/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_5/x1_1"
    input: "conv3_5/x2/bn_scale_0"
    input: "conv3_5/x2/bn_bias_0"
    input: "conv3_5/x2/bn_mean_0"
    input: "conv3_5/x2/bn_var_0"
    output: "conv3_5/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_5/x2/bn_w_0"
    output: "OC2_DUMMY_46"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_5/x2/bn_1"
    input: "OC2_DUMMY_46"
    output: "conv3_5/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_5/x2/bn_b_0"
    output: "OC2_DUMMY_47"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_5/x2/bn_internal_1"
    input: "OC2_DUMMY_47"
    output: "conv3_5/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_5/x2/bn_2"
    output: "conv3_5/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_5/x2/bn_3"
    input: "conv3_5/x2_w_0"
    output: "conv3_5/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_4_1"
    input: "conv3_5/x2_1"
    output: "concat_3_5_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_5_1"
    input: "conv3_6/x1/bn_scale_0"
    input: "conv3_6/x1/bn_bias_0"
    input: "conv3_6/x1/bn_mean_0"
    input: "conv3_6/x1/bn_var_0"
    output: "conv3_6/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_6/x1/bn_w_0"
    output: "OC2_DUMMY_48"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_6/x1/bn_1"
    input: "OC2_DUMMY_48"
    output: "conv3_6/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_6/x1/bn_b_0"
    output: "OC2_DUMMY_49"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_6/x1/bn_internal_1"
    input: "OC2_DUMMY_49"
    output: "conv3_6/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_6/x1/bn_2"
    output: "conv3_6/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_6/x1/bn_3"
    input: "conv3_6/x1_w_0"
    output: "conv3_6/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_6/x1_1"
    input: "conv3_6/x2/bn_scale_0"
    input: "conv3_6/x2/bn_bias_0"
    input: "conv3_6/x2/bn_mean_0"
    input: "conv3_6/x2/bn_var_0"
    output: "conv3_6/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_6/x2/bn_w_0"
    output: "OC2_DUMMY_50"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_6/x2/bn_1"
    input: "OC2_DUMMY_50"
    output: "conv3_6/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_6/x2/bn_b_0"
    output: "OC2_DUMMY_51"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_6/x2/bn_internal_1"
    input: "OC2_DUMMY_51"
    output: "conv3_6/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_6/x2/bn_2"
    output: "conv3_6/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_6/x2/bn_3"
    input: "conv3_6/x2_w_0"
    output: "conv3_6/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_5_1"
    input: "conv3_6/x2_1"
    output: "concat_3_6_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_6_1"
    input: "conv3_7/x1/bn_scale_0"
    input: "conv3_7/x1/bn_bias_0"
    input: "conv3_7/x1/bn_mean_0"
    input: "conv3_7/x1/bn_var_0"
    output: "conv3_7/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_7/x1/bn_w_0"
    output: "OC2_DUMMY_52"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_7/x1/bn_1"
    input: "OC2_DUMMY_52"
    output: "conv3_7/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_7/x1/bn_b_0"
    output: "OC2_DUMMY_53"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_7/x1/bn_internal_1"
    input: "OC2_DUMMY_53"
    output: "conv3_7/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_7/x1/bn_2"
    output: "conv3_7/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_7/x1/bn_3"
    input: "conv3_7/x1_w_0"
    output: "conv3_7/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_7/x1_1"
    input: "conv3_7/x2/bn_scale_0"
    input: "conv3_7/x2/bn_bias_0"
    input: "conv3_7/x2/bn_mean_0"
    input: "conv3_7/x2/bn_var_0"
    output: "conv3_7/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_7/x2/bn_w_0"
    output: "OC2_DUMMY_54"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_7/x2/bn_1"
    input: "OC2_DUMMY_54"
    output: "conv3_7/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_7/x2/bn_b_0"
    output: "OC2_DUMMY_55"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_7/x2/bn_internal_1"
    input: "OC2_DUMMY_55"
    output: "conv3_7/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_7/x2/bn_2"
    output: "conv3_7/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_7/x2/bn_3"
    input: "conv3_7/x2_w_0"
    output: "conv3_7/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_6_1"
    input: "conv3_7/x2_1"
    output: "concat_3_7_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_7_1"
    input: "conv3_8/x1/bn_scale_0"
    input: "conv3_8/x1/bn_bias_0"
    input: "conv3_8/x1/bn_mean_0"
    input: "conv3_8/x1/bn_var_0"
    output: "conv3_8/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_8/x1/bn_w_0"
    output: "OC2_DUMMY_56"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_8/x1/bn_1"
    input: "OC2_DUMMY_56"
    output: "conv3_8/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_8/x1/bn_b_0"
    output: "OC2_DUMMY_57"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_8/x1/bn_internal_1"
    input: "OC2_DUMMY_57"
    output: "conv3_8/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_8/x1/bn_2"
    output: "conv3_8/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_8/x1/bn_3"
    input: "conv3_8/x1_w_0"
    output: "conv3_8/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_8/x1_1"
    input: "conv3_8/x2/bn_scale_0"
    input: "conv3_8/x2/bn_bias_0"
    input: "conv3_8/x2/bn_mean_0"
    input: "conv3_8/x2/bn_var_0"
    output: "conv3_8/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_8/x2/bn_w_0"
    output: "OC2_DUMMY_58"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_8/x2/bn_1"
    input: "OC2_DUMMY_58"
    output: "conv3_8/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_8/x2/bn_b_0"
    output: "OC2_DUMMY_59"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_8/x2/bn_internal_1"
    input: "OC2_DUMMY_59"
    output: "conv3_8/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_8/x2/bn_2"
    output: "conv3_8/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_8/x2/bn_3"
    input: "conv3_8/x2_w_0"
    output: "conv3_8/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_7_1"
    input: "conv3_8/x2_1"
    output: "concat_3_8_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_8_1"
    input: "conv3_9/x1/bn_scale_0"
    input: "conv3_9/x1/bn_bias_0"
    input: "conv3_9/x1/bn_mean_0"
    input: "conv3_9/x1/bn_var_0"
    output: "conv3_9/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_9/x1/bn_w_0"
    output: "OC2_DUMMY_60"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_9/x1/bn_1"
    input: "OC2_DUMMY_60"
    output: "conv3_9/x1/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_9/x1/bn_b_0"
    output: "OC2_DUMMY_61"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_9/x1/bn_internal_1"
    input: "OC2_DUMMY_61"
    output: "conv3_9/x1/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_9/x1/bn_2"
    output: "conv3_9/x1/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_9/x1/bn_3"
    input: "conv3_9/x1_w_0"
    output: "conv3_9/x1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv3_9/x1_1"
    input: "conv3_9/x2/bn_scale_0"
    input: "conv3_9/x2/bn_bias_0"
    input: "conv3_9/x2/bn_mean_0"
    input: "conv3_9/x2/bn_var_0"
    output: "conv3_9/x2/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_9/x2/bn_w_0"
    output: "OC2_DUMMY_62"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_9/x2/bn_1"
    input: "OC2_DUMMY_62"
    output: "conv3_9/x2/bn_internal_1"
    op_type: "Mul"
  }
  node {
    input: "conv3_9/x2/bn_b_0"
    output: "OC2_DUMMY_63"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_9/x2/bn_internal_1"
    input: "OC2_DUMMY_63"
    output: "conv3_9/x2/bn_2"
    op_type: "Add"
  }
  node {
    input: "conv3_9/x2/bn_2"
    output: "conv3_9/x2/bn_3"
    op_type: "Relu"
  }
  node {
    input: "conv3_9/x2/bn_3"
    input: "conv3_9/x2_w_0"
    output: "conv3_9/x2_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  node {
    input: "concat_3_8_1"
    input: "conv3_9/x2_1"
    output: "concat_3_9_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "concat_3_9_1"
    input: "conv3_10/x1/bn_scale_0"
    input: "conv3_10/x1/bn_bias_0"
    input: "conv3_10/x1/bn_mean_0"
    input: "conv3_10/x1/bn_var_0"
    output: "conv3_10/x1/bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  node {
    input: "conv3_10/x1/bn_w_0"
    output: "OC2_DUMMY_64"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv3_10/x1/bn_1"
    input: "OC2_DUMMY_64"
