ir_version: 6
producer_name: "onnx.quantize"
producer_version: "0.1.0"
graph {
  node {
    input: "images:0"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D__5"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_scale"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_zero_point"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_QuantizeLinear"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_QuantizeLinear"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_scale"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_zero_point"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_dequantized"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0_efficientnet-lite4/model/stem/conv2d/Conv2D_dequantized"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/stem/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_dequantized"
    name: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_dequantized"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 32
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/conv2d/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/conv2d/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/conv2d/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_0/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_quantized"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_scale"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_zero_point"
    output: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_dequantized"
    name: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_quantized"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_scale"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_zero_point"
    output: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_dequantized"
    name: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d/Conv2D_dequantized"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0_dequantized"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0_dequantized"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_1/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_dequantized"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_dequantized"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_quantized"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_scale"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_zero_point"
    output: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_dequantized"
    name: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_quantized"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_scale"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_zero_point"
    output: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_dequantized"
    name: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "ConvBnFusion_W_efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0_dequantized"
    input: "ConvBnFusion_BN_B_efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0_dequantized"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_2/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_dequantized"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_dequantized"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    output: "efficientnet-lite4/model/blocks_2/Add:0"
    name: "efficientnet-lite4/model/blocks_2/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Add:0"
    input: "efficientnet-lite4/model/blocks_2/Add:0_scale"
    input: "efficientnet-lite4/model/blocks_2/Add:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_QuantizeLinear"
    name: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_QuantizeLinear"
    input: "efficientnet-lite4/model/blocks_2/Add:0_scale"
    input: "efficientnet-lite4/model/blocks_2/Add:0_zero_point"
    output: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Add:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_dequantized"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_dequantized"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_quantized"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_scale"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_zero_point"
    output: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    name: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_2/Add:0"
    output: "efficientnet-lite4/model/blocks_3/Add:0"
    name: "efficientnet-lite4/model/blocks_3/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Add:0"
    input: "efficientnet-lite4/model/blocks_3/Add:0_scale"
    input: "efficientnet-lite4/model/blocks_3/Add:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_QuantizeLinear"
    name: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_QuantizeLinear"
    input: "efficientnet-lite4/model/blocks_3/Add:0_scale"
    input: "efficientnet-lite4/model/blocks_3/Add:0_zero_point"
    output: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_dequantized"
    name: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Add:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_dequantized"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_quant"
    op_type: "Conv"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_QuantizeInput"
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    name: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_4/conv2d/Conv2D_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_quantized"
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_scale"
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_zero_point"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_dequantized"
    name: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0_efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_dequantized"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn_dequantized"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn_dequantized"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3:0_QuantizeInput"
    name: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
