ir_version: 6
producer_name: "tf2onnx"
producer_version: "1.7.0"
graph {
  node {
    input: "images:0"
    output: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D__5"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D__5:0"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/stem/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/stem/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/stem/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/stem/Relu6:0"
    name: "efficientnet-lite4/model/stem/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/stem/Relu6:0"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 32
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_0/Relu6:0"
    name: "efficientnet-lite4/model/blocks_0/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/Relu6:0"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_0/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_1/conv2d/Conv2D/ReadVariableOp:0"
    output: "efficientnet-lite4/model/blocks_1/conv2d/Conv2D:0"
    name: "efficientnet-lite4/model/blocks_1/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/conv2d/Conv2D:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/ReadVariableOp_1:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1:0"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.001
      type: FLOAT
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_1/Relu6:0"
    name: "efficientnet-lite4/model/blocks_1/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/Relu6:0"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_1/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_1/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_2/conv2d/Conv2D/ReadVariableOp:0"
    output: "efficientnet-lite4/model/blocks_2/conv2d/Conv2D:0"
    name: "efficientnet-lite4/model/blocks_2/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/conv2d/Conv2D:0"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/ReadVariableOp_1:0"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1:0"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.001
      type: FLOAT
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_2/Relu6:0"
    name: "efficientnet-lite4/model/blocks_2/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Relu6:0"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_2/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_2/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3:0"
    output: "efficientnet-lite4/model/blocks_2/Add:0"
    name: "efficientnet-lite4/model/blocks_2/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_2/Add:0"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_3/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_3/Relu6:0"
    name: "efficientnet-lite4/model/blocks_3/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Relu6:0"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_3/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_3/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_2/Add:0"
    output: "efficientnet-lite4/model/blocks_3/Add:0"
    name: "efficientnet-lite4/model/blocks_3/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_3/Add:0"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_4/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_4/Relu6:0"
    name: "efficientnet-lite4/model/blocks_4/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/Relu6:0"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_4/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_4/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_4/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_4/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_4/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_3/Add:0"
    output: "efficientnet-lite4/model/blocks_4/Add:0"
    name: "efficientnet-lite4/model/blocks_4/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_4/Add:0"
    input: "efficientnet-lite4/model/blocks_5/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_5/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_5/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_5/Relu6:0"
    name: "efficientnet-lite4/model/blocks_5/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_5/Relu6:0"
    input: "efficientnet-lite4/model/blocks_5/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_5/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_5/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_5/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_5/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_5/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_5/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_5/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_5/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_6/conv2d/Conv2D/ReadVariableOp:0"
    output: "efficientnet-lite4/model/blocks_6/conv2d/Conv2D:0"
    name: "efficientnet-lite4/model/blocks_6/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/conv2d/Conv2D:0"
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/ReadVariableOp_1:0"
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1:0"
    output: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.001
      type: FLOAT
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_6/Relu6:0"
    name: "efficientnet-lite4/model/blocks_6/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/Relu6:0"
    input: "efficientnet-lite4/model/blocks_6/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_6/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_6/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 336
      type: INT
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_6/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_6/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_6/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_6/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_6/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3:0"
    output: "efficientnet-lite4/model/blocks_6/Add:0"
    name: "efficientnet-lite4/model/blocks_6/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_6/Add:0"
    input: "efficientnet-lite4/model/blocks_7/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_7/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_7/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_7/Relu6:0"
    name: "efficientnet-lite4/model/blocks_7/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/Relu6:0"
    input: "efficientnet-lite4/model/blocks_7/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_7/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_7/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 336
      type: INT
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_7/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_7/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_7/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_7/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_7/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_6/Add:0"
    output: "efficientnet-lite4/model/blocks_7/Add:0"
    name: "efficientnet-lite4/model/blocks_7/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_7/Add:0"
    input: "efficientnet-lite4/model/blocks_8/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_8/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_8/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_8/Relu6:0"
    name: "efficientnet-lite4/model/blocks_8/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/Relu6:0"
    input: "efficientnet-lite4/model/blocks_8/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_8/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_8/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "group"
      i: 336
      type: INT
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_8/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_8/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_8/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_8/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_8/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_7/Add:0"
    output: "efficientnet-lite4/model/blocks_8/Add:0"
    name: "efficientnet-lite4/model/blocks_8/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_8/Add:0"
    input: "efficientnet-lite4/model/blocks_9/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_9/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_9/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_9/Relu6:0"
    name: "efficientnet-lite4/model/blocks_9/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_9/Relu6:0"
    input: "efficientnet-lite4/model/blocks_9/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_9/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_9/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 336
      type: INT
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_9/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_9/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_9/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_9/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_9/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_9/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_10/conv2d/Conv2D/ReadVariableOp:0"
    output: "efficientnet-lite4/model/blocks_10/conv2d/Conv2D:0"
    name: "efficientnet-lite4/model/blocks_10/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/conv2d/Conv2D:0"
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/ReadVariableOp_1:0"
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp:0"
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1:0"
    output: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.001
      type: FLOAT
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_10/Relu6:0"
    name: "efficientnet-lite4/model/blocks_10/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/Relu6:0"
    input: "efficientnet-lite4/model/blocks_10/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_10/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_10/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 672
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_10/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_10/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_10/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_10/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_10/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_9/tpu_batch_normalization_2/FusedBatchNormV3:0"
    output: "efficientnet-lite4/model/blocks_10/Add:0"
    name: "efficientnet-lite4/model/blocks_10/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_10/Add:0"
    input: "efficientnet-lite4/model/blocks_11/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_11/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_11/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_11/Relu6:0"
    name: "efficientnet-lite4/model/blocks_11/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/Relu6:0"
    input: "efficientnet-lite4/model/blocks_11/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_11/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_11/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 672
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_11/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_11/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_11/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_11/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_11/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_10/Add:0"
    output: "efficientnet-lite4/model/blocks_11/Add:0"
    name: "efficientnet-lite4/model/blocks_11/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_11/Add:0"
    input: "efficientnet-lite4/model/blocks_12/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_12/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_12/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_12/Relu6:0"
    name: "efficientnet-lite4/model/blocks_12/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/Relu6:0"
    input: "efficientnet-lite4/model/blocks_12/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_12/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_12/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 672
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_12/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_12/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_12/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_12/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization_2/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_12/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/tpu_batch_normalization_2/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_11/Add:0"
    output: "efficientnet-lite4/model/blocks_12/Add:0"
    name: "efficientnet-lite4/model/blocks_12/Add"
    op_type: "Add"
  }
  node {
    input: "efficientnet-lite4/model/blocks_12/Add:0"
    input: "efficientnet-lite4/model/blocks_13/conv2d/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_13/conv2d/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_13/tpu_batch_normalization/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_13/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_13/tpu_batch_normalization/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_13/Relu6:0"
    name: "efficientnet-lite4/model/blocks_13/Relu6"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_13/Relu6:0"
    input: "efficientnet-lite4/model/blocks_13/depthwise_conv2d/depthwise_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_13/depthwise_conv2d/depthwise_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_13/tpu_batch_normalization_1/FusedBatchNormV3:0"
    name: "efficientnet-lite4/model/blocks_13/depthwise_conv2d/depthwise"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "group"
      i: 672
      type: INT
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "efficientnet-lite4/model/blocks_13/tpu_batch_normalization_1/FusedBatchNormV3:0"
    input: "efficientnet-lite4/model/blocks_29/Relu6_1_min__569"
    input: "efficientnet-lite4/model/blocks_19/Relu6_1_max__380"
    output: "efficientnet-lite4/model/blocks_13/Relu6_1:0"
    name: "efficientnet-lite4/model/blocks_13/Relu6_1"
    op_type: "Clip"
  }
  node {
    input: "efficientnet-lite4/model/blocks_13/Relu6_1:0"
    input: "efficientnet-lite4/model/blocks_13/conv2d_1/Conv2D_weights_fused_bn"
    input: "efficientnet-lite4/model/blocks_13/conv2d_1/Conv2D_bias_fused_bn"
    output: "efficientnet-lite4/model/blocks_13/tpu_batch_normalization_2/FusedBatchNormV3:0"
