ir_version: 7
producer_name: "onnx.quantize"
producer_version: "0.1.0"
graph {
  node {
    input: "image"
    output: "1"
    name: "0"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1"
    input: "1_scale"
    input: "1_zero_point"
    output: "1_2_QuantizeLinear"
    name: "1_2_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "1_2_QuantizeLinear"
    input: "1_scale"
    input: "1_zero_point"
    input: "ConvMulFusion_W_2_quantized"
    input: "ConvMulFusion_W_2_scale"
    input: "ConvMulFusion_W_2_zero_point"
    input: "7_scale"
    input: "7_zero_point"
    input: "ConvAddFusion_Add_B_5_quantized"
    output: "7_quantized"
    name: "2_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "7_quantized"
    output: "9_QuantizeInput_quantized"
    name: "8_quant"
    op_type: "MaxPool"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "storage_order"
      i: 0
      type: INT
    }
  }
  node {
    input: "9_QuantizeInput_quantized"
    input: "7_scale"
    input: "7_zero_point"
    input: "ConvMulFusion_W_10_quantized"
    input: "ConvMulFusion_W_10_scale"
    input: "ConvMulFusion_W_10_zero_point"
    input: "15_scale"
    input: "15_zero_point"
    input: "ConvAddFusion_Add_B_13_quantized"
    output: "15_quantized"
    name: "10_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "9_QuantizeInput_quantized"
    input: "7_scale"
    input: "7_zero_point"
    input: "ConvMulFusion_W_30_quantized"
    input: "ConvMulFusion_W_30_scale"
    input: "ConvMulFusion_W_30_zero_point"
    input: "35_scale"
    input: "35_zero_point"
    input: "ConvAddFusion_Add_B_33_quantized"
    output: "35_quantized"
    name: "30_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "15_quantized"
    input: "15_scale"
    input: "15_zero_point"
    input: "ConvMulFusion_W_17_quantized"
    input: "ConvMulFusion_W_17_scale"
    input: "ConvMulFusion_W_17_zero_point"
    input: "22_scale"
    input: "22_zero_point"
    input: "ConvAddFusion_Add_B_20_quantized"
    output: "22_quantized"
    name: "17_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "22_quantized"
    input: "22_scale"
    input: "22_zero_point"
    input: "ConvMulFusion_W_24_quantized"
    input: "ConvMulFusion_W_24_scale"
    input: "ConvMulFusion_W_24_zero_point"
    input: "29_scale"
    input: "29_zero_point"
    input: "ConvAddFusion_Add_B_27_quantized"
    output: "29_quantized"
    name: "24_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "29_quantized"
    input: "29_scale"
    input: "29_zero_point"
    input: "35_quantized"
    input: "35_scale"
    input: "35_zero_point"
    input: "36_scale"
    input: "36_zero_point"
    output: "36_quantized"
    name: "35_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "36_quantized"
    input: "36_scale"
    input: "36_zero_point"
    input: "ConvMulFusion_W_38_quantized"
    input: "ConvMulFusion_W_38_scale"
    input: "ConvMulFusion_W_38_zero_point"
    input: "43_scale"
    input: "43_zero_point"
    input: "ConvAddFusion_Add_B_41_quantized"
    output: "43_quantized"
    name: "38_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "43_quantized"
    input: "43_scale"
    input: "43_zero_point"
    input: "ConvMulFusion_W_45_quantized"
    input: "ConvMulFusion_W_45_scale"
    input: "ConvMulFusion_W_45_zero_point"
    input: "50_scale"
    input: "50_zero_point"
    input: "ConvAddFusion_Add_B_48_quantized"
    output: "50_quantized"
    name: "45_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "50_quantized"
    input: "50_scale"
    input: "50_zero_point"
    input: "ConvMulFusion_W_52_quantized"
    input: "ConvMulFusion_W_52_scale"
    input: "ConvMulFusion_W_52_zero_point"
    input: "57_scale"
    input: "57_zero_point"
    input: "ConvAddFusion_Add_B_55_quantized"
    output: "57_quantized"
    name: "52_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "57_quantized"
    input: "57_scale"
    input: "57_zero_point"
    input: "36_quantized"
    input: "36_scale"
    input: "36_zero_point"
    input: "58_scale"
    input: "58_zero_point"
    output: "58_quantized"
    name: "57_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "58_quantized"
    input: "58_scale"
    input: "58_zero_point"
    input: "ConvMulFusion_W_60_quantized"
    input: "ConvMulFusion_W_60_scale"
    input: "ConvMulFusion_W_60_zero_point"
    input: "65_scale"
    input: "65_zero_point"
    input: "ConvAddFusion_Add_B_63_quantized"
    output: "65_quantized"
    name: "60_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "65_quantized"
    input: "65_scale"
    input: "65_zero_point"
    input: "ConvMulFusion_W_67_quantized"
    input: "ConvMulFusion_W_67_scale"
    input: "ConvMulFusion_W_67_zero_point"
    input: "72_scale"
    input: "72_zero_point"
    input: "ConvAddFusion_Add_B_70_quantized"
    output: "72_quantized"
    name: "67_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "72_quantized"
    input: "72_scale"
    input: "72_zero_point"
    input: "ConvMulFusion_W_74_quantized"
    input: "ConvMulFusion_W_74_scale"
    input: "ConvMulFusion_W_74_zero_point"
    input: "79_scale"
    input: "79_zero_point"
    input: "ConvAddFusion_Add_B_77_quantized"
    output: "79_quantized"
    name: "74_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "79_quantized"
    input: "79_scale"
    input: "79_zero_point"
    input: "58_quantized"
    input: "58_scale"
    input: "58_zero_point"
    input: "80_scale"
    input: "80_zero_point"
    output: "80_quantized"
    name: "79_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "80_quantized"
    input: "80_scale"
    input: "80_zero_point"
    input: "ConvMulFusion_W_82_quantized"
    input: "ConvMulFusion_W_82_scale"
    input: "ConvMulFusion_W_82_zero_point"
    input: "87_scale"
    input: "87_zero_point"
    input: "ConvAddFusion_Add_B_85_quantized"
    output: "87_quantized"
    name: "82_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "80_quantized"
    input: "80_scale"
    input: "80_zero_point"
    input: "ConvMulFusion_W_102_quantized"
    input: "ConvMulFusion_W_102_scale"
    input: "ConvMulFusion_W_102_zero_point"
    input: "107_scale"
    input: "107_zero_point"
    input: "ConvAddFusion_Add_B_105_quantized"
    output: "107_quantized"
    name: "102_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "80_quantized"
    input: "80_scale"
    input: "80_zero_point"
    input: "481_quantized"
    input: "481_scale"
    input: "481_zero_point"
    input: "483_scale"
    input: "483_zero_point"
    input: "482_quantized"
    output: "483_quantized"
    name: "482_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "87_quantized"
    input: "87_scale"
    input: "87_zero_point"
    input: "ConvMulFusion_W_89_quantized"
    input: "ConvMulFusion_W_89_scale"
    input: "ConvMulFusion_W_89_zero_point"
    input: "94_scale"
    input: "94_zero_point"
    input: "ConvAddFusion_Add_B_92_quantized"
    output: "94_quantized"
    name: "89_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "94_quantized"
    input: "94_scale"
    input: "94_zero_point"
    input: "ConvMulFusion_W_96_quantized"
    input: "ConvMulFusion_W_96_scale"
    input: "ConvMulFusion_W_96_zero_point"
    input: "101_scale"
    input: "101_zero_point"
    input: "ConvAddFusion_Add_B_99_quantized"
    output: "101_quantized"
    name: "96_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "101_quantized"
    input: "101_scale"
    input: "101_zero_point"
    input: "107_quantized"
    input: "107_scale"
    input: "107_zero_point"
    input: "108_scale"
    input: "108_zero_point"
    output: "108_quantized"
    name: "107_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "108_quantized"
    input: "108_scale"
    input: "108_zero_point"
    input: "ConvMulFusion_W_110_quantized"
    input: "ConvMulFusion_W_110_scale"
    input: "ConvMulFusion_W_110_zero_point"
    input: "115_scale"
    input: "115_zero_point"
    input: "ConvAddFusion_Add_B_113_quantized"
    output: "115_quantized"
    name: "110_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "115_quantized"
    input: "115_scale"
    input: "115_zero_point"
    input: "ConvMulFusion_W_117_quantized"
    input: "ConvMulFusion_W_117_scale"
    input: "ConvMulFusion_W_117_zero_point"
    input: "122_scale"
    input: "122_zero_point"
    input: "ConvAddFusion_Add_B_120_quantized"
    output: "122_quantized"
    name: "117_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "122_quantized"
    input: "122_scale"
    input: "122_zero_point"
    input: "ConvMulFusion_W_124_quantized"
    input: "ConvMulFusion_W_124_scale"
    input: "ConvMulFusion_W_124_zero_point"
    input: "129_scale"
    input: "129_zero_point"
    input: "ConvAddFusion_Add_B_127_quantized"
    output: "129_quantized"
    name: "124_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "129_quantized"
    input: "129_scale"
    input: "129_zero_point"
    input: "108_quantized"
    input: "108_scale"
    input: "108_zero_point"
    input: "130_scale"
    input: "130_zero_point"
    output: "130_quantized"
    name: "129_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "130_quantized"
    input: "130_scale"
    input: "130_zero_point"
    input: "ConvMulFusion_W_132_quantized"
    input: "ConvMulFusion_W_132_scale"
    input: "ConvMulFusion_W_132_zero_point"
    input: "137_scale"
    input: "137_zero_point"
    input: "ConvAddFusion_Add_B_135_quantized"
    output: "137_quantized"
    name: "132_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "137_quantized"
    input: "137_scale"
    input: "137_zero_point"
    input: "ConvMulFusion_W_139_quantized"
    input: "ConvMulFusion_W_139_scale"
    input: "ConvMulFusion_W_139_zero_point"
    input: "144_scale"
    input: "144_zero_point"
    input: "ConvAddFusion_Add_B_142_quantized"
    output: "144_quantized"
    name: "139_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "144_quantized"
    input: "144_scale"
    input: "144_zero_point"
    input: "ConvMulFusion_W_146_quantized"
    input: "ConvMulFusion_W_146_scale"
    input: "ConvMulFusion_W_146_zero_point"
    input: "151_scale"
    input: "151_zero_point"
    input: "ConvAddFusion_Add_B_149_quantized"
    output: "151_quantized"
    name: "146_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "151_quantized"
    input: "151_scale"
    input: "151_zero_point"
    input: "130_quantized"
    input: "130_scale"
    input: "130_zero_point"
    input: "152_scale"
    input: "152_zero_point"
    output: "152_quantized"
    name: "151_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "152_quantized"
    input: "152_scale"
    input: "152_zero_point"
    input: "ConvMulFusion_W_154_quantized"
    input: "ConvMulFusion_W_154_scale"
    input: "ConvMulFusion_W_154_zero_point"
    input: "159_scale"
    input: "159_zero_point"
    input: "ConvAddFusion_Add_B_157_quantized"
    output: "159_quantized"
    name: "154_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "159_quantized"
    input: "159_scale"
    input: "159_zero_point"
    input: "ConvMulFusion_W_161_quantized"
    input: "ConvMulFusion_W_161_scale"
    input: "ConvMulFusion_W_161_zero_point"
    input: "166_scale"
    input: "166_zero_point"
    input: "ConvAddFusion_Add_B_164_quantized"
    output: "166_quantized"
    name: "161_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "166_quantized"
    input: "166_scale"
    input: "166_zero_point"
    input: "ConvMulFusion_W_168_quantized"
    input: "ConvMulFusion_W_168_scale"
    input: "ConvMulFusion_W_168_zero_point"
    input: "173_scale"
    input: "173_zero_point"
    input: "ConvAddFusion_Add_B_171_quantized"
    output: "173_quantized"
    name: "168_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "173_quantized"
    input: "173_scale"
    input: "173_zero_point"
    input: "152_quantized"
    input: "152_scale"
    input: "152_zero_point"
    input: "174_scale"
    input: "174_zero_point"
    output: "174_quantized"
    name: "173_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "174_quantized"
    input: "174_scale"
    input: "174_zero_point"
    input: "ConvMulFusion_W_176_quantized"
    input: "ConvMulFusion_W_176_scale"
    input: "ConvMulFusion_W_176_zero_point"
    input: "181_scale"
    input: "181_zero_point"
    input: "ConvAddFusion_Add_B_179_quantized"
    output: "181_quantized"
    name: "176_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "174_quantized"
    input: "174_scale"
    input: "174_zero_point"
    input: "ConvMulFusion_W_196_quantized"
    input: "ConvMulFusion_W_196_scale"
    input: "ConvMulFusion_W_196_zero_point"
    input: "201_scale"
    input: "201_zero_point"
    input: "ConvAddFusion_Add_B_199_quantized"
    output: "201_quantized"
    name: "196_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "174_quantized"
    input: "174_scale"
    input: "174_zero_point"
    input: "449_quantized"
    input: "449_scale"
    input: "449_zero_point"
    input: "451_scale"
    input: "451_zero_point"
    input: "450_quantized"
    output: "451_quantized"
    name: "450_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "181_quantized"
    input: "181_scale"
    input: "181_zero_point"
    input: "ConvMulFusion_W_183_quantized"
    input: "ConvMulFusion_W_183_scale"
    input: "ConvMulFusion_W_183_zero_point"
    input: "188_scale"
    input: "188_zero_point"
    input: "ConvAddFusion_Add_B_186_quantized"
    output: "188_quantized"
    name: "183_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "188_quantized"
    input: "188_scale"
    input: "188_zero_point"
    input: "ConvMulFusion_W_190_quantized"
    input: "ConvMulFusion_W_190_scale"
    input: "ConvMulFusion_W_190_zero_point"
    input: "195_scale"
    input: "195_zero_point"
    input: "ConvAddFusion_Add_B_193_quantized"
    output: "195_quantized"
    name: "190_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "195_quantized"
    input: "195_scale"
    input: "195_zero_point"
    input: "201_quantized"
    input: "201_scale"
    input: "201_zero_point"
    input: "202_scale"
    input: "202_zero_point"
    output: "202_quantized"
    name: "201_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "202_quantized"
    input: "202_scale"
    input: "202_zero_point"
    input: "ConvMulFusion_W_204_quantized"
    input: "ConvMulFusion_W_204_scale"
    input: "ConvMulFusion_W_204_zero_point"
    input: "209_scale"
    input: "209_zero_point"
    input: "ConvAddFusion_Add_B_207_quantized"
    output: "209_quantized"
    name: "204_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "209_quantized"
    input: "209_scale"
    input: "209_zero_point"
    input: "ConvMulFusion_W_211_quantized"
    input: "ConvMulFusion_W_211_scale"
    input: "ConvMulFusion_W_211_zero_point"
    input: "216_scale"
    input: "216_zero_point"
    input: "ConvAddFusion_Add_B_214_quantized"
    output: "216_quantized"
    name: "211_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "216_quantized"
    input: "216_scale"
    input: "216_zero_point"
    input: "ConvMulFusion_W_218_quantized"
    input: "ConvMulFusion_W_218_scale"
    input: "ConvMulFusion_W_218_zero_point"
    input: "223_scale"
    input: "223_zero_point"
    input: "ConvAddFusion_Add_B_221_quantized"
    output: "223_quantized"
    name: "218_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "223_quantized"
    input: "223_scale"
    input: "223_zero_point"
    input: "202_quantized"
    input: "202_scale"
    input: "202_zero_point"
    input: "224_scale"
    input: "224_zero_point"
    output: "224_quantized"
    name: "223_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "224_quantized"
    input: "224_scale"
    input: "224_zero_point"
    input: "ConvMulFusion_W_226_quantized"
    input: "ConvMulFusion_W_226_scale"
    input: "ConvMulFusion_W_226_zero_point"
    input: "231_scale"
    input: "231_zero_point"
    input: "ConvAddFusion_Add_B_229_quantized"
    output: "231_quantized"
    name: "226_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "231_quantized"
    input: "231_scale"
    input: "231_zero_point"
    input: "ConvMulFusion_W_233_quantized"
    input: "ConvMulFusion_W_233_scale"
    input: "ConvMulFusion_W_233_zero_point"
    input: "238_scale"
    input: "238_zero_point"
    input: "ConvAddFusion_Add_B_236_quantized"
    output: "238_quantized"
    name: "233_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "238_quantized"
    input: "238_scale"
    input: "238_zero_point"
    input: "ConvMulFusion_W_240_quantized"
    input: "ConvMulFusion_W_240_scale"
    input: "ConvMulFusion_W_240_zero_point"
    input: "245_scale"
    input: "245_zero_point"
    input: "ConvAddFusion_Add_B_243_quantized"
    output: "245_quantized"
    name: "240_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "245_quantized"
    input: "245_scale"
    input: "245_zero_point"
    input: "224_quantized"
    input: "224_scale"
    input: "224_zero_point"
    input: "246_scale"
    input: "246_zero_point"
    output: "246_quantized"
    name: "245_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "246_quantized"
    input: "246_scale"
    input: "246_zero_point"
    input: "ConvMulFusion_W_248_quantized"
    input: "ConvMulFusion_W_248_scale"
    input: "ConvMulFusion_W_248_zero_point"
    input: "253_scale"
    input: "253_zero_point"
    input: "ConvAddFusion_Add_B_251_quantized"
    output: "253_quantized"
    name: "248_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "253_quantized"
    input: "253_scale"
    input: "253_zero_point"
    input: "ConvMulFusion_W_255_quantized"
    input: "ConvMulFusion_W_255_scale"
    input: "ConvMulFusion_W_255_zero_point"
    input: "260_scale"
    input: "260_zero_point"
    input: "ConvAddFusion_Add_B_258_quantized"
    output: "260_quantized"
    name: "255_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "260_quantized"
    input: "260_scale"
    input: "260_zero_point"
    input: "ConvMulFusion_W_262_quantized"
    input: "ConvMulFusion_W_262_scale"
    input: "ConvMulFusion_W_262_zero_point"
    input: "267_scale"
    input: "267_zero_point"
    input: "ConvAddFusion_Add_B_265_quantized"
    output: "267_quantized"
    name: "262_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "267_quantized"
    input: "267_scale"
    input: "267_zero_point"
    input: "246_quantized"
    input: "246_scale"
    input: "246_zero_point"
    input: "268_scale"
    input: "268_zero_point"
    output: "268_quantized"
    name: "267_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "268_quantized"
    input: "268_scale"
    input: "268_zero_point"
    input: "ConvMulFusion_W_270_quantized"
    input: "ConvMulFusion_W_270_scale"
    input: "ConvMulFusion_W_270_zero_point"
    input: "275_scale"
    input: "275_zero_point"
    input: "ConvAddFusion_Add_B_273_quantized"
    output: "275_quantized"
    name: "270_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "275_quantized"
    input: "275_scale"
    input: "275_zero_point"
    input: "ConvMulFusion_W_277_quantized"
    input: "ConvMulFusion_W_277_scale"
    input: "ConvMulFusion_W_277_zero_point"
    input: "282_scale"
    input: "282_zero_point"
    input: "ConvAddFusion_Add_B_280_quantized"
    output: "282_quantized"
    name: "277_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "282_quantized"
    input: "282_scale"
    input: "282_zero_point"
    input: "ConvMulFusion_W_284_quantized"
    input: "ConvMulFusion_W_284_scale"
    input: "ConvMulFusion_W_284_zero_point"
    input: "289_scale"
    input: "289_zero_point"
    input: "ConvAddFusion_Add_B_287_quantized"
    output: "289_quantized"
    name: "284_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "289_quantized"
    input: "289_scale"
    input: "289_zero_point"
    input: "268_quantized"
    input: "268_scale"
    input: "268_zero_point"
    input: "290_scale"
    input: "290_zero_point"
    output: "290_quantized"
    name: "289_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "290_quantized"
    input: "290_scale"
    input: "290_zero_point"
    input: "ConvMulFusion_W_292_quantized"
    input: "ConvMulFusion_W_292_scale"
    input: "ConvMulFusion_W_292_zero_point"
    input: "297_scale"
    input: "297_zero_point"
    input: "ConvAddFusion_Add_B_295_quantized"
    output: "297_quantized"
    name: "292_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "297_quantized"
    input: "297_scale"
    input: "297_zero_point"
    input: "ConvMulFusion_W_299_quantized"
    input: "ConvMulFusion_W_299_scale"
    input: "ConvMulFusion_W_299_zero_point"
    input: "304_scale"
    input: "304_zero_point"
    input: "ConvAddFusion_Add_B_302_quantized"
    output: "304_quantized"
    name: "299_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "304_quantized"
    input: "304_scale"
    input: "304_zero_point"
    input: "ConvMulFusion_W_306_quantized"
    input: "ConvMulFusion_W_306_scale"
    input: "ConvMulFusion_W_306_zero_point"
    input: "311_scale"
    input: "311_zero_point"
    input: "ConvAddFusion_Add_B_309_quantized"
    output: "311_quantized"
    name: "306_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "311_quantized"
    input: "311_scale"
    input: "311_zero_point"
    input: "290_quantized"
    input: "290_scale"
    input: "290_zero_point"
    input: "312_scale"
    input: "312_zero_point"
    output: "312_quantized"
    name: "311_quant"
    op_type: "QLinearAdd"
    domain: "com.microsoft"
  }
  node {
    input: "312_quantized"
    input: "312_scale"
    input: "312_zero_point"
    input: "ConvMulFusion_W_314_quantized"
    input: "ConvMulFusion_W_314_scale"
    input: "ConvMulFusion_W_314_zero_point"
    input: "319_scale"
    input: "319_zero_point"
    input: "ConvAddFusion_Add_B_317_quantized"
    output: "319_quantized"
    name: "314_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "312_quantized"
    input: "312_scale"
    input: "312_zero_point"
    input: "ConvMulFusion_W_334_quantized"
    input: "ConvMulFusion_W_334_scale"
    input: "ConvMulFusion_W_334_zero_point"
    input: "339_scale"
    input: "339_zero_point"
    input: "ConvAddFusion_Add_B_337_quantized"
    output: "339_quantized"
    name: "334_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "312_quantized"
    input: "312_scale"
    input: "312_zero_point"
    input: "417_quantized"
    input: "417_scale"
    input: "417_zero_point"
    input: "419_scale"
    input: "419_zero_point"
    input: "418_quantized"
    output: "419_quantized"
    name: "418_quant"
    op_type: "QLinearConv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "319_quantized"
    input: "319_scale"
    input: "319_zero_point"
    input: "ConvMulFusion_W_321_quantized"
    input: "ConvMulFusion_W_321_scale"
    input: "ConvMulFusion_W_321_zero_point"
    input: "326_scale"
    input: "326_zero_point"
    input: "ConvAddFusion_Add_B_324_quantized"
    output: "326_quantized"
    name: "321_quant"
    op_type: "QLinearConv"
    attribute {
