ir_version: 3
producer_name: "onnx-caffe2"
graph {
  node {
    input: "gpu_0/data_0"
    input: "gpu_0/conv1_w_0"
    output: "gpu_0/conv1_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gpu_0/conv1_1"
    input: "gpu_0/res_conv1_bn_s_0"
    input: "gpu_0/res_conv1_bn_b_0"
    input: "gpu_0/res_conv1_bn_rm_0"
    input: "gpu_0/res_conv1_bn_riv_0"
    output: "gpu_0/res_conv1_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res_conv1_bn_1"
    output: "gpu_0/res_conv1_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res_conv1_bn_2"
    output: "gpu_0/pool1_1"
    op_type: "MaxPool"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gpu_0/pool1_1"
    input: "gpu_0/res2_0_branch2a_w_0"
    output: "gpu_0/res2_0_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_0_branch2a_1"
    input: "gpu_0/res2_0_branch2a_bn_s_0"
    input: "gpu_0/res2_0_branch2a_bn_b_0"
    input: "gpu_0/res2_0_branch2a_bn_rm_0"
    input: "gpu_0/res2_0_branch2a_bn_riv_0"
    output: "gpu_0/res2_0_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_0_branch2a_bn_1"
    output: "gpu_0/res2_0_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_0_branch2a_bn_2"
    input: "gpu_0/res2_0_branch2b_w_0"
    output: "gpu_0/res2_0_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_0_branch2b_1"
    input: "gpu_0/res2_0_branch2b_bn_s_0"
    input: "gpu_0/res2_0_branch2b_bn_b_0"
    input: "gpu_0/res2_0_branch2b_bn_rm_0"
    input: "gpu_0/res2_0_branch2b_bn_riv_0"
    output: "gpu_0/res2_0_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_0_branch2b_bn_1"
    output: "gpu_0/res2_0_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_0_branch2b_bn_2"
    input: "gpu_0/res2_0_branch2c_w_0"
    output: "gpu_0/res2_0_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_0_branch2c_1"
    input: "gpu_0/res2_0_branch2c_bn_s_0"
    input: "gpu_0/res2_0_branch2c_bn_b_0"
    input: "gpu_0/res2_0_branch2c_bn_rm_0"
    input: "gpu_0/res2_0_branch2c_bn_riv_0"
    output: "gpu_0/res2_0_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/pool1_1"
    input: "gpu_0/res2_0_branch1_w_0"
    output: "gpu_0/res2_0_branch1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_0_branch1_1"
    input: "gpu_0/res2_0_branch1_bn_s_0"
    input: "gpu_0/res2_0_branch1_bn_b_0"
    input: "gpu_0/res2_0_branch1_bn_rm_0"
    input: "gpu_0/res2_0_branch1_bn_riv_0"
    output: "gpu_0/res2_0_branch1_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_0_branch2c_bn_1"
    input: "gpu_0/res2_0_branch1_bn_1"
    output: "gpu_0/res2_0_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res2_0_branch2c_bn_2"
    output: "gpu_0/res2_0_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_0_branch2c_bn_3"
    input: "gpu_0/res2_1_branch2a_w_0"
    output: "gpu_0/res2_1_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_1_branch2a_1"
    input: "gpu_0/res2_1_branch2a_bn_s_0"
    input: "gpu_0/res2_1_branch2a_bn_b_0"
    input: "gpu_0/res2_1_branch2a_bn_rm_0"
    input: "gpu_0/res2_1_branch2a_bn_riv_0"
    output: "gpu_0/res2_1_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_1_branch2a_bn_1"
    output: "gpu_0/res2_1_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_1_branch2a_bn_2"
    input: "gpu_0/res2_1_branch2b_w_0"
    output: "gpu_0/res2_1_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_1_branch2b_1"
    input: "gpu_0/res2_1_branch2b_bn_s_0"
    input: "gpu_0/res2_1_branch2b_bn_b_0"
    input: "gpu_0/res2_1_branch2b_bn_rm_0"
    input: "gpu_0/res2_1_branch2b_bn_riv_0"
    output: "gpu_0/res2_1_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_1_branch2b_bn_1"
    output: "gpu_0/res2_1_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_1_branch2b_bn_2"
    input: "gpu_0/res2_1_branch2c_w_0"
    output: "gpu_0/res2_1_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_1_branch2c_1"
    input: "gpu_0/res2_1_branch2c_bn_s_0"
    input: "gpu_0/res2_1_branch2c_bn_b_0"
    input: "gpu_0/res2_1_branch2c_bn_rm_0"
    input: "gpu_0/res2_1_branch2c_bn_riv_0"
    output: "gpu_0/res2_1_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_1_branch2c_bn_1"
    input: "gpu_0/res2_0_branch2c_bn_3"
    output: "gpu_0/res2_1_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res2_1_branch2c_bn_2"
    output: "gpu_0/res2_1_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_1_branch2c_bn_3"
    input: "gpu_0/res2_2_branch2a_w_0"
    output: "gpu_0/res2_2_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_2_branch2a_1"
    input: "gpu_0/res2_2_branch2a_bn_s_0"
    input: "gpu_0/res2_2_branch2a_bn_b_0"
    input: "gpu_0/res2_2_branch2a_bn_rm_0"
    input: "gpu_0/res2_2_branch2a_bn_riv_0"
    output: "gpu_0/res2_2_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_2_branch2a_bn_1"
    output: "gpu_0/res2_2_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_2_branch2a_bn_2"
    input: "gpu_0/res2_2_branch2b_w_0"
    output: "gpu_0/res2_2_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_2_branch2b_1"
    input: "gpu_0/res2_2_branch2b_bn_s_0"
    input: "gpu_0/res2_2_branch2b_bn_b_0"
    input: "gpu_0/res2_2_branch2b_bn_rm_0"
    input: "gpu_0/res2_2_branch2b_bn_riv_0"
    output: "gpu_0/res2_2_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_2_branch2b_bn_1"
    output: "gpu_0/res2_2_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_2_branch2b_bn_2"
    input: "gpu_0/res2_2_branch2c_w_0"
    output: "gpu_0/res2_2_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res2_2_branch2c_1"
    input: "gpu_0/res2_2_branch2c_bn_s_0"
    input: "gpu_0/res2_2_branch2c_bn_b_0"
    input: "gpu_0/res2_2_branch2c_bn_rm_0"
    input: "gpu_0/res2_2_branch2c_bn_riv_0"
    output: "gpu_0/res2_2_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_2_branch2c_bn_1"
    input: "gpu_0/res2_1_branch2c_bn_3"
    output: "gpu_0/res2_2_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res2_2_branch2c_bn_2"
    output: "gpu_0/res2_2_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res2_2_branch2c_bn_3"
    input: "gpu_0/res3_0_branch2a_w_0"
    output: "gpu_0/res3_0_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_0_branch2a_1"
    input: "gpu_0/res3_0_branch2a_bn_s_0"
    input: "gpu_0/res3_0_branch2a_bn_b_0"
    input: "gpu_0/res3_0_branch2a_bn_rm_0"
    input: "gpu_0/res3_0_branch2a_bn_riv_0"
    output: "gpu_0/res3_0_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_0_branch2a_bn_1"
    output: "gpu_0/res3_0_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_0_branch2a_bn_2"
    input: "gpu_0/res3_0_branch2b_w_0"
    output: "gpu_0/res3_0_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_0_branch2b_1"
    input: "gpu_0/res3_0_branch2b_bn_s_0"
    input: "gpu_0/res3_0_branch2b_bn_b_0"
    input: "gpu_0/res3_0_branch2b_bn_rm_0"
    input: "gpu_0/res3_0_branch2b_bn_riv_0"
    output: "gpu_0/res3_0_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_0_branch2b_bn_1"
    output: "gpu_0/res3_0_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_0_branch2b_bn_2"
    input: "gpu_0/res3_0_branch2c_w_0"
    output: "gpu_0/res3_0_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_0_branch2c_1"
    input: "gpu_0/res3_0_branch2c_bn_s_0"
    input: "gpu_0/res3_0_branch2c_bn_b_0"
    input: "gpu_0/res3_0_branch2c_bn_rm_0"
    input: "gpu_0/res3_0_branch2c_bn_riv_0"
    output: "gpu_0/res3_0_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res2_2_branch2c_bn_3"
    input: "gpu_0/res3_0_branch1_w_0"
    output: "gpu_0/res3_0_branch1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_0_branch1_1"
    input: "gpu_0/res3_0_branch1_bn_s_0"
    input: "gpu_0/res3_0_branch1_bn_b_0"
    input: "gpu_0/res3_0_branch1_bn_rm_0"
    input: "gpu_0/res3_0_branch1_bn_riv_0"
    output: "gpu_0/res3_0_branch1_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_0_branch2c_bn_1"
    input: "gpu_0/res3_0_branch1_bn_1"
    output: "gpu_0/res3_0_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res3_0_branch2c_bn_2"
    output: "gpu_0/res3_0_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_0_branch2c_bn_3"
    input: "gpu_0/res3_1_branch2a_w_0"
    output: "gpu_0/res3_1_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_1_branch2a_1"
    input: "gpu_0/res3_1_branch2a_bn_s_0"
    input: "gpu_0/res3_1_branch2a_bn_b_0"
    input: "gpu_0/res3_1_branch2a_bn_rm_0"
    input: "gpu_0/res3_1_branch2a_bn_riv_0"
    output: "gpu_0/res3_1_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_1_branch2a_bn_1"
    output: "gpu_0/res3_1_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_1_branch2a_bn_2"
    input: "gpu_0/res3_1_branch2b_w_0"
    output: "gpu_0/res3_1_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_1_branch2b_1"
    input: "gpu_0/res3_1_branch2b_bn_s_0"
    input: "gpu_0/res3_1_branch2b_bn_b_0"
    input: "gpu_0/res3_1_branch2b_bn_rm_0"
    input: "gpu_0/res3_1_branch2b_bn_riv_0"
    output: "gpu_0/res3_1_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_1_branch2b_bn_1"
    output: "gpu_0/res3_1_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_1_branch2b_bn_2"
    input: "gpu_0/res3_1_branch2c_w_0"
    output: "gpu_0/res3_1_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_1_branch2c_1"
    input: "gpu_0/res3_1_branch2c_bn_s_0"
    input: "gpu_0/res3_1_branch2c_bn_b_0"
    input: "gpu_0/res3_1_branch2c_bn_rm_0"
    input: "gpu_0/res3_1_branch2c_bn_riv_0"
    output: "gpu_0/res3_1_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_1_branch2c_bn_1"
    input: "gpu_0/res3_0_branch2c_bn_3"
    output: "gpu_0/res3_1_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res3_1_branch2c_bn_2"
    output: "gpu_0/res3_1_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_1_branch2c_bn_3"
    input: "gpu_0/res3_2_branch2a_w_0"
    output: "gpu_0/res3_2_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_2_branch2a_1"
    input: "gpu_0/res3_2_branch2a_bn_s_0"
    input: "gpu_0/res3_2_branch2a_bn_b_0"
    input: "gpu_0/res3_2_branch2a_bn_rm_0"
    input: "gpu_0/res3_2_branch2a_bn_riv_0"
    output: "gpu_0/res3_2_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_2_branch2a_bn_1"
    output: "gpu_0/res3_2_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_2_branch2a_bn_2"
    input: "gpu_0/res3_2_branch2b_w_0"
    output: "gpu_0/res3_2_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_2_branch2b_1"
    input: "gpu_0/res3_2_branch2b_bn_s_0"
    input: "gpu_0/res3_2_branch2b_bn_b_0"
    input: "gpu_0/res3_2_branch2b_bn_rm_0"
    input: "gpu_0/res3_2_branch2b_bn_riv_0"
    output: "gpu_0/res3_2_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_2_branch2b_bn_1"
    output: "gpu_0/res3_2_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_2_branch2b_bn_2"
    input: "gpu_0/res3_2_branch2c_w_0"
    output: "gpu_0/res3_2_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_2_branch2c_1"
    input: "gpu_0/res3_2_branch2c_bn_s_0"
    input: "gpu_0/res3_2_branch2c_bn_b_0"
    input: "gpu_0/res3_2_branch2c_bn_rm_0"
    input: "gpu_0/res3_2_branch2c_bn_riv_0"
    output: "gpu_0/res3_2_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_2_branch2c_bn_1"
    input: "gpu_0/res3_1_branch2c_bn_3"
    output: "gpu_0/res3_2_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res3_2_branch2c_bn_2"
    output: "gpu_0/res3_2_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_2_branch2c_bn_3"
    input: "gpu_0/res3_3_branch2a_w_0"
    output: "gpu_0/res3_3_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_3_branch2a_1"
    input: "gpu_0/res3_3_branch2a_bn_s_0"
    input: "gpu_0/res3_3_branch2a_bn_b_0"
    input: "gpu_0/res3_3_branch2a_bn_rm_0"
    input: "gpu_0/res3_3_branch2a_bn_riv_0"
    output: "gpu_0/res3_3_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_3_branch2a_bn_1"
    output: "gpu_0/res3_3_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_3_branch2a_bn_2"
    input: "gpu_0/res3_3_branch2b_w_0"
    output: "gpu_0/res3_3_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_3_branch2b_1"
    input: "gpu_0/res3_3_branch2b_bn_s_0"
    input: "gpu_0/res3_3_branch2b_bn_b_0"
    input: "gpu_0/res3_3_branch2b_bn_rm_0"
    input: "gpu_0/res3_3_branch2b_bn_riv_0"
    output: "gpu_0/res3_3_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_3_branch2b_bn_1"
    output: "gpu_0/res3_3_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_3_branch2b_bn_2"
    input: "gpu_0/res3_3_branch2c_w_0"
    output: "gpu_0/res3_3_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res3_3_branch2c_1"
    input: "gpu_0/res3_3_branch2c_bn_s_0"
    input: "gpu_0/res3_3_branch2c_bn_b_0"
    input: "gpu_0/res3_3_branch2c_bn_rm_0"
    input: "gpu_0/res3_3_branch2c_bn_riv_0"
    output: "gpu_0/res3_3_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_3_branch2c_bn_1"
    input: "gpu_0/res3_2_branch2c_bn_3"
    output: "gpu_0/res3_3_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res3_3_branch2c_bn_2"
    output: "gpu_0/res3_3_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res3_3_branch2c_bn_3"
    input: "gpu_0/res4_0_branch2a_w_0"
    output: "gpu_0/res4_0_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_0_branch2a_1"
    input: "gpu_0/res4_0_branch2a_bn_s_0"
    input: "gpu_0/res4_0_branch2a_bn_b_0"
    input: "gpu_0/res4_0_branch2a_bn_rm_0"
    input: "gpu_0/res4_0_branch2a_bn_riv_0"
    output: "gpu_0/res4_0_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_0_branch2a_bn_1"
    output: "gpu_0/res4_0_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_0_branch2a_bn_2"
    input: "gpu_0/res4_0_branch2b_w_0"
    output: "gpu_0/res4_0_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_0_branch2b_1"
    input: "gpu_0/res4_0_branch2b_bn_s_0"
    input: "gpu_0/res4_0_branch2b_bn_b_0"
    input: "gpu_0/res4_0_branch2b_bn_rm_0"
    input: "gpu_0/res4_0_branch2b_bn_riv_0"
    output: "gpu_0/res4_0_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_0_branch2b_bn_1"
    output: "gpu_0/res4_0_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_0_branch2b_bn_2"
    input: "gpu_0/res4_0_branch2c_w_0"
    output: "gpu_0/res4_0_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_0_branch2c_1"
    input: "gpu_0/res4_0_branch2c_bn_s_0"
    input: "gpu_0/res4_0_branch2c_bn_b_0"
    input: "gpu_0/res4_0_branch2c_bn_rm_0"
    input: "gpu_0/res4_0_branch2c_bn_riv_0"
    output: "gpu_0/res4_0_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res3_3_branch2c_bn_3"
    input: "gpu_0/res4_0_branch1_w_0"
    output: "gpu_0/res4_0_branch1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_0_branch1_1"
    input: "gpu_0/res4_0_branch1_bn_s_0"
    input: "gpu_0/res4_0_branch1_bn_b_0"
    input: "gpu_0/res4_0_branch1_bn_rm_0"
    input: "gpu_0/res4_0_branch1_bn_riv_0"
    output: "gpu_0/res4_0_branch1_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_0_branch2c_bn_1"
    input: "gpu_0/res4_0_branch1_bn_1"
    output: "gpu_0/res4_0_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_0_branch2c_bn_2"
    output: "gpu_0/res4_0_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_0_branch2c_bn_3"
    input: "gpu_0/res4_1_branch2a_w_0"
    output: "gpu_0/res4_1_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_1_branch2a_1"
    input: "gpu_0/res4_1_branch2a_bn_s_0"
    input: "gpu_0/res4_1_branch2a_bn_b_0"
    input: "gpu_0/res4_1_branch2a_bn_rm_0"
    input: "gpu_0/res4_1_branch2a_bn_riv_0"
    output: "gpu_0/res4_1_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_1_branch2a_bn_1"
    output: "gpu_0/res4_1_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_1_branch2a_bn_2"
    input: "gpu_0/res4_1_branch2b_w_0"
    output: "gpu_0/res4_1_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_1_branch2b_1"
    input: "gpu_0/res4_1_branch2b_bn_s_0"
    input: "gpu_0/res4_1_branch2b_bn_b_0"
    input: "gpu_0/res4_1_branch2b_bn_rm_0"
    input: "gpu_0/res4_1_branch2b_bn_riv_0"
    output: "gpu_0/res4_1_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_1_branch2b_bn_1"
    output: "gpu_0/res4_1_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_1_branch2b_bn_2"
    input: "gpu_0/res4_1_branch2c_w_0"
    output: "gpu_0/res4_1_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_1_branch2c_1"
    input: "gpu_0/res4_1_branch2c_bn_s_0"
    input: "gpu_0/res4_1_branch2c_bn_b_0"
    input: "gpu_0/res4_1_branch2c_bn_rm_0"
    input: "gpu_0/res4_1_branch2c_bn_riv_0"
    output: "gpu_0/res4_1_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_1_branch2c_bn_1"
    input: "gpu_0/res4_0_branch2c_bn_3"
    output: "gpu_0/res4_1_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_1_branch2c_bn_2"
    output: "gpu_0/res4_1_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_1_branch2c_bn_3"
    input: "gpu_0/res4_2_branch2a_w_0"
    output: "gpu_0/res4_2_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_2_branch2a_1"
    input: "gpu_0/res4_2_branch2a_bn_s_0"
    input: "gpu_0/res4_2_branch2a_bn_b_0"
    input: "gpu_0/res4_2_branch2a_bn_rm_0"
    input: "gpu_0/res4_2_branch2a_bn_riv_0"
    output: "gpu_0/res4_2_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_2_branch2a_bn_1"
    output: "gpu_0/res4_2_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_2_branch2a_bn_2"
    input: "gpu_0/res4_2_branch2b_w_0"
    output: "gpu_0/res4_2_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_2_branch2b_1"
    input: "gpu_0/res4_2_branch2b_bn_s_0"
    input: "gpu_0/res4_2_branch2b_bn_b_0"
    input: "gpu_0/res4_2_branch2b_bn_rm_0"
    input: "gpu_0/res4_2_branch2b_bn_riv_0"
    output: "gpu_0/res4_2_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_2_branch2b_bn_1"
    output: "gpu_0/res4_2_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_2_branch2b_bn_2"
    input: "gpu_0/res4_2_branch2c_w_0"
    output: "gpu_0/res4_2_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_2_branch2c_1"
    input: "gpu_0/res4_2_branch2c_bn_s_0"
    input: "gpu_0/res4_2_branch2c_bn_b_0"
    input: "gpu_0/res4_2_branch2c_bn_rm_0"
    input: "gpu_0/res4_2_branch2c_bn_riv_0"
    output: "gpu_0/res4_2_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_2_branch2c_bn_1"
    input: "gpu_0/res4_1_branch2c_bn_3"
    output: "gpu_0/res4_2_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_2_branch2c_bn_2"
    output: "gpu_0/res4_2_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_2_branch2c_bn_3"
    input: "gpu_0/res4_3_branch2a_w_0"
    output: "gpu_0/res4_3_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_3_branch2a_1"
    input: "gpu_0/res4_3_branch2a_bn_s_0"
    input: "gpu_0/res4_3_branch2a_bn_b_0"
    input: "gpu_0/res4_3_branch2a_bn_rm_0"
    input: "gpu_0/res4_3_branch2a_bn_riv_0"
    output: "gpu_0/res4_3_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_3_branch2a_bn_1"
    output: "gpu_0/res4_3_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_3_branch2a_bn_2"
    input: "gpu_0/res4_3_branch2b_w_0"
    output: "gpu_0/res4_3_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_3_branch2b_1"
    input: "gpu_0/res4_3_branch2b_bn_s_0"
    input: "gpu_0/res4_3_branch2b_bn_b_0"
    input: "gpu_0/res4_3_branch2b_bn_rm_0"
    input: "gpu_0/res4_3_branch2b_bn_riv_0"
    output: "gpu_0/res4_3_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_3_branch2b_bn_1"
    output: "gpu_0/res4_3_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_3_branch2b_bn_2"
    input: "gpu_0/res4_3_branch2c_w_0"
    output: "gpu_0/res4_3_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_3_branch2c_1"
    input: "gpu_0/res4_3_branch2c_bn_s_0"
    input: "gpu_0/res4_3_branch2c_bn_b_0"
    input: "gpu_0/res4_3_branch2c_bn_rm_0"
    input: "gpu_0/res4_3_branch2c_bn_riv_0"
    output: "gpu_0/res4_3_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_3_branch2c_bn_1"
    input: "gpu_0/res4_2_branch2c_bn_3"
    output: "gpu_0/res4_3_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_3_branch2c_bn_2"
    output: "gpu_0/res4_3_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_3_branch2c_bn_3"
    input: "gpu_0/res4_4_branch2a_w_0"
    output: "gpu_0/res4_4_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_4_branch2a_1"
    input: "gpu_0/res4_4_branch2a_bn_s_0"
    input: "gpu_0/res4_4_branch2a_bn_b_0"
    input: "gpu_0/res4_4_branch2a_bn_rm_0"
    input: "gpu_0/res4_4_branch2a_bn_riv_0"
    output: "gpu_0/res4_4_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_4_branch2a_bn_1"
    output: "gpu_0/res4_4_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_4_branch2a_bn_2"
    input: "gpu_0/res4_4_branch2b_w_0"
    output: "gpu_0/res4_4_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_4_branch2b_1"
    input: "gpu_0/res4_4_branch2b_bn_s_0"
    input: "gpu_0/res4_4_branch2b_bn_b_0"
    input: "gpu_0/res4_4_branch2b_bn_rm_0"
    input: "gpu_0/res4_4_branch2b_bn_riv_0"
    output: "gpu_0/res4_4_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_4_branch2b_bn_1"
    output: "gpu_0/res4_4_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_4_branch2b_bn_2"
    input: "gpu_0/res4_4_branch2c_w_0"
    output: "gpu_0/res4_4_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_4_branch2c_1"
    input: "gpu_0/res4_4_branch2c_bn_s_0"
    input: "gpu_0/res4_4_branch2c_bn_b_0"
    input: "gpu_0/res4_4_branch2c_bn_rm_0"
    input: "gpu_0/res4_4_branch2c_bn_riv_0"
    output: "gpu_0/res4_4_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_4_branch2c_bn_1"
    input: "gpu_0/res4_3_branch2c_bn_3"
    output: "gpu_0/res4_4_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_4_branch2c_bn_2"
    output: "gpu_0/res4_4_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_4_branch2c_bn_3"
    input: "gpu_0/res4_5_branch2a_w_0"
    output: "gpu_0/res4_5_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_5_branch2a_1"
    input: "gpu_0/res4_5_branch2a_bn_s_0"
    input: "gpu_0/res4_5_branch2a_bn_b_0"
    input: "gpu_0/res4_5_branch2a_bn_rm_0"
    input: "gpu_0/res4_5_branch2a_bn_riv_0"
    output: "gpu_0/res4_5_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_5_branch2a_bn_1"
    output: "gpu_0/res4_5_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_5_branch2a_bn_2"
    input: "gpu_0/res4_5_branch2b_w_0"
    output: "gpu_0/res4_5_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_5_branch2b_1"
    input: "gpu_0/res4_5_branch2b_bn_s_0"
    input: "gpu_0/res4_5_branch2b_bn_b_0"
    input: "gpu_0/res4_5_branch2b_bn_rm_0"
    input: "gpu_0/res4_5_branch2b_bn_riv_0"
    output: "gpu_0/res4_5_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_5_branch2b_bn_1"
    output: "gpu_0/res4_5_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_5_branch2b_bn_2"
    input: "gpu_0/res4_5_branch2c_w_0"
    output: "gpu_0/res4_5_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res4_5_branch2c_1"
    input: "gpu_0/res4_5_branch2c_bn_s_0"
    input: "gpu_0/res4_5_branch2c_bn_b_0"
    input: "gpu_0/res4_5_branch2c_bn_rm_0"
    input: "gpu_0/res4_5_branch2c_bn_riv_0"
    output: "gpu_0/res4_5_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_5_branch2c_bn_1"
    input: "gpu_0/res4_4_branch2c_bn_3"
    output: "gpu_0/res4_5_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res4_5_branch2c_bn_2"
    output: "gpu_0/res4_5_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res4_5_branch2c_bn_3"
    input: "gpu_0/res5_0_branch2a_w_0"
    output: "gpu_0/res5_0_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_0_branch2a_1"
    input: "gpu_0/res5_0_branch2a_bn_s_0"
    input: "gpu_0/res5_0_branch2a_bn_b_0"
    input: "gpu_0/res5_0_branch2a_bn_rm_0"
    input: "gpu_0/res5_0_branch2a_bn_riv_0"
    output: "gpu_0/res5_0_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_0_branch2a_bn_1"
    output: "gpu_0/res5_0_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_0_branch2a_bn_2"
    input: "gpu_0/res5_0_branch2b_w_0"
    output: "gpu_0/res5_0_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_0_branch2b_1"
    input: "gpu_0/res5_0_branch2b_bn_s_0"
    input: "gpu_0/res5_0_branch2b_bn_b_0"
    input: "gpu_0/res5_0_branch2b_bn_rm_0"
    input: "gpu_0/res5_0_branch2b_bn_riv_0"
    output: "gpu_0/res5_0_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_0_branch2b_bn_1"
    output: "gpu_0/res5_0_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_0_branch2b_bn_2"
    input: "gpu_0/res5_0_branch2c_w_0"
    output: "gpu_0/res5_0_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_0_branch2c_1"
    input: "gpu_0/res5_0_branch2c_bn_s_0"
    input: "gpu_0/res5_0_branch2c_bn_b_0"
    input: "gpu_0/res5_0_branch2c_bn_rm_0"
    input: "gpu_0/res5_0_branch2c_bn_riv_0"
    output: "gpu_0/res5_0_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res4_5_branch2c_bn_3"
    input: "gpu_0/res5_0_branch1_w_0"
    output: "gpu_0/res5_0_branch1_1"
    op_type: "Conv"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_0_branch1_1"
    input: "gpu_0/res5_0_branch1_bn_s_0"
    input: "gpu_0/res5_0_branch1_bn_b_0"
    input: "gpu_0/res5_0_branch1_bn_rm_0"
    input: "gpu_0/res5_0_branch1_bn_riv_0"
    output: "gpu_0/res5_0_branch1_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_0_branch2c_bn_1"
    input: "gpu_0/res5_0_branch1_bn_1"
    output: "gpu_0/res5_0_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res5_0_branch2c_bn_2"
    output: "gpu_0/res5_0_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_0_branch2c_bn_3"
    input: "gpu_0/res5_1_branch2a_w_0"
    output: "gpu_0/res5_1_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_1_branch2a_1"
    input: "gpu_0/res5_1_branch2a_bn_s_0"
    input: "gpu_0/res5_1_branch2a_bn_b_0"
    input: "gpu_0/res5_1_branch2a_bn_rm_0"
    input: "gpu_0/res5_1_branch2a_bn_riv_0"
    output: "gpu_0/res5_1_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_1_branch2a_bn_1"
    output: "gpu_0/res5_1_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_1_branch2a_bn_2"
    input: "gpu_0/res5_1_branch2b_w_0"
    output: "gpu_0/res5_1_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_1_branch2b_1"
    input: "gpu_0/res5_1_branch2b_bn_s_0"
    input: "gpu_0/res5_1_branch2b_bn_b_0"
    input: "gpu_0/res5_1_branch2b_bn_rm_0"
    input: "gpu_0/res5_1_branch2b_bn_riv_0"
    output: "gpu_0/res5_1_branch2b_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_1_branch2b_bn_1"
    output: "gpu_0/res5_1_branch2b_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_1_branch2b_bn_2"
    input: "gpu_0/res5_1_branch2c_w_0"
    output: "gpu_0/res5_1_branch2c_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_1_branch2c_1"
    input: "gpu_0/res5_1_branch2c_bn_s_0"
    input: "gpu_0/res5_1_branch2c_bn_b_0"
    input: "gpu_0/res5_1_branch2c_bn_rm_0"
    input: "gpu_0/res5_1_branch2c_bn_riv_0"
    output: "gpu_0/res5_1_branch2c_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_1_branch2c_bn_1"
    input: "gpu_0/res5_0_branch2c_bn_3"
    output: "gpu_0/res5_1_branch2c_bn_2"
    op_type: "Sum"
  }
  node {
    input: "gpu_0/res5_1_branch2c_bn_2"
    output: "gpu_0/res5_1_branch2c_bn_3"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_1_branch2c_bn_3"
    input: "gpu_0/res5_2_branch2a_w_0"
    output: "gpu_0/res5_2_branch2a_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "gpu_0/res5_2_branch2a_1"
    input: "gpu_0/res5_2_branch2a_bn_s_0"
    input: "gpu_0/res5_2_branch2a_bn_b_0"
    input: "gpu_0/res5_2_branch2a_bn_rm_0"
    input: "gpu_0/res5_2_branch2a_bn_riv_0"
    output: "gpu_0/res5_2_branch2a_bn_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.0000001e-05
      type: FLOAT
    }
  }
  node {
    input: "gpu_0/res5_2_branch2a_bn_1"
    output: "gpu_0/res5_2_branch2a_bn_2"
    op_type: "Relu"
  }
  node {
    input: "gpu_0/res5_2_branch2a_bn_2"
    input: "gpu_0/res5_2_branch2b_w_0"
    output: "gpu_0/res5_2_branch2b_1"
    op_type: "Conv"
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
