ir_version: 3
graph {
  node {
    input: "data"
    input: "resnetv18_conv0_weight"
    output: "resnetv18_conv0_fwd"
    name: "resnetv18_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_conv0_fwd"
    input: "resnetv18_batchnorm0_gamma"
    input: "resnetv18_batchnorm0_beta"
    input: "resnetv18_batchnorm0_running_mean"
    input: "resnetv18_batchnorm0_running_var"
    output: "resnetv18_batchnorm0_fwd"
    name: "resnetv18_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_batchnorm0_fwd"
    output: "resnetv18_relu0_fwd"
    name: "resnetv18_relu0_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_relu0_fwd"
    output: "resnetv18_pool0_fwd"
    name: "resnetv18_pool0_fwd"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_pool0_fwd"
    input: "resnetv18_stage1_conv0_weight"
    input: "resnetv18_stage1_conv0_bias"
    output: "resnetv18_stage1_conv0_fwd"
    name: "resnetv18_stage1_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv0_fwd"
    input: "resnetv18_stage1_batchnorm0_gamma"
    input: "resnetv18_stage1_batchnorm0_beta"
    input: "resnetv18_stage1_batchnorm0_running_mean"
    input: "resnetv18_stage1_batchnorm0_running_var"
    output: "resnetv18_stage1_batchnorm0_fwd"
    name: "resnetv18_stage1_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm0_fwd"
    output: "resnetv18_stage1_relu0_fwd"
    name: "resnetv18_stage1_relu0_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu0_fwd"
    input: "resnetv18_stage1_conv1_weight"
    output: "resnetv18_stage1_conv1_fwd"
    name: "resnetv18_stage1_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv1_fwd"
    input: "resnetv18_stage1_batchnorm1_gamma"
    input: "resnetv18_stage1_batchnorm1_beta"
    input: "resnetv18_stage1_batchnorm1_running_mean"
    input: "resnetv18_stage1_batchnorm1_running_var"
    output: "resnetv18_stage1_batchnorm1_fwd"
    name: "resnetv18_stage1_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm1_fwd"
    output: "resnetv18_stage1_relu1_fwd"
    name: "resnetv18_stage1_relu1_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu1_fwd"
    input: "resnetv18_stage1_conv2_weight"
    input: "resnetv18_stage1_conv2_bias"
    output: "resnetv18_stage1_conv2_fwd"
    name: "resnetv18_stage1_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv2_fwd"
    input: "resnetv18_stage1_batchnorm2_gamma"
    input: "resnetv18_stage1_batchnorm2_beta"
    input: "resnetv18_stage1_batchnorm2_running_mean"
    input: "resnetv18_stage1_batchnorm2_running_var"
    output: "resnetv18_stage1_batchnorm2_fwd"
    name: "resnetv18_stage1_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_pool0_fwd"
    input: "resnetv18_stage1_conv3_weight"
    output: "resnetv18_stage1_conv3_fwd"
    name: "resnetv18_stage1_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv3_fwd"
    input: "resnetv18_stage1_batchnorm3_gamma"
    input: "resnetv18_stage1_batchnorm3_beta"
    input: "resnetv18_stage1_batchnorm3_running_mean"
    input: "resnetv18_stage1_batchnorm3_running_var"
    output: "resnetv18_stage1_batchnorm3_fwd"
    name: "resnetv18_stage1_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm2_fwd"
    input: "resnetv18_stage1_batchnorm3_fwd"
    output: "resnetv18_stage1__plus0"
    name: "resnetv18_stage1__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage1__plus0"
    output: "resnetv18_stage1_activation0"
    name: "resnetv18_stage1_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_activation0"
    input: "resnetv18_stage1_conv4_weight"
    input: "resnetv18_stage1_conv4_bias"
    output: "resnetv18_stage1_conv4_fwd"
    name: "resnetv18_stage1_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv4_fwd"
    input: "resnetv18_stage1_batchnorm4_gamma"
    input: "resnetv18_stage1_batchnorm4_beta"
    input: "resnetv18_stage1_batchnorm4_running_mean"
    input: "resnetv18_stage1_batchnorm4_running_var"
    output: "resnetv18_stage1_batchnorm4_fwd"
    name: "resnetv18_stage1_batchnorm4_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm4_fwd"
    output: "resnetv18_stage1_relu2_fwd"
    name: "resnetv18_stage1_relu2_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu2_fwd"
    input: "resnetv18_stage1_conv5_weight"
    output: "resnetv18_stage1_conv5_fwd"
    name: "resnetv18_stage1_conv5_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv5_fwd"
    input: "resnetv18_stage1_batchnorm5_gamma"
    input: "resnetv18_stage1_batchnorm5_beta"
    input: "resnetv18_stage1_batchnorm5_running_mean"
    input: "resnetv18_stage1_batchnorm5_running_var"
    output: "resnetv18_stage1_batchnorm5_fwd"
    name: "resnetv18_stage1_batchnorm5_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm5_fwd"
    output: "resnetv18_stage1_relu3_fwd"
    name: "resnetv18_stage1_relu3_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu3_fwd"
    input: "resnetv18_stage1_conv6_weight"
    input: "resnetv18_stage1_conv6_bias"
    output: "resnetv18_stage1_conv6_fwd"
    name: "resnetv18_stage1_conv6_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv6_fwd"
    input: "resnetv18_stage1_batchnorm6_gamma"
    input: "resnetv18_stage1_batchnorm6_beta"
    input: "resnetv18_stage1_batchnorm6_running_mean"
    input: "resnetv18_stage1_batchnorm6_running_var"
    output: "resnetv18_stage1_batchnorm6_fwd"
    name: "resnetv18_stage1_batchnorm6_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm6_fwd"
    input: "resnetv18_stage1_activation0"
    output: "resnetv18_stage1__plus1"
    name: "resnetv18_stage1__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage1__plus1"
    output: "resnetv18_stage1_activation1"
    name: "resnetv18_stage1_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_activation1"
    input: "resnetv18_stage1_conv7_weight"
    input: "resnetv18_stage1_conv7_bias"
    output: "resnetv18_stage1_conv7_fwd"
    name: "resnetv18_stage1_conv7_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv7_fwd"
    input: "resnetv18_stage1_batchnorm7_gamma"
    input: "resnetv18_stage1_batchnorm7_beta"
    input: "resnetv18_stage1_batchnorm7_running_mean"
    input: "resnetv18_stage1_batchnorm7_running_var"
    output: "resnetv18_stage1_batchnorm7_fwd"
    name: "resnetv18_stage1_batchnorm7_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm7_fwd"
    output: "resnetv18_stage1_relu4_fwd"
    name: "resnetv18_stage1_relu4_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu4_fwd"
    input: "resnetv18_stage1_conv8_weight"
    output: "resnetv18_stage1_conv8_fwd"
    name: "resnetv18_stage1_conv8_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv8_fwd"
    input: "resnetv18_stage1_batchnorm8_gamma"
    input: "resnetv18_stage1_batchnorm8_beta"
    input: "resnetv18_stage1_batchnorm8_running_mean"
    input: "resnetv18_stage1_batchnorm8_running_var"
    output: "resnetv18_stage1_batchnorm8_fwd"
    name: "resnetv18_stage1_batchnorm8_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm8_fwd"
    output: "resnetv18_stage1_relu5_fwd"
    name: "resnetv18_stage1_relu5_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_relu5_fwd"
    input: "resnetv18_stage1_conv9_weight"
    input: "resnetv18_stage1_conv9_bias"
    output: "resnetv18_stage1_conv9_fwd"
    name: "resnetv18_stage1_conv9_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage1_conv9_fwd"
    input: "resnetv18_stage1_batchnorm9_gamma"
    input: "resnetv18_stage1_batchnorm9_beta"
    input: "resnetv18_stage1_batchnorm9_running_mean"
    input: "resnetv18_stage1_batchnorm9_running_var"
    output: "resnetv18_stage1_batchnorm9_fwd"
    name: "resnetv18_stage1_batchnorm9_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_batchnorm9_fwd"
    input: "resnetv18_stage1_activation1"
    output: "resnetv18_stage1__plus2"
    name: "resnetv18_stage1__plus2"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage1__plus2"
    output: "resnetv18_stage1_activation2"
    name: "resnetv18_stage1_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage1_activation2"
    input: "resnetv18_stage2_conv0_weight"
    input: "resnetv18_stage2_conv0_bias"
    output: "resnetv18_stage2_conv0_fwd"
    name: "resnetv18_stage2_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv0_fwd"
    input: "resnetv18_stage2_batchnorm0_gamma"
    input: "resnetv18_stage2_batchnorm0_beta"
    input: "resnetv18_stage2_batchnorm0_running_mean"
    input: "resnetv18_stage2_batchnorm0_running_var"
    output: "resnetv18_stage2_batchnorm0_fwd"
    name: "resnetv18_stage2_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm0_fwd"
    output: "resnetv18_stage2_relu0_fwd"
    name: "resnetv18_stage2_relu0_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu0_fwd"
    input: "resnetv18_stage2_conv1_weight"
    output: "resnetv18_stage2_conv1_fwd"
    name: "resnetv18_stage2_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv1_fwd"
    input: "resnetv18_stage2_batchnorm1_gamma"
    input: "resnetv18_stage2_batchnorm1_beta"
    input: "resnetv18_stage2_batchnorm1_running_mean"
    input: "resnetv18_stage2_batchnorm1_running_var"
    output: "resnetv18_stage2_batchnorm1_fwd"
    name: "resnetv18_stage2_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm1_fwd"
    output: "resnetv18_stage2_relu1_fwd"
    name: "resnetv18_stage2_relu1_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu1_fwd"
    input: "resnetv18_stage2_conv2_weight"
    input: "resnetv18_stage2_conv2_bias"
    output: "resnetv18_stage2_conv2_fwd"
    name: "resnetv18_stage2_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv2_fwd"
    input: "resnetv18_stage2_batchnorm2_gamma"
    input: "resnetv18_stage2_batchnorm2_beta"
    input: "resnetv18_stage2_batchnorm2_running_mean"
    input: "resnetv18_stage2_batchnorm2_running_var"
    output: "resnetv18_stage2_batchnorm2_fwd"
    name: "resnetv18_stage2_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage1_activation2"
    input: "resnetv18_stage2_conv3_weight"
    output: "resnetv18_stage2_conv3_fwd"
    name: "resnetv18_stage2_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv3_fwd"
    input: "resnetv18_stage2_batchnorm3_gamma"
    input: "resnetv18_stage2_batchnorm3_beta"
    input: "resnetv18_stage2_batchnorm3_running_mean"
    input: "resnetv18_stage2_batchnorm3_running_var"
    output: "resnetv18_stage2_batchnorm3_fwd"
    name: "resnetv18_stage2_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm2_fwd"
    input: "resnetv18_stage2_batchnorm3_fwd"
    output: "resnetv18_stage2__plus0"
    name: "resnetv18_stage2__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage2__plus0"
    output: "resnetv18_stage2_activation0"
    name: "resnetv18_stage2_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_activation0"
    input: "resnetv18_stage2_conv4_weight"
    input: "resnetv18_stage2_conv4_bias"
    output: "resnetv18_stage2_conv4_fwd"
    name: "resnetv18_stage2_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv4_fwd"
    input: "resnetv18_stage2_batchnorm4_gamma"
    input: "resnetv18_stage2_batchnorm4_beta"
    input: "resnetv18_stage2_batchnorm4_running_mean"
    input: "resnetv18_stage2_batchnorm4_running_var"
    output: "resnetv18_stage2_batchnorm4_fwd"
    name: "resnetv18_stage2_batchnorm4_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm4_fwd"
    output: "resnetv18_stage2_relu2_fwd"
    name: "resnetv18_stage2_relu2_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu2_fwd"
    input: "resnetv18_stage2_conv5_weight"
    output: "resnetv18_stage2_conv5_fwd"
    name: "resnetv18_stage2_conv5_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv5_fwd"
    input: "resnetv18_stage2_batchnorm5_gamma"
    input: "resnetv18_stage2_batchnorm5_beta"
    input: "resnetv18_stage2_batchnorm5_running_mean"
    input: "resnetv18_stage2_batchnorm5_running_var"
    output: "resnetv18_stage2_batchnorm5_fwd"
    name: "resnetv18_stage2_batchnorm5_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm5_fwd"
    output: "resnetv18_stage2_relu3_fwd"
    name: "resnetv18_stage2_relu3_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu3_fwd"
    input: "resnetv18_stage2_conv6_weight"
    input: "resnetv18_stage2_conv6_bias"
    output: "resnetv18_stage2_conv6_fwd"
    name: "resnetv18_stage2_conv6_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv6_fwd"
    input: "resnetv18_stage2_batchnorm6_gamma"
    input: "resnetv18_stage2_batchnorm6_beta"
    input: "resnetv18_stage2_batchnorm6_running_mean"
    input: "resnetv18_stage2_batchnorm6_running_var"
    output: "resnetv18_stage2_batchnorm6_fwd"
    name: "resnetv18_stage2_batchnorm6_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm6_fwd"
    input: "resnetv18_stage2_activation0"
    output: "resnetv18_stage2__plus1"
    name: "resnetv18_stage2__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage2__plus1"
    output: "resnetv18_stage2_activation1"
    name: "resnetv18_stage2_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_activation1"
    input: "resnetv18_stage2_conv7_weight"
    input: "resnetv18_stage2_conv7_bias"
    output: "resnetv18_stage2_conv7_fwd"
    name: "resnetv18_stage2_conv7_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv7_fwd"
    input: "resnetv18_stage2_batchnorm7_gamma"
    input: "resnetv18_stage2_batchnorm7_beta"
    input: "resnetv18_stage2_batchnorm7_running_mean"
    input: "resnetv18_stage2_batchnorm7_running_var"
    output: "resnetv18_stage2_batchnorm7_fwd"
    name: "resnetv18_stage2_batchnorm7_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm7_fwd"
    output: "resnetv18_stage2_relu4_fwd"
    name: "resnetv18_stage2_relu4_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu4_fwd"
    input: "resnetv18_stage2_conv8_weight"
    output: "resnetv18_stage2_conv8_fwd"
    name: "resnetv18_stage2_conv8_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv8_fwd"
    input: "resnetv18_stage2_batchnorm8_gamma"
    input: "resnetv18_stage2_batchnorm8_beta"
    input: "resnetv18_stage2_batchnorm8_running_mean"
    input: "resnetv18_stage2_batchnorm8_running_var"
    output: "resnetv18_stage2_batchnorm8_fwd"
    name: "resnetv18_stage2_batchnorm8_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm8_fwd"
    output: "resnetv18_stage2_relu5_fwd"
    name: "resnetv18_stage2_relu5_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu5_fwd"
    input: "resnetv18_stage2_conv9_weight"
    input: "resnetv18_stage2_conv9_bias"
    output: "resnetv18_stage2_conv9_fwd"
    name: "resnetv18_stage2_conv9_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv9_fwd"
    input: "resnetv18_stage2_batchnorm9_gamma"
    input: "resnetv18_stage2_batchnorm9_beta"
    input: "resnetv18_stage2_batchnorm9_running_mean"
    input: "resnetv18_stage2_batchnorm9_running_var"
    output: "resnetv18_stage2_batchnorm9_fwd"
    name: "resnetv18_stage2_batchnorm9_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm9_fwd"
    input: "resnetv18_stage2_activation1"
    output: "resnetv18_stage2__plus2"
    name: "resnetv18_stage2__plus2"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage2__plus2"
    output: "resnetv18_stage2_activation2"
    name: "resnetv18_stage2_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_activation2"
    input: "resnetv18_stage2_conv10_weight"
    input: "resnetv18_stage2_conv10_bias"
    output: "resnetv18_stage2_conv10_fwd"
    name: "resnetv18_stage2_conv10_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv10_fwd"
    input: "resnetv18_stage2_batchnorm10_gamma"
    input: "resnetv18_stage2_batchnorm10_beta"
    input: "resnetv18_stage2_batchnorm10_running_mean"
    input: "resnetv18_stage2_batchnorm10_running_var"
    output: "resnetv18_stage2_batchnorm10_fwd"
    name: "resnetv18_stage2_batchnorm10_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm10_fwd"
    output: "resnetv18_stage2_relu6_fwd"
    name: "resnetv18_stage2_relu6_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu6_fwd"
    input: "resnetv18_stage2_conv11_weight"
    output: "resnetv18_stage2_conv11_fwd"
    name: "resnetv18_stage2_conv11_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv11_fwd"
    input: "resnetv18_stage2_batchnorm11_gamma"
    input: "resnetv18_stage2_batchnorm11_beta"
    input: "resnetv18_stage2_batchnorm11_running_mean"
    input: "resnetv18_stage2_batchnorm11_running_var"
    output: "resnetv18_stage2_batchnorm11_fwd"
    name: "resnetv18_stage2_batchnorm11_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm11_fwd"
    output: "resnetv18_stage2_relu7_fwd"
    name: "resnetv18_stage2_relu7_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_relu7_fwd"
    input: "resnetv18_stage2_conv12_weight"
    input: "resnetv18_stage2_conv12_bias"
    output: "resnetv18_stage2_conv12_fwd"
    name: "resnetv18_stage2_conv12_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage2_conv12_fwd"
    input: "resnetv18_stage2_batchnorm12_gamma"
    input: "resnetv18_stage2_batchnorm12_beta"
    input: "resnetv18_stage2_batchnorm12_running_mean"
    input: "resnetv18_stage2_batchnorm12_running_var"
    output: "resnetv18_stage2_batchnorm12_fwd"
    name: "resnetv18_stage2_batchnorm12_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_batchnorm12_fwd"
    input: "resnetv18_stage2_activation2"
    output: "resnetv18_stage2__plus3"
    name: "resnetv18_stage2__plus3"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage2__plus3"
    output: "resnetv18_stage2_activation3"
    name: "resnetv18_stage2_activation3"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage2_activation3"
    input: "resnetv18_stage3_conv0_weight"
    input: "resnetv18_stage3_conv0_bias"
    output: "resnetv18_stage3_conv0_fwd"
    name: "resnetv18_stage3_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv0_fwd"
    input: "resnetv18_stage3_batchnorm0_gamma"
    input: "resnetv18_stage3_batchnorm0_beta"
    input: "resnetv18_stage3_batchnorm0_running_mean"
    input: "resnetv18_stage3_batchnorm0_running_var"
    output: "resnetv18_stage3_batchnorm0_fwd"
    name: "resnetv18_stage3_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm0_fwd"
    output: "resnetv18_stage3_relu0_fwd"
    name: "resnetv18_stage3_relu0_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu0_fwd"
    input: "resnetv18_stage3_conv1_weight"
    output: "resnetv18_stage3_conv1_fwd"
    name: "resnetv18_stage3_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv1_fwd"
    input: "resnetv18_stage3_batchnorm1_gamma"
    input: "resnetv18_stage3_batchnorm1_beta"
    input: "resnetv18_stage3_batchnorm1_running_mean"
    input: "resnetv18_stage3_batchnorm1_running_var"
    output: "resnetv18_stage3_batchnorm1_fwd"
    name: "resnetv18_stage3_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm1_fwd"
    output: "resnetv18_stage3_relu1_fwd"
    name: "resnetv18_stage3_relu1_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu1_fwd"
    input: "resnetv18_stage3_conv2_weight"
    input: "resnetv18_stage3_conv2_bias"
    output: "resnetv18_stage3_conv2_fwd"
    name: "resnetv18_stage3_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv2_fwd"
    input: "resnetv18_stage3_batchnorm2_gamma"
    input: "resnetv18_stage3_batchnorm2_beta"
    input: "resnetv18_stage3_batchnorm2_running_mean"
    input: "resnetv18_stage3_batchnorm2_running_var"
    output: "resnetv18_stage3_batchnorm2_fwd"
    name: "resnetv18_stage3_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage2_activation3"
    input: "resnetv18_stage3_conv3_weight"
    output: "resnetv18_stage3_conv3_fwd"
    name: "resnetv18_stage3_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv3_fwd"
    input: "resnetv18_stage3_batchnorm3_gamma"
    input: "resnetv18_stage3_batchnorm3_beta"
    input: "resnetv18_stage3_batchnorm3_running_mean"
    input: "resnetv18_stage3_batchnorm3_running_var"
    output: "resnetv18_stage3_batchnorm3_fwd"
    name: "resnetv18_stage3_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm2_fwd"
    input: "resnetv18_stage3_batchnorm3_fwd"
    output: "resnetv18_stage3__plus0"
    name: "resnetv18_stage3__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage3__plus0"
    output: "resnetv18_stage3_activation0"
    name: "resnetv18_stage3_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_activation0"
    input: "resnetv18_stage3_conv4_weight"
    input: "resnetv18_stage3_conv4_bias"
    output: "resnetv18_stage3_conv4_fwd"
    name: "resnetv18_stage3_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv4_fwd"
    input: "resnetv18_stage3_batchnorm4_gamma"
    input: "resnetv18_stage3_batchnorm4_beta"
    input: "resnetv18_stage3_batchnorm4_running_mean"
    input: "resnetv18_stage3_batchnorm4_running_var"
    output: "resnetv18_stage3_batchnorm4_fwd"
    name: "resnetv18_stage3_batchnorm4_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm4_fwd"
    output: "resnetv18_stage3_relu2_fwd"
    name: "resnetv18_stage3_relu2_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu2_fwd"
    input: "resnetv18_stage3_conv5_weight"
    output: "resnetv18_stage3_conv5_fwd"
    name: "resnetv18_stage3_conv5_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv5_fwd"
    input: "resnetv18_stage3_batchnorm5_gamma"
    input: "resnetv18_stage3_batchnorm5_beta"
    input: "resnetv18_stage3_batchnorm5_running_mean"
    input: "resnetv18_stage3_batchnorm5_running_var"
    output: "resnetv18_stage3_batchnorm5_fwd"
    name: "resnetv18_stage3_batchnorm5_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm5_fwd"
    output: "resnetv18_stage3_relu3_fwd"
    name: "resnetv18_stage3_relu3_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu3_fwd"
    input: "resnetv18_stage3_conv6_weight"
    input: "resnetv18_stage3_conv6_bias"
    output: "resnetv18_stage3_conv6_fwd"
    name: "resnetv18_stage3_conv6_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv6_fwd"
    input: "resnetv18_stage3_batchnorm6_gamma"
    input: "resnetv18_stage3_batchnorm6_beta"
    input: "resnetv18_stage3_batchnorm6_running_mean"
    input: "resnetv18_stage3_batchnorm6_running_var"
    output: "resnetv18_stage3_batchnorm6_fwd"
    name: "resnetv18_stage3_batchnorm6_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm6_fwd"
    input: "resnetv18_stage3_activation0"
    output: "resnetv18_stage3__plus1"
    name: "resnetv18_stage3__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv18_stage3__plus1"
    output: "resnetv18_stage3_activation1"
    name: "resnetv18_stage3_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_activation1"
    input: "resnetv18_stage3_conv7_weight"
    input: "resnetv18_stage3_conv7_bias"
    output: "resnetv18_stage3_conv7_fwd"
    name: "resnetv18_stage3_conv7_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv7_fwd"
    input: "resnetv18_stage3_batchnorm7_gamma"
    input: "resnetv18_stage3_batchnorm7_beta"
    input: "resnetv18_stage3_batchnorm7_running_mean"
    input: "resnetv18_stage3_batchnorm7_running_var"
    output: "resnetv18_stage3_batchnorm7_fwd"
    name: "resnetv18_stage3_batchnorm7_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm7_fwd"
    output: "resnetv18_stage3_relu4_fwd"
    name: "resnetv18_stage3_relu4_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu4_fwd"
    input: "resnetv18_stage3_conv8_weight"
    output: "resnetv18_stage3_conv8_fwd"
    name: "resnetv18_stage3_conv8_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv8_fwd"
    input: "resnetv18_stage3_batchnorm8_gamma"
    input: "resnetv18_stage3_batchnorm8_beta"
    input: "resnetv18_stage3_batchnorm8_running_mean"
    input: "resnetv18_stage3_batchnorm8_running_var"
    output: "resnetv18_stage3_batchnorm8_fwd"
    name: "resnetv18_stage3_batchnorm8_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv18_stage3_batchnorm8_fwd"
    output: "resnetv18_stage3_relu5_fwd"
    name: "resnetv18_stage3_relu5_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv18_stage3_relu5_fwd"
    input: "resnetv18_stage3_conv9_weight"
    input: "resnetv18_stage3_conv9_bias"
    output: "resnetv18_stage3_conv9_fwd"
    name: "resnetv18_stage3_conv9_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv18_stage3_conv9_fwd"
    input: "resnetv18_stage3_batchnorm9_gamma"
    input: "resnetv18_stage3_batchnorm9_beta"
    input: "resnetv18_stage3_batchnorm9_running_mean"
    input: "resnetv18_stage3_batchnorm9_running_var"
    output: "resnetv18_stage3_batchnorm9_fwd"
