ir_version: 3
graph {
  node {
    input: "data"
    input: "resnetv22_batchnorm0_gamma"
    input: "resnetv22_batchnorm0_beta"
    input: "resnetv22_batchnorm0_running_mean"
    input: "resnetv22_batchnorm0_running_var"
    output: "resnetv22_batchnorm0_fwd"
    name: "resnetv22_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_batchnorm0_fwd"
    input: "resnetv22_conv0_weight"
    output: "resnetv22_conv0_fwd"
    name: "resnetv22_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_conv0_fwd"
    input: "resnetv22_batchnorm1_gamma"
    input: "resnetv22_batchnorm1_beta"
    input: "resnetv22_batchnorm1_running_mean"
    input: "resnetv22_batchnorm1_running_var"
    output: "resnetv22_batchnorm1_fwd"
    name: "resnetv22_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_batchnorm1_fwd"
    output: "resnetv22_relu0_fwd"
    name: "resnetv22_relu0_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_relu0_fwd"
    output: "resnetv22_pool0_fwd"
    name: "resnetv22_pool0_fwd"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_pool0_fwd"
    input: "resnetv22_stage1_batchnorm0_gamma"
    input: "resnetv22_stage1_batchnorm0_beta"
    input: "resnetv22_stage1_batchnorm0_running_mean"
    input: "resnetv22_stage1_batchnorm0_running_var"
    output: "resnetv22_stage1_batchnorm0_fwd"
    name: "resnetv22_stage1_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage1_batchnorm0_fwd"
    output: "resnetv22_stage1_activation0"
    name: "resnetv22_stage1_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage1_activation0"
    input: "resnetv22_stage1_conv0_weight"
    output: "resnetv22_stage1_conv0_fwd"
    name: "resnetv22_stage1_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage1_conv0_fwd"
    input: "resnetv22_stage1_batchnorm1_gamma"
    input: "resnetv22_stage1_batchnorm1_beta"
    input: "resnetv22_stage1_batchnorm1_running_mean"
    input: "resnetv22_stage1_batchnorm1_running_var"
    output: "resnetv22_stage1_batchnorm1_fwd"
    name: "resnetv22_stage1_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage1_batchnorm1_fwd"
    output: "resnetv22_stage1_activation1"
    name: "resnetv22_stage1_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage1_activation1"
    input: "resnetv22_stage1_conv1_weight"
    output: "resnetv22_stage1_conv1_fwd"
    name: "resnetv22_stage1_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage1_conv1_fwd"
    input: "resnetv22_pool0_fwd"
    output: "resnetv22_stage1__plus0"
    name: "resnetv22_stage1__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage1__plus0"
    input: "resnetv22_stage1_batchnorm2_gamma"
    input: "resnetv22_stage1_batchnorm2_beta"
    input: "resnetv22_stage1_batchnorm2_running_mean"
    input: "resnetv22_stage1_batchnorm2_running_var"
    output: "resnetv22_stage1_batchnorm2_fwd"
    name: "resnetv22_stage1_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage1_batchnorm2_fwd"
    output: "resnetv22_stage1_activation2"
    name: "resnetv22_stage1_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage1_activation2"
    input: "resnetv22_stage1_conv2_weight"
    output: "resnetv22_stage1_conv2_fwd"
    name: "resnetv22_stage1_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage1_conv2_fwd"
    input: "resnetv22_stage1_batchnorm3_gamma"
    input: "resnetv22_stage1_batchnorm3_beta"
    input: "resnetv22_stage1_batchnorm3_running_mean"
    input: "resnetv22_stage1_batchnorm3_running_var"
    output: "resnetv22_stage1_batchnorm3_fwd"
    name: "resnetv22_stage1_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage1_batchnorm3_fwd"
    output: "resnetv22_stage1_activation3"
    name: "resnetv22_stage1_activation3"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage1_activation3"
    input: "resnetv22_stage1_conv3_weight"
    output: "resnetv22_stage1_conv3_fwd"
    name: "resnetv22_stage1_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage1_conv3_fwd"
    input: "resnetv22_stage1__plus0"
    output: "resnetv22_stage1__plus1"
    name: "resnetv22_stage1__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage1__plus1"
    input: "resnetv22_stage2_batchnorm0_gamma"
    input: "resnetv22_stage2_batchnorm0_beta"
    input: "resnetv22_stage2_batchnorm0_running_mean"
    input: "resnetv22_stage2_batchnorm0_running_var"
    output: "resnetv22_stage2_batchnorm0_fwd"
    name: "resnetv22_stage2_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage2_batchnorm0_fwd"
    output: "resnetv22_stage2_activation0"
    name: "resnetv22_stage2_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage2_activation0"
    input: "resnetv22_stage2_conv0_weight"
    output: "resnetv22_stage2_conv0_fwd"
    name: "resnetv22_stage2_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage2_conv0_fwd"
    input: "resnetv22_stage2_batchnorm1_gamma"
    input: "resnetv22_stage2_batchnorm1_beta"
    input: "resnetv22_stage2_batchnorm1_running_mean"
    input: "resnetv22_stage2_batchnorm1_running_var"
    output: "resnetv22_stage2_batchnorm1_fwd"
    name: "resnetv22_stage2_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage2_batchnorm1_fwd"
    output: "resnetv22_stage2_activation1"
    name: "resnetv22_stage2_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage2_activation1"
    input: "resnetv22_stage2_conv1_weight"
    output: "resnetv22_stage2_conv1_fwd"
    name: "resnetv22_stage2_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage2_activation0"
    input: "resnetv22_stage2_conv2_weight"
    output: "resnetv22_stage2_conv2_fwd"
    name: "resnetv22_stage2_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage2_conv1_fwd"
    input: "resnetv22_stage2_conv2_fwd"
    output: "resnetv22_stage2__plus0"
    name: "resnetv22_stage2__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage2__plus0"
    input: "resnetv22_stage2_batchnorm2_gamma"
    input: "resnetv22_stage2_batchnorm2_beta"
    input: "resnetv22_stage2_batchnorm2_running_mean"
    input: "resnetv22_stage2_batchnorm2_running_var"
    output: "resnetv22_stage2_batchnorm2_fwd"
    name: "resnetv22_stage2_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage2_batchnorm2_fwd"
    output: "resnetv22_stage2_activation2"
    name: "resnetv22_stage2_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage2_activation2"
    input: "resnetv22_stage2_conv3_weight"
    output: "resnetv22_stage2_conv3_fwd"
    name: "resnetv22_stage2_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage2_conv3_fwd"
    input: "resnetv22_stage2_batchnorm3_gamma"
    input: "resnetv22_stage2_batchnorm3_beta"
    input: "resnetv22_stage2_batchnorm3_running_mean"
    input: "resnetv22_stage2_batchnorm3_running_var"
    output: "resnetv22_stage2_batchnorm3_fwd"
    name: "resnetv22_stage2_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage2_batchnorm3_fwd"
    output: "resnetv22_stage2_activation3"
    name: "resnetv22_stage2_activation3"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage2_activation3"
    input: "resnetv22_stage2_conv4_weight"
    output: "resnetv22_stage2_conv4_fwd"
    name: "resnetv22_stage2_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage2_conv4_fwd"
    input: "resnetv22_stage2__plus0"
    output: "resnetv22_stage2__plus1"
    name: "resnetv22_stage2__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage2__plus1"
    input: "resnetv22_stage3_batchnorm0_gamma"
    input: "resnetv22_stage3_batchnorm0_beta"
    input: "resnetv22_stage3_batchnorm0_running_mean"
    input: "resnetv22_stage3_batchnorm0_running_var"
    output: "resnetv22_stage3_batchnorm0_fwd"
    name: "resnetv22_stage3_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage3_batchnorm0_fwd"
    output: "resnetv22_stage3_activation0"
    name: "resnetv22_stage3_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage3_activation0"
    input: "resnetv22_stage3_conv0_weight"
    output: "resnetv22_stage3_conv0_fwd"
    name: "resnetv22_stage3_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage3_conv0_fwd"
    input: "resnetv22_stage3_batchnorm1_gamma"
    input: "resnetv22_stage3_batchnorm1_beta"
    input: "resnetv22_stage3_batchnorm1_running_mean"
    input: "resnetv22_stage3_batchnorm1_running_var"
    output: "resnetv22_stage3_batchnorm1_fwd"
    name: "resnetv22_stage3_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage3_batchnorm1_fwd"
    output: "resnetv22_stage3_activation1"
    name: "resnetv22_stage3_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage3_activation1"
    input: "resnetv22_stage3_conv1_weight"
    output: "resnetv22_stage3_conv1_fwd"
    name: "resnetv22_stage3_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage3_activation0"
    input: "resnetv22_stage3_conv2_weight"
    output: "resnetv22_stage3_conv2_fwd"
    name: "resnetv22_stage3_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage3_conv1_fwd"
    input: "resnetv22_stage3_conv2_fwd"
    output: "resnetv22_stage3__plus0"
    name: "resnetv22_stage3__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage3__plus0"
    input: "resnetv22_stage3_batchnorm2_gamma"
    input: "resnetv22_stage3_batchnorm2_beta"
    input: "resnetv22_stage3_batchnorm2_running_mean"
    input: "resnetv22_stage3_batchnorm2_running_var"
    output: "resnetv22_stage3_batchnorm2_fwd"
    name: "resnetv22_stage3_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage3_batchnorm2_fwd"
    output: "resnetv22_stage3_activation2"
    name: "resnetv22_stage3_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage3_activation2"
    input: "resnetv22_stage3_conv3_weight"
    output: "resnetv22_stage3_conv3_fwd"
    name: "resnetv22_stage3_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage3_conv3_fwd"
    input: "resnetv22_stage3_batchnorm3_gamma"
    input: "resnetv22_stage3_batchnorm3_beta"
    input: "resnetv22_stage3_batchnorm3_running_mean"
    input: "resnetv22_stage3_batchnorm3_running_var"
    output: "resnetv22_stage3_batchnorm3_fwd"
    name: "resnetv22_stage3_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage3_batchnorm3_fwd"
    output: "resnetv22_stage3_activation3"
    name: "resnetv22_stage3_activation3"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage3_activation3"
    input: "resnetv22_stage3_conv4_weight"
    output: "resnetv22_stage3_conv4_fwd"
    name: "resnetv22_stage3_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage3_conv4_fwd"
    input: "resnetv22_stage3__plus0"
    output: "resnetv22_stage3__plus1"
    name: "resnetv22_stage3__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage3__plus1"
    input: "resnetv22_stage4_batchnorm0_gamma"
    input: "resnetv22_stage4_batchnorm0_beta"
    input: "resnetv22_stage4_batchnorm0_running_mean"
    input: "resnetv22_stage4_batchnorm0_running_var"
    output: "resnetv22_stage4_batchnorm0_fwd"
    name: "resnetv22_stage4_batchnorm0_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage4_batchnorm0_fwd"
    output: "resnetv22_stage4_activation0"
    name: "resnetv22_stage4_activation0"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage4_activation0"
    input: "resnetv22_stage4_conv0_weight"
    output: "resnetv22_stage4_conv0_fwd"
    name: "resnetv22_stage4_conv0_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage4_conv0_fwd"
    input: "resnetv22_stage4_batchnorm1_gamma"
    input: "resnetv22_stage4_batchnorm1_beta"
    input: "resnetv22_stage4_batchnorm1_running_mean"
    input: "resnetv22_stage4_batchnorm1_running_var"
    output: "resnetv22_stage4_batchnorm1_fwd"
    name: "resnetv22_stage4_batchnorm1_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage4_batchnorm1_fwd"
    output: "resnetv22_stage4_activation1"
    name: "resnetv22_stage4_activation1"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage4_activation1"
    input: "resnetv22_stage4_conv1_weight"
    output: "resnetv22_stage4_conv1_fwd"
    name: "resnetv22_stage4_conv1_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage4_activation0"
    input: "resnetv22_stage4_conv2_weight"
    output: "resnetv22_stage4_conv2_fwd"
    name: "resnetv22_stage4_conv2_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage4_conv1_fwd"
    input: "resnetv22_stage4_conv2_fwd"
    output: "resnetv22_stage4__plus0"
    name: "resnetv22_stage4__plus0"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage4__plus0"
    input: "resnetv22_stage4_batchnorm2_gamma"
    input: "resnetv22_stage4_batchnorm2_beta"
    input: "resnetv22_stage4_batchnorm2_running_mean"
    input: "resnetv22_stage4_batchnorm2_running_var"
    output: "resnetv22_stage4_batchnorm2_fwd"
    name: "resnetv22_stage4_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage4_batchnorm2_fwd"
    output: "resnetv22_stage4_activation2"
    name: "resnetv22_stage4_activation2"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage4_activation2"
    input: "resnetv22_stage4_conv3_weight"
    output: "resnetv22_stage4_conv3_fwd"
    name: "resnetv22_stage4_conv3_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage4_conv3_fwd"
    input: "resnetv22_stage4_batchnorm3_gamma"
    input: "resnetv22_stage4_batchnorm3_beta"
    input: "resnetv22_stage4_batchnorm3_running_mean"
    input: "resnetv22_stage4_batchnorm3_running_var"
    output: "resnetv22_stage4_batchnorm3_fwd"
    name: "resnetv22_stage4_batchnorm3_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_stage4_batchnorm3_fwd"
    output: "resnetv22_stage4_activation3"
    name: "resnetv22_stage4_activation3"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_stage4_activation3"
    input: "resnetv22_stage4_conv4_weight"
    output: "resnetv22_stage4_conv4_fwd"
    name: "resnetv22_stage4_conv4_fwd"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "resnetv22_stage4_conv4_fwd"
    input: "resnetv22_stage4__plus0"
    output: "resnetv22_stage4__plus1"
    name: "resnetv22_stage4__plus1"
    op_type: "Add"
  }
  node {
    input: "resnetv22_stage4__plus1"
    input: "resnetv22_batchnorm2_gamma"
    input: "resnetv22_batchnorm2_beta"
    input: "resnetv22_batchnorm2_running_mean"
    input: "resnetv22_batchnorm2_running_var"
    output: "resnetv22_batchnorm2_fwd"
    name: "resnetv22_batchnorm2_fwd"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "spatial"
      i: 1
      type: INT
    }
  }
  node {
    input: "resnetv22_batchnorm2_fwd"
    output: "resnetv22_relu1_fwd"
    name: "resnetv22_relu1_fwd"
    op_type: "Relu"
  }
  node {
    input: "resnetv22_relu1_fwd"
    output: "resnetv22_pool1_fwd"
    name: "resnetv22_pool1_fwd"
    op_type: "GlobalAveragePool"
  }
  node {
    input: "resnetv22_pool1_fwd"
    input: "reshape_attr_tensor164"
    output: "resnetv22_flatten0_reshape0"
    name: "resnetv22_flatten0_reshape0"
    op_type: "Reshape"
  }
  node {
    input: "resnetv22_flatten0_reshape0"
    input: "resnetv22_dense0_weight"
    input: "resnetv22_dense0_bias"
    output: "resnetv22_dense0_fwd"
    name: "resnetv22_dense0_fwd"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transA"
      i: 0
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  name: "main"
  initializer {
    dims: 3
    data_type: 1
    float_data: 1.0
    float_data: 1.0
    float_data: 1.0
    name: "resnetv22_batchnorm0_gamma"
  }
  initializer {
    dims: 3
    data_type: 1
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    name: "resnetv22_batchnorm0_beta"
  }
  initializer {
    dims: 3
    data_type: 1
    float_data: -0.15607303
    float_data: -0.14837337
    float_data: -0.13648863
    name: "resnetv22_batchnorm0_running_mean"
  }
  initializer {
    dims: 3
    data_type: 1
    float_data: 1.542072
    float_data: 1.5358735
    float_data: 1.5593406
    name: "resnetv22_batchnorm0_running_var"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.12161005
    float_data: 0.12927283
    float_data: 0.20862499
    float_data: 0.11842525
    float_data: 0.13096176
    float_data: 0.0043981317
    float_data: 0.19710897
    float_data: 0.041798476
    float_data: -1.29086475e-05
    float_data: 0.16887198
    float_data: 0.23483136
    float_data: 0.09894617
    float_data: 0.08647751
    float_data: 0.24984063
    float_data: 0.042403266
    float_data: 0.10663927
    float_data: -1.24452545e-05
    float_data: 0.017024426
    float_data: 0.15558867
    float_data: 0.12863575
    float_data: 0.10968388
    float_data: 0.11439305
    float_data: 0.24418685
    float_data: 7.621539e-05
    float_data: -9.474011e-05
    float_data: 0.12936755
    float_data: 6.853701e-05
    float_data: 0.15962927
    float_data: 0.09082301
    float_data: 0.09029888
    float_data: 2.8499695e-05
    float_data: 0.111756034
    float_data: 0.20058367
    float_data: 0.07739682
    float_data: 0.19265947
    float_data: 0.037598725
    float_data: 0.22257553
    float_data: 0.05116605
    float_data: 0.054625604
    float_data: 0.10840834
    float_data: 0.10124791
    float_data: 0.16901468
    float_data: 0.019388037
    float_data: 0.04179808
    float_data: 0.0003561412
    float_data: 0.16736387
    float_data: 0.0024520115
    float_data: 0.032614496
    float_data: 0.11623694
    float_data: 0.11406563
    float_data: 0.019909285
    float_data: 0.081340134
    float_data: 0.16150682
    float_data: 0.34485596
    float_data: 0.036543336
    float_data: 0.21219705
    float_data: 0.392473
    float_data: 0.0015696621
    float_data: -0.0008414757
    float_data: 0.091491014
    float_data: 0.07348608
    float_data: 0.16115175
    float_data: 0.31519413
    float_data: 0.3204001
    name: "resnetv22_batchnorm1_gamma"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.294332
    float_data: -9.739225e-06
    float_data: 0.27838597
    float_data: 0.14882427
    float_data: 0.20015445
    float_data: -0.047153063
    float_data: 0.193828
    float_data: 0.07577479
    float_data: -0.00013134429
    float_data: 0.4097783
    float_data: 0.31113803
    float_data: 0.11740739
    float_data: 0.1463023
    float_data: 0.047646675
    float_data: 0.22848472
    float_data: 0.09151693
    float_data: -0.00017243918
    float_data: 0.092098005
    float_data: 0.2948133
    float_data: 0.07148153
    float_data: 0.17230487
    float_data: 0.1343211
    float_data: 0.31800961
    float_data: -0.00023117548
    float_data: -0.000434902
    float_data: -0.016593678
    float_data: -0.00031200366
    float_data: 0.2048659
    float_data: 0.08543699
    float_data: 0.11610014
    float_data: -0.00043649523
    float_data: 0.11981441
    float_data: 0.18011513
    float_data: 0.08953567
    float_data: 0.047971793
    float_data: 0.017523466
    float_data: 0.35007167
    float_data: 0.058166146
    float_data: 0.12201352
    float_data: 0.095909655
    float_data: 0.04684238
    float_data: 0.019170715
    float_data: 0.09845991
    float_data: 0.0050576176
    float_data: -0.013857594
    float_data: 0.15905716
    float_data: -0.010892606
    float_data: 0.0666737
    float_data: 0.1028658
    float_data: 0.0011555027
    float_data: 0.14394964
    float_data: 0.14667273
    float_data: 0.10849338
    float_data: 0.57856673
    float_data: -0.16614176
    float_data: 0.18185097
    float_data: 0.51542073
    float_data: -0.016452221
    float_data: -0.0027337982
    float_data: 0.075834446
    float_data: 0.12424922
    float_data: 0.2509394
    float_data: 0.3994427
    float_data: -0.14831208
    name: "resnetv22_batchnorm1_beta"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: -0.0018844559
    float_data: -0.00035202148
    float_data: -0.0005478894
    float_data: -0.0010989081
    float_data: -0.0005624747
    float_data: 0.00019260723
    float_data: 0.00067040516
    float_data: 0.000119813594
    float_data: 1.5569091e-07
    float_data: -0.00031861197
    float_data: -0.0020876776
    float_data: 0.00091018097
    float_data: 0.0004924238
    float_data: -7.035274e-05
    float_data: 9.729684e-06
    float_data: 2.1002586e-05
    float_data: -3.4231144e-07
    float_data: -0.00018191659
    float_data: -0.0003531709
    float_data: -0.0005663748
    float_data: -0.00023632635
    float_data: 0.00024385133
    float_data: 0.00045767063
    float_data: 8.790237e-07
    float_data: -1.2298083e-06
    float_data: 0.000196646
    float_data: 4.788514e-07
    float_data: -0.0003061318
    float_data: 0.0013785289
    float_data: 0.00032772135
    float_data: 3.1039872e-07
    float_data: -0.000833637
    float_data: -0.00044982572
    float_data: 0.00044592482
    float_data: 0.0063213604
    float_data: 0.0007521441
    float_data: -0.0004387193
    float_data: 9.192983e-06
    float_data: -0.00030966947
    float_data: -2.8056425e-05
    float_data: 0.0005026055
    float_data: -0.0025973995
    float_data: -0.000508418
    float_data: 2.7893086e-05
    float_data: -4.1252613e-05
    float_data: 0.0012228469
    float_data: -2.0399107e-06
    float_data: 0.00067375554
    float_data: 0.0004957314
    float_data: 0.00045143257
    float_data: 0.0042609777
    float_data: -0.0021763316
    float_data: -0.0013837887
    float_data: -4.254316e-05
    float_data: 0.00047273072
    float_data: 0.00066328107
    float_data: -8.454274e-05
    float_data: 7.904868e-05
    float_data: 9.9691515e-06
    float_data: -0.007301094
    float_data: 0.0011141538
    float_data: 0.003666379
    float_data: -0.0006989434
    float_data: 0.00021315845
    name: "resnetv22_batchnorm1_running_mean"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 4.7981367
    float_data: 0.9287654
    float_data: 0.41275683
    float_data: 0.54747546
    float_data: 1.2456841
    float_data: 0.10442987
    float_data: 0.5991041
    float_data: 2.4517498
    float_data: 6.6101285e-07
    float_data: 1.9908191
    float_data: 2.0564823
    float_data: 0.775415
    float_data: 0.26075628
    float_data: 0.50035775
    float_data: 1.4916855
    float_data: 1.2720472
    float_data: 1.8669026e-06
    float_data: 1.0605881
    float_data: 1.3140156
    float_data: 3.2454224
    float_data: 1.2619226
    float_data: 0.74364835
    float_data: 4.759158
    float_data: 2.2745257e-06
    float_data: 8.458777e-06
    float_data: 4.147508
    float_data: 2.330763e-06
    float_data: 1.3447542
    float_data: 1.485026
    float_data: 0.96746737
    float_data: 5.0486206e-06
    float_data: 0.23167947
    float_data: 0.5783889
    float_data: 1.2880268
    float_data: 7.9163184
    float_data: 2.835536
    float_data: 1.1105043
    float_data: 1.0263788
    float_data: 0.21038897
    float_data: 1.0360286
    float_data: 1.6027751
    float_data: 2.52261
    float_data: 1.4118798
    float_data: 1.7561995
    float_data: 0.0076235905
    float_data: 0.51009977
    float_data: 0.007385129
    float_data: 1.1784055
    float_data: 2.3560915
    float_data: 0.89034337
    float_data: 7.084718
    float_data: 1.8836119
    float_data: 9.1452
    float_data: 1.76346
    float_data: 1.5605417
    float_data: 0.48610643
    float_data: 3.5110962
    float_data: 0.015073132
    float_data: 0.00058210624
    float_data: 10.146055
    float_data: 4.2148547
    float_data: 5.1796436
    float_data: 2.652533
    float_data: 5.6663456
    name: "resnetv22_batchnorm1_running_var"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.2681153
    float_data: 0.30625376
    float_data: 0.25815752
    float_data: 0.2644607
    float_data: 0.34530684
    float_data: 0.033385504
    float_data: 0.20744076
    float_data: 0.28963855
    float_data: 0.0001334423
    float_data: 0.30146992
    float_data: 0.30310008
    float_data: 0.2897263
    float_data: 0.20728622
    float_data: 0.24254492
    float_data: 0.30057618
    float_data: 0.26316467
    float_data: 0.00013488567
    float_data: 0.28401184
    float_data: 0.21806046
    float_data: 0.23055717
    float_data: 0.27539852
    float_data: 0.27485096
    float_data: 0.33592933
    float_data: 0.00017214635
    float_data: 0.0002389536
    float_data: 0.39162982
    float_data: 0.0001699673
    float_data: 0.2904807
    float_data: 0.31596544
    float_data: 0.28128532
    float_data: 0.00029228034
    float_data: 0.23276712
    float_data: 0.27290848
    float_data: 0.26366165
    float_data: 0.26085445
    float_data: 0.31896576
    float_data: 0.2446209
    float_data: 0.32974425
    float_data: 0.25033224
    float_data: 0.2887324
    float_data: 0.27484503
    float_data: 0.28234434
    float_data: 0.2842954
    float_data: 0.21264127
    float_data: 0.009914787
    float_data: 0.25072908
    float_data: 0.010129235
    float_data: 0.32469213
    float_data: 0.29982588
    float_data: 0.29599607
    float_data: 0.28644595
    float_data: 0.29402566
    float_data: 0.30053642
    float_data: 0.22935307
    float_data: 0.19914365
    float_data: 0.30318165
    float_data: 0.28887522
    float_data: 0.010454316
    float_data: 0.0030210135
    float_data: 0.32149717
    float_data: 0.28762093
    float_data: 0.29473403
    float_data: 0.3164856
    float_data: 0.4059842
    name: "resnetv22_stage1_batchnorm0_gamma"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.54934424
    float_data: 0.2205831
    float_data: -0.17592968
    float_data: 0.34602207
    float_data: -0.43609092
    float_data: -0.050334867
    float_data: -0.066265434
    float_data: 0.38106826
    float_data: -0.00020132735
    float_data: 0.46218845
    float_data: -0.26104346
    float_data: 0.3213592
    float_data: 0.2825882
    float_data: 0.20017742
    float_data: 0.019801706
    float_data: 0.26909348
    float_data: -0.00021469823
    float_data: 0.41602203
    float_data: 0.28940508
    float_data: 0.0945111
    float_data: 0.45253608
    float_data: 0.3401945
    float_data: 0.43313506
    float_data: -0.00025714925
    float_data: -0.00049940456
    float_data: -0.41543916
    float_data: -0.00027025377
    float_data: 0.4326983
    float_data: 0.3193463
    float_data: 0.28638104
    float_data: -0.00045375244
    float_data: 0.26547214
    float_data: 0.27407694
    float_data: 0.37672237
    float_data: 0.2564113
    float_data: -0.13559295
    float_data: 0.50779694
    float_data: -0.062213384
    float_data: 0.25709116
    float_data: 0.25629178
    float_data: 0.2484927
    float_data: 0.2478337
    float_data: 0.48339486
    float_data: -0.016179092
    float_data: -0.015116393
    float_data: 0.22698748
    float_data: -0.015478862
    float_data: 0.30974972
    float_data: 0.35543853
    float_data: 0.2015898
    float_data: 0.6553285
    float_data: 0.44564632
    float_data: 0.21859482
    float_data: -0.12511887
    float_data: -0.27517724
    float_data: -0.111447036
    float_data: 0.43337676
    float_data: -0.011581669
    float_data: 0.641602
    float_data: 0.27332017
    float_data: 0.25621018
    float_data: 0.5080257
    float_data: -0.2867789
    float_data: -0.5707682
    name: "resnetv22_stage1_batchnorm0_beta"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.36340556
    float_data: 0.096042864
    float_data: 0.39753914
    float_data: 0.24891141
    float_data: 0.24277903
    float_data: 5.60519e-45
    float_data: 0.30972257
    float_data: 0.105648264
    float_data: 5.60519e-45
    float_data: 0.44868684
    float_data: 0.44213
    float_data: 0.20996484
    float_data: 0.2067622
    float_data: 0.2605471
    float_data: 0.2388911
    float_data: 0.1746355
    float_data: 5.60519e-45
    float_data: 0.1060575
    float_data: 0.3764261
    float_data: 0.11166145
    float_data: 0.26630276
    float_data: 0.23666136
    float_data: 0.37020656
    float_data: 5.60519e-45
    float_data: 5.60519e-45
    float_data: 0.06002083
    float_data: 5.60519e-45
    float_data: 0.33991253
    float_data: 0.15463182
    float_data: 0.20216408
    float_data: 5.60519e-45
    float_data: 0.20924579
    float_data: 0.3647264
    float_data: 0.15378565
    float_data: 0.1780826
    float_data: 0.03267851
    float_data: 0.42039317
    float_data: 0.079602316
    float_data: 0.16145945
    float_data: 0.19542672
    float_data: 0.12524004
    float_data: 0.14246309
    float_data: 0.112889215
    float_data: 0.023282398
    float_data: 5.60519e-45
    float_data: 0.29242954
    float_data: 5.60519e-45
    float_data: 0.09334012
    float_data: 0.19296685
    float_data: 0.08459624
    float_data: 0.1529338
    float_data: 0.20535636
    float_data: 0.20900384
    float_data: 0.6684127
    float_data: 5.60519e-45
    float_data: 0.3713263
    float_data: 0.6056326
    float_data: 5.60519e-45
    float_data: 5.60519e-45
    float_data: 0.13344514
    float_data: 0.1729857
    float_data: 0.33945483
    float_data: 0.5737418
    float_data: 0.09021831
    name: "resnetv22_stage1_batchnorm0_running_mean"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.015324698
    float_data: 0.026885033
    float_data: 0.049223013
    float_data: 0.023730038
    float_data: 0.018297726
    float_data: 5.60519e-45
    float_data: 0.04741644
    float_data: 0.0023220063
    float_data: 5.60519e-45
    float_data: 0.025399672
    float_data: 0.06028025
    float_data: 0.016802272
    float_data: 0.008919716
    float_data: 0.119077094
    float_data: 0.0017227576
    float_data: 0.015987156
    float_data: 5.60519e-45
    float_data: 0.00043399763
    float_data: 0.02486796
    float_data: 0.008025536
    float_data: 0.018469116
    float_data: 0.023279622
    float_data: 0.058810413
    float_data: 5.60519e-45
    float_data: 5.60519e-45
    float_data: 0.0045044404
    float_data: 5.60519e-45
    float_data: 0.03770325
    float_data: 0.01198712
    float_data: 0.014414589
    float_data: 5.60519e-45
    float_data: 0.019147426
    float_data: 0.07691373
    float_data: 0.008699001
    float_data: 0.037828136
    float_data: 0.0006762144
    float_data: 0.03513927
    float_data: 0.0020801625
    float_data: 0.004789731
    float_data: 0.020764524
    float_data: 0.014889872
    float_data: 0.03315746
    float_data: 0.00047611017
    float_data: 0.00056842365
    float_data: 5.60519e-45
    float_data: 0.051360674
    float_data: 5.60519e-45
    float_data: 0.0017058994
    float_data: 0.017272761
    float_data: 0.020875905
    float_data: 0.00039024
    float_data: 0.008665621
    float_data: 0.028478423
    float_data: 0.08814791
    float_data: 5.60519e-45
    float_data: 0.07465827
    float_data: 0.16512358
    float_data: 5.60519e-45
    float_data: 5.60519e-45
    float_data: 0.009728373
    float_data: 0.0066789687
    float_data: 0.029406805
    float_data: 0.11056151
    float_data: 0.01455902
    name: "resnetv22_stage1_batchnorm0_running_var"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: 0.41045403
    float_data: 0.16740547
    float_data: 0.25203744
    float_data: 0.1897123
    float_data: 0.25899982
    float_data: 0.26822552
    float_data: 0.15577298
    float_data: 0.32271767
    float_data: 0.2038263
    float_data: 0.6037469
    float_data: 0.4561227
    float_data: 0.17013977
    float_data: 0.21707903
    float_data: 0.30942872
    float_data: 0.20230053
    float_data: 0.18489231
    float_data: 0.19185556
    float_data: 0.23523296
    float_data: 0.26200977
    float_data: 0.33345172
    float_data: 0.2058364
    float_data: 0.5802986
    float_data: 0.24184932
    float_data: 0.16454296
    float_data: 0.19440077
    float_data: 0.1912981
    float_data: 0.34658572
    float_data: 0.21988133
    float_data: 0.2854574
    float_data: 0.2305255
    float_data: 0.49291846
    float_data: 0.6597844
    float_data: 0.18812296
    float_data: 0.1644031
    float_data: 0.3391732
    float_data: 0.71437734
    float_data: 0.16607547
    float_data: 0.4310305
    float_data: 0.642772
    float_data: 0.28257677
    float_data: 0.37949657
    float_data: 0.55512327
    float_data: 0.27574858
    float_data: 0.16882533
    float_data: 0.40108374
    float_data: 0.6207052
    float_data: 0.25572062
    float_data: 0.4784581
    float_data: 0.31510922
    float_data: 0.30696642
    float_data: 0.21775511
    float_data: 0.29820922
    float_data: 0.18237875
    float_data: 0.6968477
    float_data: 0.21141163
    float_data: 0.19152178
    float_data: 0.37705344
    float_data: 0.22963789
    float_data: 0.44738194
    float_data: 0.48466158
    float_data: 0.16600762
    float_data: 0.21071003
    float_data: 0.47880363
    float_data: 0.2744827
    name: "resnetv22_stage1_batchnorm1_gamma"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: -0.11121362
    float_data: 0.15874392
    float_data: -0.5545786
    float_data: 0.14173521
    float_data: -0.11209409
    float_data: 0.14156187
    float_data: -0.03669704
    float_data: -0.0025513656
    float_data: 0.09848415
    float_data: -0.30895364
    float_data: -0.21395971
    float_data: -0.00017527353
    float_data: 0.061794315
    float_data: -0.017122105
    float_data: 0.17293312
    float_data: 0.13482608
    float_data: 0.018721594
    float_data: 0.058665328
    float_data: 0.09050023
    float_data: 0.048786454
    float_data: -0.024783982
    float_data: -0.173913
    float_data: 0.0859147
    float_data: 0.07067571
    float_data: 0.071634896
    float_data: 0.07578155
    float_data: -0.009426963
    float_data: 0.043508198
    float_data: 0.024971383
    float_data: 0.12145554
    float_data: -0.13232027
    float_data: -0.57284266
    float_data: 0.14428894
    float_data: 0.07117519
    float_data: -0.27743158
    float_data: -0.37652522
    float_data: 0.28887984
    float_data: -0.10848809
    float_data: -0.3200591
    float_data: 0.14232922
    float_data: -0.4703157
    float_data: -0.17499125
    float_data: 0.0036006405
    float_data: 0.11695994
    float_data: -0.05453778
    float_data: -0.28226373
    float_data: -0.020607235
    float_data: -0.21066402
    float_data: -0.010367834
    float_data: 0.17950392
    float_data: 0.23333965
    float_data: -0.07106159
    float_data: 0.086488195
    float_data: -0.3678536
    float_data: -0.029551687
    float_data: 0.061535887
    float_data: -0.5337381
    float_data: 0.1500724
    float_data: -0.1683477
    float_data: -0.07451131
    float_data: 0.2039124
    float_data: 0.04810255
    float_data: -0.15412395
    float_data: 0.10272159
    name: "resnetv22_stage1_batchnorm1_beta"
  }
  initializer {
    dims: 64
    data_type: 1
    float_data: -0.5606821
    float_data: 0.4248972
    float_data: -0.118797585
    float_data: 0.43669647
    float_data: 0.38233683
    float_data: -0.5055919
    float_data: 0.096897155
    float_data: -1.2097785
    float_data: 0.7219329
    float_data: -1.3041848
    float_data: -0.7428618
    float_data: 0.47253448
    float_data: -0.3368746
    float_data: -1.0020676
    float_data: -0.78981256
    float_data: -0.8536587
    float_data: -0.3268559
    float_data: 0.38512933
    float_data: -0.56927806
    float_data: -0.5838566
    float_data: 0.089956544
    float_data: -0.7584485
    float_data: -0.28020197
    float_data: 0.87319505
    float_data: -0.60212815
    float_data: -0.04629028
    float_data: -0.6280818
    float_data: -0.25364482
