ir_version: 6
producer_name: "pytorch"
producer_version: "1.6"
graph {
  node {
    input: "input"
    input: "backbones.ResNet101FPN.features.conv1.weight"
    output: "663"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "663"
    input: "backbones.ResNet101FPN.features.bn1.weight"
    input: "backbones.ResNet101FPN.features.bn1.bias"
    input: "backbones.ResNet101FPN.features.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.bn1.running_var"
    output: "664"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "664"
    output: "665"
    name: "Relu_2"
    op_type: "Relu"
  }
  node {
    input: "665"
    output: "666"
    name: "MaxPool_3"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "666"
    input: "backbones.ResNet101FPN.features.layer1.0.conv1.weight"
    output: "667"
    name: "Conv_4"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "667"
    input: "backbones.ResNet101FPN.features.layer1.0.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer1.0.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer1.0.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.0.bn1.running_var"
    output: "668"
    name: "BatchNormalization_5"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "668"
    output: "669"
    name: "Relu_6"
    op_type: "Relu"
  }
  node {
    input: "669"
    input: "backbones.ResNet101FPN.features.layer1.0.conv2.weight"
    output: "670"
    name: "Conv_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "670"
    input: "backbones.ResNet101FPN.features.layer1.0.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer1.0.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer1.0.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.0.bn2.running_var"
    output: "671"
    name: "BatchNormalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "671"
    output: "672"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "672"
    input: "backbones.ResNet101FPN.features.layer1.0.conv3.weight"
    output: "673"
    name: "Conv_10"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "673"
    input: "backbones.ResNet101FPN.features.layer1.0.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer1.0.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer1.0.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.0.bn3.running_var"
    output: "674"
    name: "BatchNormalization_11"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "666"
    input: "backbones.ResNet101FPN.features.layer1.0.downsample.0.weight"
    output: "675"
    name: "Conv_12"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "675"
    input: "backbones.ResNet101FPN.features.layer1.0.downsample.1.weight"
    input: "backbones.ResNet101FPN.features.layer1.0.downsample.1.bias"
    input: "backbones.ResNet101FPN.features.layer1.0.downsample.1.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.0.downsample.1.running_var"
    output: "676"
    name: "BatchNormalization_13"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "674"
    input: "676"
    output: "677"
    name: "Add_14"
    op_type: "Add"
  }
  node {
    input: "677"
    output: "678"
    name: "Relu_15"
    op_type: "Relu"
  }
  node {
    input: "678"
    input: "backbones.ResNet101FPN.features.layer1.1.conv1.weight"
    output: "679"
    name: "Conv_16"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "679"
    input: "backbones.ResNet101FPN.features.layer1.1.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer1.1.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer1.1.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.1.bn1.running_var"
    output: "680"
    name: "BatchNormalization_17"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "680"
    output: "681"
    name: "Relu_18"
    op_type: "Relu"
  }
  node {
    input: "681"
    input: "backbones.ResNet101FPN.features.layer1.1.conv2.weight"
    output: "682"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "682"
    input: "backbones.ResNet101FPN.features.layer1.1.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer1.1.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer1.1.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.1.bn2.running_var"
    output: "683"
    name: "BatchNormalization_20"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "683"
    output: "684"
    name: "Relu_21"
    op_type: "Relu"
  }
  node {
    input: "684"
    input: "backbones.ResNet101FPN.features.layer1.1.conv3.weight"
    output: "685"
    name: "Conv_22"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "685"
    input: "backbones.ResNet101FPN.features.layer1.1.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer1.1.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer1.1.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.1.bn3.running_var"
    output: "686"
    name: "BatchNormalization_23"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "686"
    input: "678"
    output: "687"
    name: "Add_24"
    op_type: "Add"
  }
  node {
    input: "687"
    output: "688"
    name: "Relu_25"
    op_type: "Relu"
  }
  node {
    input: "688"
    input: "backbones.ResNet101FPN.features.layer1.2.conv1.weight"
    output: "689"
    name: "Conv_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "689"
    input: "backbones.ResNet101FPN.features.layer1.2.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer1.2.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer1.2.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.2.bn1.running_var"
    output: "690"
    name: "BatchNormalization_27"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "690"
    output: "691"
    name: "Relu_28"
    op_type: "Relu"
  }
  node {
    input: "691"
    input: "backbones.ResNet101FPN.features.layer1.2.conv2.weight"
    output: "692"
    name: "Conv_29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "692"
    input: "backbones.ResNet101FPN.features.layer1.2.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer1.2.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer1.2.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.2.bn2.running_var"
    output: "693"
    name: "BatchNormalization_30"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "693"
    output: "694"
    name: "Relu_31"
    op_type: "Relu"
  }
  node {
    input: "694"
    input: "backbones.ResNet101FPN.features.layer1.2.conv3.weight"
    output: "695"
    name: "Conv_32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "695"
    input: "backbones.ResNet101FPN.features.layer1.2.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer1.2.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer1.2.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer1.2.bn3.running_var"
    output: "696"
    name: "BatchNormalization_33"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "696"
    input: "688"
    output: "697"
    name: "Add_34"
    op_type: "Add"
  }
  node {
    input: "697"
    output: "698"
    name: "Relu_35"
    op_type: "Relu"
  }
  node {
    input: "698"
    input: "backbones.ResNet101FPN.features.layer2.0.conv1.weight"
    output: "699"
    name: "Conv_36"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "699"
    input: "backbones.ResNet101FPN.features.layer2.0.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer2.0.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer2.0.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.0.bn1.running_var"
    output: "700"
    name: "BatchNormalization_37"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "700"
    output: "701"
    name: "Relu_38"
    op_type: "Relu"
  }
  node {
    input: "701"
    input: "backbones.ResNet101FPN.features.layer2.0.conv2.weight"
    output: "702"
    name: "Conv_39"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "702"
    input: "backbones.ResNet101FPN.features.layer2.0.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer2.0.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer2.0.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.0.bn2.running_var"
    output: "703"
    name: "BatchNormalization_40"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "703"
    output: "704"
    name: "Relu_41"
    op_type: "Relu"
  }
  node {
    input: "704"
    input: "backbones.ResNet101FPN.features.layer2.0.conv3.weight"
    output: "705"
    name: "Conv_42"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "705"
    input: "backbones.ResNet101FPN.features.layer2.0.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer2.0.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer2.0.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.0.bn3.running_var"
    output: "706"
    name: "BatchNormalization_43"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "698"
    input: "backbones.ResNet101FPN.features.layer2.0.downsample.0.weight"
    output: "707"
    name: "Conv_44"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "707"
    input: "backbones.ResNet101FPN.features.layer2.0.downsample.1.weight"
    input: "backbones.ResNet101FPN.features.layer2.0.downsample.1.bias"
    input: "backbones.ResNet101FPN.features.layer2.0.downsample.1.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.0.downsample.1.running_var"
    output: "708"
    name: "BatchNormalization_45"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "706"
    input: "708"
    output: "709"
    name: "Add_46"
    op_type: "Add"
  }
  node {
    input: "709"
    output: "710"
    name: "Relu_47"
    op_type: "Relu"
  }
  node {
    input: "710"
    input: "backbones.ResNet101FPN.features.layer2.1.conv1.weight"
    output: "711"
    name: "Conv_48"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "711"
    input: "backbones.ResNet101FPN.features.layer2.1.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer2.1.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer2.1.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.1.bn1.running_var"
    output: "712"
    name: "BatchNormalization_49"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "712"
    output: "713"
    name: "Relu_50"
    op_type: "Relu"
  }
  node {
    input: "713"
    input: "backbones.ResNet101FPN.features.layer2.1.conv2.weight"
    output: "714"
    name: "Conv_51"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "714"
    input: "backbones.ResNet101FPN.features.layer2.1.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer2.1.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer2.1.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.1.bn2.running_var"
    output: "715"
    name: "BatchNormalization_52"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "715"
    output: "716"
    name: "Relu_53"
    op_type: "Relu"
  }
  node {
    input: "716"
    input: "backbones.ResNet101FPN.features.layer2.1.conv3.weight"
    output: "717"
    name: "Conv_54"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "717"
    input: "backbones.ResNet101FPN.features.layer2.1.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer2.1.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer2.1.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.1.bn3.running_var"
    output: "718"
    name: "BatchNormalization_55"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "718"
    input: "710"
    output: "719"
    name: "Add_56"
    op_type: "Add"
  }
  node {
    input: "719"
    output: "720"
    name: "Relu_57"
    op_type: "Relu"
  }
  node {
    input: "720"
    input: "backbones.ResNet101FPN.features.layer2.2.conv1.weight"
    output: "721"
    name: "Conv_58"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "721"
    input: "backbones.ResNet101FPN.features.layer2.2.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer2.2.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer2.2.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.2.bn1.running_var"
    output: "722"
    name: "BatchNormalization_59"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "722"
    output: "723"
    name: "Relu_60"
    op_type: "Relu"
  }
  node {
    input: "723"
    input: "backbones.ResNet101FPN.features.layer2.2.conv2.weight"
    output: "724"
    name: "Conv_61"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "724"
    input: "backbones.ResNet101FPN.features.layer2.2.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer2.2.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer2.2.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.2.bn2.running_var"
    output: "725"
    name: "BatchNormalization_62"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "725"
    output: "726"
    name: "Relu_63"
    op_type: "Relu"
  }
  node {
    input: "726"
    input: "backbones.ResNet101FPN.features.layer2.2.conv3.weight"
    output: "727"
    name: "Conv_64"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "727"
    input: "backbones.ResNet101FPN.features.layer2.2.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer2.2.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer2.2.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.2.bn3.running_var"
    output: "728"
    name: "BatchNormalization_65"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "728"
    input: "720"
    output: "729"
    name: "Add_66"
    op_type: "Add"
  }
  node {
    input: "729"
    output: "730"
    name: "Relu_67"
    op_type: "Relu"
  }
  node {
    input: "730"
    input: "backbones.ResNet101FPN.features.layer2.3.conv1.weight"
    output: "731"
    name: "Conv_68"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "731"
    input: "backbones.ResNet101FPN.features.layer2.3.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer2.3.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer2.3.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.3.bn1.running_var"
    output: "732"
    name: "BatchNormalization_69"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "732"
    output: "733"
    name: "Relu_70"
    op_type: "Relu"
  }
  node {
    input: "733"
    input: "backbones.ResNet101FPN.features.layer2.3.conv2.weight"
    output: "734"
    name: "Conv_71"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "734"
    input: "backbones.ResNet101FPN.features.layer2.3.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer2.3.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer2.3.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.3.bn2.running_var"
    output: "735"
    name: "BatchNormalization_72"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "735"
    output: "736"
    name: "Relu_73"
    op_type: "Relu"
  }
  node {
    input: "736"
    input: "backbones.ResNet101FPN.features.layer2.3.conv3.weight"
    output: "737"
    name: "Conv_74"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "737"
    input: "backbones.ResNet101FPN.features.layer2.3.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer2.3.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer2.3.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer2.3.bn3.running_var"
    output: "738"
    name: "BatchNormalization_75"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "738"
    input: "730"
    output: "739"
    name: "Add_76"
    op_type: "Add"
  }
  node {
    input: "739"
    output: "740"
    name: "Relu_77"
    op_type: "Relu"
  }
  node {
    input: "740"
    input: "backbones.ResNet101FPN.features.layer3.0.conv1.weight"
    output: "741"
    name: "Conv_78"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "741"
    input: "backbones.ResNet101FPN.features.layer3.0.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer3.0.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer3.0.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.0.bn1.running_var"
    output: "742"
    name: "BatchNormalization_79"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "742"
    output: "743"
    name: "Relu_80"
    op_type: "Relu"
  }
  node {
    input: "743"
    input: "backbones.ResNet101FPN.features.layer3.0.conv2.weight"
    output: "744"
    name: "Conv_81"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "744"
    input: "backbones.ResNet101FPN.features.layer3.0.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer3.0.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer3.0.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.0.bn2.running_var"
    output: "745"
    name: "BatchNormalization_82"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "745"
    output: "746"
    name: "Relu_83"
    op_type: "Relu"
  }
  node {
    input: "746"
    input: "backbones.ResNet101FPN.features.layer3.0.conv3.weight"
    output: "747"
    name: "Conv_84"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "747"
    input: "backbones.ResNet101FPN.features.layer3.0.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer3.0.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer3.0.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.0.bn3.running_var"
    output: "748"
    name: "BatchNormalization_85"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "740"
    input: "backbones.ResNet101FPN.features.layer3.0.downsample.0.weight"
    output: "749"
    name: "Conv_86"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "749"
    input: "backbones.ResNet101FPN.features.layer3.0.downsample.1.weight"
    input: "backbones.ResNet101FPN.features.layer3.0.downsample.1.bias"
    input: "backbones.ResNet101FPN.features.layer3.0.downsample.1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.0.downsample.1.running_var"
    output: "750"
    name: "BatchNormalization_87"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "748"
    input: "750"
    output: "751"
    name: "Add_88"
    op_type: "Add"
  }
  node {
    input: "751"
    output: "752"
    name: "Relu_89"
    op_type: "Relu"
  }
  node {
    input: "752"
    input: "backbones.ResNet101FPN.features.layer3.1.conv1.weight"
    output: "753"
    name: "Conv_90"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "753"
    input: "backbones.ResNet101FPN.features.layer3.1.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer3.1.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer3.1.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.1.bn1.running_var"
    output: "754"
    name: "BatchNormalization_91"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "754"
    output: "755"
    name: "Relu_92"
    op_type: "Relu"
  }
  node {
    input: "755"
    input: "backbones.ResNet101FPN.features.layer3.1.conv2.weight"
    output: "756"
    name: "Conv_93"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "756"
    input: "backbones.ResNet101FPN.features.layer3.1.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer3.1.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer3.1.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.1.bn2.running_var"
    output: "757"
    name: "BatchNormalization_94"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "757"
    output: "758"
    name: "Relu_95"
    op_type: "Relu"
  }
  node {
    input: "758"
    input: "backbones.ResNet101FPN.features.layer3.1.conv3.weight"
    output: "759"
    name: "Conv_96"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "759"
    input: "backbones.ResNet101FPN.features.layer3.1.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer3.1.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer3.1.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.1.bn3.running_var"
    output: "760"
    name: "BatchNormalization_97"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "760"
    input: "752"
    output: "761"
    name: "Add_98"
    op_type: "Add"
  }
  node {
    input: "761"
    output: "762"
    name: "Relu_99"
    op_type: "Relu"
  }
  node {
    input: "762"
    input: "backbones.ResNet101FPN.features.layer3.2.conv1.weight"
    output: "763"
    name: "Conv_100"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "763"
    input: "backbones.ResNet101FPN.features.layer3.2.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer3.2.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer3.2.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.2.bn1.running_var"
    output: "764"
    name: "BatchNormalization_101"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "764"
    output: "765"
    name: "Relu_102"
    op_type: "Relu"
  }
  node {
    input: "765"
    input: "backbones.ResNet101FPN.features.layer3.2.conv2.weight"
    output: "766"
    name: "Conv_103"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "766"
    input: "backbones.ResNet101FPN.features.layer3.2.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer3.2.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer3.2.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.2.bn2.running_var"
    output: "767"
    name: "BatchNormalization_104"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "767"
    output: "768"
    name: "Relu_105"
    op_type: "Relu"
  }
  node {
    input: "768"
    input: "backbones.ResNet101FPN.features.layer3.2.conv3.weight"
    output: "769"
    name: "Conv_106"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "769"
    input: "backbones.ResNet101FPN.features.layer3.2.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer3.2.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer3.2.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.2.bn3.running_var"
    output: "770"
    name: "BatchNormalization_107"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "770"
    input: "762"
    output: "771"
    name: "Add_108"
    op_type: "Add"
  }
  node {
    input: "771"
    output: "772"
    name: "Relu_109"
    op_type: "Relu"
  }
  node {
    input: "772"
    input: "backbones.ResNet101FPN.features.layer3.3.conv1.weight"
    output: "773"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "773"
    input: "backbones.ResNet101FPN.features.layer3.3.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer3.3.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer3.3.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.3.bn1.running_var"
    output: "774"
    name: "BatchNormalization_111"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "774"
    output: "775"
    name: "Relu_112"
    op_type: "Relu"
  }
  node {
    input: "775"
    input: "backbones.ResNet101FPN.features.layer3.3.conv2.weight"
    output: "776"
    name: "Conv_113"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "776"
    input: "backbones.ResNet101FPN.features.layer3.3.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer3.3.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer3.3.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.3.bn2.running_var"
    output: "777"
    name: "BatchNormalization_114"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "777"
    output: "778"
    name: "Relu_115"
    op_type: "Relu"
  }
  node {
    input: "778"
    input: "backbones.ResNet101FPN.features.layer3.3.conv3.weight"
    output: "779"
    name: "Conv_116"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "779"
    input: "backbones.ResNet101FPN.features.layer3.3.bn3.weight"
    input: "backbones.ResNet101FPN.features.layer3.3.bn3.bias"
    input: "backbones.ResNet101FPN.features.layer3.3.bn3.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.3.bn3.running_var"
    output: "780"
    name: "BatchNormalization_117"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "780"
    input: "772"
    output: "781"
    name: "Add_118"
    op_type: "Add"
  }
  node {
    input: "781"
    output: "782"
    name: "Relu_119"
    op_type: "Relu"
  }
  node {
    input: "782"
    input: "backbones.ResNet101FPN.features.layer3.4.conv1.weight"
    output: "783"
    name: "Conv_120"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "783"
    input: "backbones.ResNet101FPN.features.layer3.4.bn1.weight"
    input: "backbones.ResNet101FPN.features.layer3.4.bn1.bias"
    input: "backbones.ResNet101FPN.features.layer3.4.bn1.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.4.bn1.running_var"
    output: "784"
    name: "BatchNormalization_121"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "784"
    output: "785"
    name: "Relu_122"
    op_type: "Relu"
  }
  node {
    input: "785"
    input: "backbones.ResNet101FPN.features.layer3.4.conv2.weight"
    output: "786"
    name: "Conv_123"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "786"
    input: "backbones.ResNet101FPN.features.layer3.4.bn2.weight"
    input: "backbones.ResNet101FPN.features.layer3.4.bn2.bias"
    input: "backbones.ResNet101FPN.features.layer3.4.bn2.running_mean"
    input: "backbones.ResNet101FPN.features.layer3.4.bn2.running_var"
    output: "787"
    name: "BatchNormalization_124"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
  }
  node {
    input: "787"
    output: "788"
    name: "Relu_125"
    op_type: "Relu"
  }
  node {
    input: "788"
    input: "backbones.ResNet101FPN.features.layer3.4.conv3.weight"
    output: "789"
    name: "Conv_126"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
