ir_version: 7
producer_name: "onnx.quantize"
producer_version: "0.1.0"
graph {
  node {
    input: "input"
    input: "input_scale"
    input: "input_zero_point"
    output: "input_quantized"
    name: "input_Conv_0_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_conv1.0.weight_quantized"
    input: "ConvBnFusion_W_conv1.0.weight_scale"
    input: "ConvBnFusion_W_conv1.0.weight_zero_point"
    output: "ConvBnFusion_W_conv1.0.weight_dequantized"
    name: "ConvBnFusion_W_conv1.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_conv1.1.bias_quantized"
    input: "ConvBnFusion_BN_B_conv1.1.bias_scale"
    input: "ConvBnFusion_BN_B_conv1.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_conv1.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_conv1.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.0.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage2.0.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage2.0.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage2.0.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage2.0.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.0.branch1.0.weight_quantized"
    input: "ConvBnFusion_W_stage2.0.branch1.0.weight_scale"
    input: "ConvBnFusion_W_stage2.0.branch1.0.weight_zero_point"
    output: "ConvBnFusion_W_stage2.0.branch1.0.weight_dequantized"
    name: "ConvBnFusion_W_stage2.0.branch1.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.0.branch1.2.weight_quantized"
    input: "ConvBnFusion_W_stage2.0.branch1.2.weight_scale"
    input: "ConvBnFusion_W_stage2.0.branch1.2.weight_zero_point"
    output: "ConvBnFusion_W_stage2.0.branch1.2.weight_dequantized"
    name: "ConvBnFusion_W_stage2.0.branch1.2.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.0.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage2.0.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage2.0.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage2.0.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage2.0.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.0.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage2.0.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage2.0.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage2.0.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage2.0.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.1.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage2.1.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage2.1.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage2.1.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage2.1.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.1.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.1.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.1.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.1.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage2.1.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage2.1.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage2.1.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage2.1.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.1.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.1.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.1.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.1.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage2.1.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage2.1.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage2.1.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage2.1.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.1.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.1.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.1.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.1.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.2.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage2.2.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage2.2.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage2.2.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage2.2.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.2.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.2.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.2.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.2.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage2.2.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage2.2.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage2.2.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage2.2.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.2.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.2.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.2.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.2.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage2.2.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage2.2.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage2.2.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage2.2.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.2.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.2.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.2.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.2.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.3.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage2.3.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage2.3.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage2.3.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage2.3.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.3.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.3.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.3.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.3.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage2.3.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage2.3.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage2.3.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage2.3.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.3.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.3.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.3.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage2.3.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage2.3.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage2.3.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage2.3.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage2.3.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage2.3.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage2.3.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage2.3.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage2.3.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.0.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.0.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.0.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.0.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.0.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.0.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.0.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.0.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.0.branch1.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.0.branch1.0.weight_scale"
    input: "ConvBnFusion_W_stage3.0.branch1.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.0.branch1.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.0.branch1.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.0.branch1.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.0.branch1.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.0.branch1.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.0.branch1.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.0.branch1.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.0.branch1.2.weight_quantized"
    input: "ConvBnFusion_W_stage3.0.branch1.2.weight_scale"
    input: "ConvBnFusion_W_stage3.0.branch1.2.weight_zero_point"
    output: "ConvBnFusion_W_stage3.0.branch1.2.weight_dequantized"
    name: "ConvBnFusion_W_stage3.0.branch1.2.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.0.branch1.3.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.0.branch1.3.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.0.branch1.3.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.0.branch1.3.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.0.branch1.3.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.0.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.0.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.0.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.0.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.0.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.0.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.0.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.0.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.0.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.0.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.0.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.0.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.0.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.0.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.0.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.0.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.0.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.1.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.1.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.1.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.1.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.1.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.1.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.1.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.1.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.1.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.1.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.1.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.1.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.1.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.1.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.1.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.1.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.1.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.1.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.1.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.1.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.1.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.1.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.1.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.1.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.1.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.2.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.2.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.2.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.2.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.2.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.2.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.2.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.2.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.2.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.2.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.2.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.2.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.2.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.2.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.2.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.2.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.2.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.2.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.2.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.2.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.2.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.2.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.2.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.2.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.2.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.3.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.3.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.3.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.3.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.3.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.3.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.3.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.3.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.3.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.3.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.3.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.3.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.3.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.3.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.3.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.3.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.3.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.3.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.3.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.3.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.3.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.3.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.3.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.3.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.3.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.4.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.4.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.4.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.4.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.4.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.4.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.4.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.4.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.4.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.4.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.4.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.4.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.4.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.4.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.4.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.4.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.4.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.4.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.4.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.4.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.4.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.4.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.4.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.4.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.4.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.5.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.5.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.5.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.5.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.5.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.5.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.5.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.5.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.5.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.5.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.5.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.5.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.5.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.5.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.5.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.5.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.5.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.5.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.5.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.5.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.5.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.5.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.5.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.5.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.5.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.6.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.6.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.6.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.6.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.6.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.6.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.6.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.6.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.6.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.6.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.6.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.6.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.6.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.6.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.6.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.6.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.6.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.6.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.6.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.6.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.6.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.6.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.6.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.6.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.6.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.7.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage3.7.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage3.7.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage3.7.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage3.7.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.7.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.7.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.7.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.7.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage3.7.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage3.7.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage3.7.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage3.7.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.7.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.7.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.7.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage3.7.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage3.7.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage3.7.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage3.7.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage3.7.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage3.7.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage3.7.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage3.7.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage3.7.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.0.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage4.0.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage4.0.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage4.0.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage4.0.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.0.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.0.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.0.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.0.branch1.0.weight_quantized"
    input: "ConvBnFusion_W_stage4.0.branch1.0.weight_scale"
    input: "ConvBnFusion_W_stage4.0.branch1.0.weight_zero_point"
    output: "ConvBnFusion_W_stage4.0.branch1.0.weight_dequantized"
    name: "ConvBnFusion_W_stage4.0.branch1.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.0.branch1.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.0.branch1.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.0.branch1.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.0.branch1.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.0.branch1.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.0.branch1.2.weight_quantized"
    input: "ConvBnFusion_W_stage4.0.branch1.2.weight_scale"
    input: "ConvBnFusion_W_stage4.0.branch1.2.weight_zero_point"
    output: "ConvBnFusion_W_stage4.0.branch1.2.weight_dequantized"
    name: "ConvBnFusion_W_stage4.0.branch1.2.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.0.branch1.3.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.0.branch1.3.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.0.branch1.3.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.0.branch1.3.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.0.branch1.3.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.0.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage4.0.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage4.0.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage4.0.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage4.0.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.0.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.0.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.0.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.0.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage4.0.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage4.0.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage4.0.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage4.0.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.0.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.0.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.0.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.0.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.1.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage4.1.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage4.1.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage4.1.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage4.1.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.1.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.1.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.1.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.1.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage4.1.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage4.1.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage4.1.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage4.1.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.1.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.1.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.1.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.1.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage4.1.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage4.1.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage4.1.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage4.1.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.1.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.1.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.1.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.1.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.2.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage4.2.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage4.2.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage4.2.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage4.2.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.2.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.2.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.2.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.2.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage4.2.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage4.2.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage4.2.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage4.2.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.2.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.2.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.2.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.2.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage4.2.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage4.2.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage4.2.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage4.2.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.2.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.2.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.2.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.2.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.3.branch2.0.weight_quantized"
    input: "ConvBnFusion_W_stage4.3.branch2.0.weight_scale"
    input: "ConvBnFusion_W_stage4.3.branch2.0.weight_zero_point"
    output: "ConvBnFusion_W_stage4.3.branch2.0.weight_dequantized"
    name: "ConvBnFusion_W_stage4.3.branch2.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.3.branch2.1.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.1.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.3.branch2.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.3.branch2.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.3.branch2.3.weight_quantized"
    input: "ConvBnFusion_W_stage4.3.branch2.3.weight_scale"
    input: "ConvBnFusion_W_stage4.3.branch2.3.weight_zero_point"
    output: "ConvBnFusion_W_stage4.3.branch2.3.weight_dequantized"
    name: "ConvBnFusion_W_stage4.3.branch2.3.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.3.branch2.4.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.4.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.4.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.3.branch2.4.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.3.branch2.4.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_stage4.3.branch2.5.weight_quantized"
    input: "ConvBnFusion_W_stage4.3.branch2.5.weight_scale"
    input: "ConvBnFusion_W_stage4.3.branch2.5.weight_zero_point"
    output: "ConvBnFusion_W_stage4.3.branch2.5.weight_dequantized"
    name: "ConvBnFusion_W_stage4.3.branch2.5.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_stage4.3.branch2.6.bias_quantized"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.6.bias_scale"
    input: "ConvBnFusion_BN_B_stage4.3.branch2.6.bias_zero_point"
    output: "ConvBnFusion_BN_B_stage4.3.branch2.6.bias_dequantized"
    name: "ConvBnFusion_BN_B_stage4.3.branch2.6.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_W_conv5.0.weight_quantized"
    input: "ConvBnFusion_W_conv5.0.weight_scale"
    input: "ConvBnFusion_W_conv5.0.weight_zero_point"
    output: "ConvBnFusion_W_conv5.0.weight_dequantized"
    name: "ConvBnFusion_W_conv5.0.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "ConvBnFusion_BN_B_conv5.1.bias_quantized"
    input: "ConvBnFusion_BN_B_conv5.1.bias_scale"
    input: "ConvBnFusion_BN_B_conv5.1.bias_zero_point"
    output: "ConvBnFusion_BN_B_conv5.1.bias_dequantized"
    name: "ConvBnFusion_BN_B_conv5.1.bias_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "fc.weight_quantized"
    input: "fc.weight_scale"
    input: "fc.weight_zero_point"
    output: "fc.weight_dequantized"
    name: "fc.weight_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "input_quantized"
    input: "input_scale"
    input: "input_zero_point"
    output: "input_dequantized"
    name: "input_Conv_0_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "input_dequantized"
    input: "ConvBnFusion_W_conv1.0.weight_dequantized"
    input: "ConvBnFusion_BN_B_conv1.1.bias_dequantized"
    output: "340_QuantizeInput"
    name: "Conv_0_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "340_QuantizeInput"
    input: "340_scale"
    input: "340_zero_point"
    output: "340_quantized"
    name: "340_Conv_0_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "340_quantized"
    input: "340_scale"
    input: "340_zero_point"
    output: "340_MaxPool_3_dequantized"
    name: "340_MaxPool_3_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "340_MaxPool_3_dequantized"
    output: "342_QuantizeInput"
    name: "MaxPool_3_quant"
    op_type: "MaxPool"
    attribute {
      name: "storage_order"
      i: 0
      type: INT
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "342_QuantizeInput"
    input: "340_scale"
    input: "340_zero_point"
    output: "342_quantized"
    name: "342_MaxPool_3_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "342_quantized"
    input: "340_scale"
    input: "340_zero_point"
    output: "342_Conv_9_dequantized"
    name: "342_Conv_9_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "342_Conv_9_dequantized"
    input: "ConvBnFusion_W_stage2.0.branch2.0.weight_dequantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.1.bias_dequantized"
    output: "349_QuantizeInput"
    name: "Conv_9_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "342_Conv_9_dequantized"
    input: "ConvBnFusion_W_stage2.0.branch1.0.weight_dequantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.1.bias_dequantized"
    output: "344_QuantizeInput"
    name: "Conv_4_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 24
      type: INT
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "349_QuantizeInput"
    input: "349_scale"
    input: "349_zero_point"
    output: "349_quantized"
    name: "349_Conv_9_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "344_QuantizeInput"
    input: "344_scale"
    input: "344_zero_point"
    output: "344_quantized"
    name: "344_Conv_4_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "349_quantized"
    input: "349_scale"
    input: "349_zero_point"
    output: "349_Conv_12_dequantized"
    name: "349_Conv_12_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "344_quantized"
    input: "344_scale"
    input: "344_zero_point"
    output: "344_Conv_6_dequantized"
    name: "344_Conv_6_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "349_Conv_12_dequantized"
    input: "ConvBnFusion_W_stage2.0.branch2.3.weight_dequantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.4.bias_dequantized"
    output: "352_QuantizeInput"
    name: "Conv_12_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 58
      type: INT
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "344_Conv_6_dequantized"
    input: "ConvBnFusion_W_stage2.0.branch1.2.weight_dequantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch1.3.bias_dequantized"
    output: "346_QuantizeInput"
    name: "Conv_6_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "352_QuantizeInput"
    input: "352_scale"
    input: "352_zero_point"
    output: "352_quantized"
    name: "352_Conv_12_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "346_QuantizeInput"
    input: "346_scale"
    input: "346_zero_point"
    output: "346_quantized"
    name: "346_Conv_6_QuantizeLinear"
    op_type: "QuantizeLinear"
  }
  node {
    input: "352_quantized"
    input: "352_scale"
    input: "352_zero_point"
    output: "352_Conv_14_dequantized"
    name: "352_Conv_14_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "346_quantized"
    input: "346_scale"
    input: "346_zero_point"
    output: "346_Concat_17_dequantized"
    name: "346_Concat_17_DequantizeLinear"
    op_type: "DequantizeLinear"
  }
  node {
    input: "352_Conv_14_dequantized"
    input: "ConvBnFusion_W_stage2.0.branch2.5.weight_dequantized"
    input: "ConvBnFusion_BN_B_stage2.0.branch2.6.bias_dequantized"
    output: "354_QuantizeInput"
    name: "Conv_14_quant"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
