ir_version: 6
producer_name: "pytorch"
producer_version: "1.6"
graph {
  node {
    input: "input_ids"
    output: "162"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "163"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "162"
    input: "163"
    output: "164"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "input_ids"
    output: "165"
    name: "Shape_3"
    op_type: "Shape"
  }
  node {
    output: "166"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "165"
    input: "166"
    output: "167"
    name: "Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "167"
    output: "170"
    name: "Unsqueeze_6"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "2034"
    input: "170"
    output: "171"
    name: "Concat_7"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "input_ids"
    input: "171"
    output: "172"
    name: "Reshape_8"
    op_type: "Reshape"
  }
  node {
    input: "decoder.embed_tokens.weight"
    input: "172"
    output: "173"
    name: "Gather_9"
    op_type: "Gather"
  }
  node {
    input: "164"
    output: "174"
    name: "Unsqueeze_10"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "167"
    output: "175"
    name: "Unsqueeze_11"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "174"
    input: "175"
    output: "176"
    name: "Concat_12"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "176"
    output: "177"
    name: "ConstantOfShape_13"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "177"
    output: "178"
    name: "Cast_14"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "encoder_hidden_states"
    output: "179"
    name: "Shape_15"
    op_type: "Shape"
  }
  node {
    output: "180"
    name: "Constant_16"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "179"
    input: "180"
    output: "181"
    name: "Gather_17"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "164"
    output: "182"
    name: "Unsqueeze_18"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "181"
    output: "183"
    name: "Unsqueeze_19"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "182"
    input: "183"
    output: "184"
    name: "Concat_20"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "184"
    output: "185"
    name: "ConstantOfShape_21"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "167"
    output: "186"
    name: "Cast_22"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "187"
    name: "Constant_23"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "188"
    name: "Constant_24"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "187"
    input: "186"
    input: "188"
    output: "189"
    name: "Range_25"
    op_type: "Range"
  }
  node {
    input: "189"
    output: "190"
    name: "Unsqueeze_26"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "190"
    output: "191"
    name: "Unsqueeze_27"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "164"
    output: "193"
    name: "Unsqueeze_28"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "167"
    output: "194"
    name: "Unsqueeze_29"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "193"
    input: "194"
    input: "2035"
    output: "196"
    name: "Concat_30"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "191"
    input: "196"
    output: "197"
    name: "Tile_31"
    op_type: "Tile"
  }
  node {
    input: "189"
    output: "198"
    name: "Unsqueeze_32"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "198"
    output: "199"
    name: "Unsqueeze_33"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "197"
    input: "199"
    output: "200"
    name: "LessOrEqual_34"
    op_type: "LessOrEqual"
  }
  node {
    input: "200"
    output: "201"
    name: "Cast_35"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "201"
    output: "202"
    name: "Unsqueeze_36"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "178"
    output: "203"
    name: "Unsqueeze_37"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "203"
    output: "204"
    name: "Unsqueeze_38"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "202"
    input: "204"
    output: "205"
    name: "Mul_39"
    op_type: "Mul"
  }
  node {
    input: "205"
    output: "206"
    name: "Cast_40"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "207"
    name: "Constant_41"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "207"
    input: "206"
    output: "208"
    name: "Sub_42"
    op_type: "Sub"
  }
  node {
    output: "209"
    name: "Constant_43"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000@\034\306"
      }
      type: TENSOR
    }
  }
  node {
    input: "208"
    input: "209"
    output: "210"
    name: "Mul_44"
    op_type: "Mul"
  }
  node {
    input: "185"
    output: "211"
    name: "Unsqueeze_45"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "211"
    output: "212"
    name: "Unsqueeze_46"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "212"
    output: "213"
    name: "Cast_47"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "214"
    name: "Constant_48"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "214"
    input: "213"
    output: "215"
    name: "Sub_49"
    op_type: "Sub"
  }
  node {
    output: "216"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "(kn\316"
      }
      type: TENSOR
    }
  }
  node {
    input: "215"
    input: "216"
    output: "217"
    name: "Mul_51"
    op_type: "Mul"
  }
  node {
    input: "173"
    output: "218"
    name: "Cast_52"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "219"
    name: "Constant_53"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "218"
    input: "219"
    output: "220"
    name: "Pow_54"
    op_type: "Pow"
  }
  node {
    input: "220"
    output: "221"
    name: "ReduceMean_55"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "222"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "221"
    input: "222"
    output: "223"
    name: "Add_57"
    op_type: "Add"
  }
  node {
    input: "223"
    output: "224"
    name: "Sqrt_58"
    op_type: "Sqrt"
  }
  node {
    input: "218"
    input: "224"
    output: "225"
    name: "Div_59"
    op_type: "Div"
  }
  node {
    input: "decoder.block.0.layer.0.layer_norm.weight"
    input: "225"
    output: "226"
    name: "Mul_60"
    op_type: "Mul"
  }
  node {
    input: "226"
    output: "227"
    name: "Shape_61"
    op_type: "Shape"
  }
  node {
    output: "228"
    name: "Constant_62"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "227"
    input: "228"
    output: "229"
    name: "Gather_63"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "226"
    output: "230"
    name: "Shape_64"
    op_type: "Shape"
  }
  node {
    output: "231"
    name: "Constant_65"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "230"
    input: "231"
    output: "232"
    name: "Gather_66"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "226"
    input: "2036"
    output: "234"
    name: "MatMul_67"
    op_type: "MatMul"
  }
  node {
    input: "229"
    output: "238"
    name: "Unsqueeze_68"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "238"
    input: "2037"
    input: "2038"
    input: "2039"
    output: "242"
    name: "Concat_69"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "234"
    input: "242"
    output: "243"
    name: "Reshape_70"
    op_type: "Reshape"
  }
  node {
    input: "243"
    output: "244"
    name: "Transpose_71"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "226"
    input: "2040"
    output: "246"
    name: "MatMul_72"
    op_type: "MatMul"
  }
  node {
    input: "229"
    output: "250"
    name: "Unsqueeze_73"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "250"
    input: "2041"
    input: "2042"
    input: "2043"
    output: "254"
    name: "Concat_74"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "246"
    input: "254"
    output: "255"
    name: "Reshape_75"
    op_type: "Reshape"
  }
  node {
    input: "226"
    input: "2044"
    output: "257"
    name: "MatMul_76"
    op_type: "MatMul"
  }
  node {
    input: "229"
    output: "261"
    name: "Unsqueeze_77"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "261"
    input: "2045"
    input: "2046"
    input: "2047"
    output: "265"
    name: "Concat_78"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "257"
    input: "265"
    output: "266"
    name: "Reshape_79"
    op_type: "Reshape"
  }
  node {
    input: "266"
    output: "267"
    name: "Transpose_80"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "255"
    output: "268"
    name: "Transpose_81"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "244"
    input: "268"
    output: "269"
    name: "MatMul_82"
    op_type: "MatMul"
  }
  node {
    input: "232"
    output: "270"
    name: "Cast_83"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "271"
    name: "Constant_84"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "272"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "271"
    input: "270"
    input: "272"
    output: "273"
    name: "Range_86"
    op_type: "Range"
  }
  node {
    input: "273"
    output: "274"
    name: "Unsqueeze_87"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "232"
    output: "275"
    name: "Cast_88"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "276"
    name: "Constant_89"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "277"
    name: "Constant_90"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "276"
    input: "275"
    input: "277"
    output: "278"
    name: "Range_91"
    op_type: "Range"
  }
  node {
    input: "278"
    output: "279"
    name: "Unsqueeze_92"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "279"
    input: "274"
    output: "280"
    name: "Sub_93"
    op_type: "Sub"
  }
  node {
    input: "280"
    output: "281"
    name: "Neg_94"
    op_type: "Neg"
  }
  node {
    input: "281"
    output: "282"
    name: "Shape_95"
    op_type: "Shape"
  }
  node {
    input: "282"
    output: "283"
    name: "ConstantOfShape_96"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "281"
    input: "283"
    output: "284"
    name: "Max_97"
    op_type: "Max"
  }
  node {
    output: "285"
    name: "Constant_98"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\020\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "284"
    input: "285"
    output: "286"
    name: "Less_99"
    op_type: "Less"
  }
  node {
    input: "284"
    output: "287"
    name: "Cast_100"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "288"
    name: "Constant_101"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200A"
      }
      type: TENSOR
    }
  }
  node {
    input: "287"
    input: "288"
    output: "289"
    name: "Div_102"
    op_type: "Div"
  }
  node {
    input: "289"
    output: "290"
    name: "Log_103"
    op_type: "Log"
  }
  node {
    output: "291"
    name: "Constant_104"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\222\025\005@"
      }
      type: TENSOR
    }
  }
  node {
    input: "290"
    input: "291"
    output: "292"
    name: "Div_105"
    op_type: "Div"
  }
  node {
    output: "293"
    name: "Constant_106"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200A"
      }
      type: TENSOR
    }
  }
  node {
    input: "292"
    input: "293"
    output: "294"
    name: "Mul_107"
    op_type: "Mul"
  }
  node {
    input: "294"
    output: "295"
    name: "Cast_108"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "296"
    name: "Constant_109"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\020\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "295"
    input: "296"
    output: "297"
    name: "Add_110"
    op_type: "Add"
  }
  node {
    input: "297"
    output: "298"
    name: "Shape_111"
    op_type: "Shape"
  }
  node {
    input: "298"
    output: "299"
    name: "ConstantOfShape_112"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\037\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "297"
    input: "299"
    output: "300"
    name: "Min_113"
    op_type: "Min"
  }
  node {
    input: "286"
    input: "284"
    input: "300"
    output: "301"
    name: "Where_114"
    op_type: "Where"
  }
  node {
    output: "302"
    name: "Constant_115"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "301"
    input: "302"
    output: "303"
    name: "Add_116"
    op_type: "Add"
  }
  node {
    input: "303"
    output: "304"
    name: "Cast_117"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight"
    input: "304"
    output: "305"
    name: "Gather_118"
    op_type: "Gather"
  }
  node {
    input: "305"
    output: "306"
    name: "Transpose_119"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 2
      ints: 0
      ints: 1
      type: INTS
    }
  }
  node {
    input: "306"
    output: "307"
    name: "Unsqueeze_120"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "307"
    input: "210"
    output: "308"
    name: "Add_121"
    op_type: "Add"
  }
  node {
    input: "269"
    input: "308"
    output: "309"
    name: "Add_122"
    op_type: "Add"
  }
  node {
    input: "309"
    output: "310"
    name: "Cast_123"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "310"
    output: "311"
    name: "Softmax_124"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "311"
    input: "267"
    output: "312"
    name: "MatMul_125"
    op_type: "MatMul"
  }
  node {
    input: "312"
    output: "313"
    name: "Transpose_126"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "229"
    output: "316"
    name: "Unsqueeze_127"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "316"
    input: "2048"
    input: "2049"
    output: "319"
    name: "Concat_128"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "313"
    input: "319"
    output: "320"
    name: "Reshape_129"
    op_type: "Reshape"
  }
  node {
    input: "320"
    input: "2050"
    output: "322"
    name: "MatMul_130"
    op_type: "MatMul"
  }
  node {
    input: "218"
    input: "322"
    output: "323"
    name: "Add_131"
    op_type: "Add"
  }
  node {
    input: "323"
    output: "324"
    name: "Cast_132"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "325"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "324"
    input: "325"
    output: "326"
    name: "Pow_134"
    op_type: "Pow"
  }
  node {
    input: "326"
    output: "327"
    name: "ReduceMean_135"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "328"
    name: "Constant_136"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "327"
    input: "328"
    output: "329"
    name: "Add_137"
    op_type: "Add"
  }
  node {
    input: "329"
    output: "330"
    name: "Sqrt_138"
    op_type: "Sqrt"
  }
  node {
    input: "324"
    input: "330"
    output: "331"
    name: "Div_139"
    op_type: "Div"
  }
  node {
    input: "decoder.block.0.layer.1.layer_norm.weight"
    input: "331"
    output: "332"
    name: "Mul_140"
    op_type: "Mul"
  }
  node {
    input: "332"
    output: "333"
    name: "Shape_141"
    op_type: "Shape"
  }
  node {
    output: "334"
    name: "Constant_142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "333"
    input: "334"
    output: "335"
    name: "Gather_143"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "332"
    output: "336"
    name: "Shape_144"
    op_type: "Shape"
  }
  node {
    output: "337"
    name: "Constant_145"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "336"
    input: "337"
    output: "338"
    name: "Gather_146"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "encoder_hidden_states"
    output: "339"
    name: "Shape_147"
    op_type: "Shape"
  }
  node {
    output: "340"
    name: "Constant_148"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "339"
    input: "340"
    output: "341"
    name: "Gather_149"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "332"
    input: "2051"
    output: "343"
    name: "MatMul_150"
    op_type: "MatMul"
  }
  node {
    input: "335"
    output: "347"
    name: "Unsqueeze_151"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "347"
    input: "2052"
    input: "2053"
    input: "2054"
    output: "351"
    name: "Concat_152"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "343"
    input: "351"
    output: "352"
    name: "Reshape_153"
    op_type: "Reshape"
  }
  node {
    input: "352"
    output: "353"
    name: "Transpose_154"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "encoder_hidden_states"
    input: "2055"
    output: "355"
    name: "MatMul_155"
    op_type: "MatMul"
  }
  node {
    input: "335"
    output: "359"
    name: "Unsqueeze_156"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "359"
    input: "2056"
    input: "2057"
    input: "2058"
    output: "363"
    name: "Concat_157"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "355"
    input: "363"
    output: "364"
    name: "Reshape_158"
    op_type: "Reshape"
  }
  node {
    input: "encoder_hidden_states"
    input: "2059"
    output: "366"
    name: "MatMul_159"
    op_type: "MatMul"
  }
  node {
    input: "335"
    output: "370"
    name: "Unsqueeze_160"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "370"
    input: "2060"
    input: "2061"
    input: "2062"
    output: "374"
    name: "Concat_161"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "366"
    input: "374"
    output: "375"
    name: "Reshape_162"
    op_type: "Reshape"
  }
  node {
    input: "375"
    output: "376"
    name: "Transpose_163"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "364"
    output: "377"
    name: "Transpose_164"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "353"
    input: "377"
    output: "378"
    name: "MatMul_165"
    op_type: "MatMul"
  }
  node {
    input: "338"
    output: "379"
    name: "Cast_166"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "380"
    name: "Constant_167"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "381"
    name: "Constant_168"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "380"
    input: "379"
    input: "381"
    output: "382"
    name: "Range_169"
    op_type: "Range"
  }
  node {
    input: "382"
    output: "383"
    name: "Unsqueeze_170"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "341"
    output: "384"
    name: "Cast_171"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "385"
    name: "Constant_172"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "386"
    name: "Constant_173"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "385"
    input: "384"
    input: "386"
    output: "387"
    name: "Range_174"
    op_type: "Range"
  }
  node {
    input: "387"
    output: "388"
    name: "Unsqueeze_175"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "388"
    input: "383"
    output: "389"
    name: "Sub_176"
    op_type: "Sub"
  }
  node {
    input: "389"
    output: "390"
    name: "Neg_177"
    op_type: "Neg"
  }
  node {
    input: "390"
    output: "391"
    name: "Shape_178"
    op_type: "Shape"
  }
  node {
    input: "391"
    output: "392"
    name: "ConstantOfShape_179"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "390"
    input: "392"
    output: "393"
    name: "Max_180"
    op_type: "Max"
  }
  node {
    output: "394"
    name: "Constant_181"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\020\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "393"
    input: "394"
    output: "395"
    name: "Less_182"
    op_type: "Less"
  }
  node {
    input: "393"
    output: "396"
    name: "Cast_183"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "397"
    name: "Constant_184"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200A"
      }
      type: TENSOR
    }
  }
  node {
    input: "396"
    input: "397"
    output: "398"
    name: "Div_185"
    op_type: "Div"
  }
  node {
    input: "398"
    output: "399"
    name: "Log_186"
    op_type: "Log"
  }
  node {
    output: "400"
    name: "Constant_187"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\222\025\005@"
      }
      type: TENSOR
    }
  }
  node {
    input: "399"
    input: "400"
    output: "401"
    name: "Div_188"
    op_type: "Div"
  }
  node {
    output: "402"
    name: "Constant_189"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200A"
      }
      type: TENSOR
    }
  }
  node {
    input: "401"
    input: "402"
    output: "403"
    name: "Mul_190"
    op_type: "Mul"
  }
  node {
    input: "403"
    output: "404"
    name: "Cast_191"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "405"
    name: "Constant_192"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\020\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "404"
    input: "405"
    output: "406"
    name: "Add_193"
    op_type: "Add"
  }
  node {
    input: "406"
    output: "407"
    name: "Shape_194"
    op_type: "Shape"
  }
  node {
    input: "407"
    output: "408"
    name: "ConstantOfShape_195"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\037\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "406"
    input: "408"
    output: "409"
    name: "Min_196"
    op_type: "Min"
  }
  node {
    input: "395"
    input: "393"
    input: "409"
    output: "410"
    name: "Where_197"
    op_type: "Where"
  }
  node {
    output: "411"
    name: "Constant_198"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "410"
    input: "411"
    output: "412"
    name: "Add_199"
    op_type: "Add"
  }
  node {
    input: "412"
    output: "413"
    name: "Cast_200"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "decoder.block.0.layer.1.EncDecAttention.relative_attention_bias.weight"
    input: "413"
    output: "414"
    name: "Gather_201"
    op_type: "Gather"
  }
  node {
    input: "414"
    output: "415"
    name: "Transpose_202"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 2
      ints: 0
      ints: 1
      type: INTS
    }
  }
  node {
    input: "415"
    output: "416"
    name: "Unsqueeze_203"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "416"
    input: "217"
    output: "417"
    name: "Add_204"
    op_type: "Add"
  }
  node {
    input: "378"
    input: "417"
    output: "418"
    name: "Add_205"
    op_type: "Add"
  }
  node {
    input: "418"
    output: "419"
    name: "Cast_206"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "419"
    output: "420"
    name: "Softmax_207"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "420"
    input: "376"
    output: "421"
    name: "MatMul_208"
    op_type: "MatMul"
  }
  node {
    input: "421"
    output: "422"
    name: "Transpose_209"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "335"
    output: "425"
    name: "Unsqueeze_210"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "425"
    input: "2063"
    input: "2064"
    output: "428"
    name: "Concat_211"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "422"
    input: "428"
    output: "429"
    name: "Reshape_212"
    op_type: "Reshape"
  }
  node {
    input: "429"
    input: "2065"
    output: "431"
    name: "MatMul_213"
    op_type: "MatMul"
  }
  node {
    input: "324"
    input: "431"
    output: "432"
    name: "Add_214"
    op_type: "Add"
  }
  node {
    input: "432"
    output: "433"
    name: "Cast_215"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "434"
    name: "Constant_216"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "433"
    input: "434"
    output: "435"
    name: "Pow_217"
    op_type: "Pow"
  }
  node {
    input: "435"
    output: "436"
    name: "ReduceMean_218"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "437"
    name: "Constant_219"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "436"
    input: "437"
    output: "438"
    name: "Add_220"
    op_type: "Add"
  }
  node {
    input: "438"
    output: "439"
    name: "Sqrt_221"
    op_type: "Sqrt"
  }
  node {
    input: "433"
    input: "439"
    output: "440"
    name: "Div_222"
    op_type: "Div"
  }
  node {
    input: "decoder.block.0.layer.2.layer_norm.weight"
    input: "440"
    output: "441"
    name: "Mul_223"
    op_type: "Mul"
  }
  node {
    input: "441"
    input: "2066"
    output: "443"
    name: "MatMul_224"
    op_type: "MatMul"
  }
  node {
    input: "443"
    output: "444"
    name: "Relu_225"
    op_type: "Relu"
  }
  node {
    input: "444"
    input: "2067"
    output: "446"
    name: "MatMul_226"
    op_type: "MatMul"
  }
  node {
    input: "433"
    input: "446"
    output: "447"
    name: "Add_227"
    op_type: "Add"
  }
  node {
    input: "447"
    output: "448"
    name: "Cast_228"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "449"
    name: "Constant_229"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "448"
    input: "449"
    output: "450"
    name: "Pow_230"
    op_type: "Pow"
  }
  node {
    input: "450"
    output: "451"
    name: "ReduceMean_231"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "452"
    name: "Constant_232"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "451"
    input: "452"
    output: "453"
    name: "Add_233"
    op_type: "Add"
  }
  node {
    input: "453"
    output: "454"
    name: "Sqrt_234"
    op_type: "Sqrt"
  }
  node {
    input: "448"
    input: "454"
    output: "455"
    name: "Div_235"
    op_type: "Div"
  }
  node {
    input: "decoder.block.1.layer.0.layer_norm.weight"
    input: "455"
    output: "456"
    name: "Mul_236"
    op_type: "Mul"
  }
  node {
    input: "456"
    output: "457"
    name: "Shape_237"
    op_type: "Shape"
  }
  node {
    output: "458"
    name: "Constant_238"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "457"
    input: "458"
    output: "459"
    name: "Gather_239"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "456"
    input: "2068"
    output: "461"
    name: "MatMul_240"
    op_type: "MatMul"
  }
  node {
    input: "459"
    output: "465"
    name: "Unsqueeze_241"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "465"
    input: "2069"
    input: "2070"
    input: "2071"
    output: "469"
    name: "Concat_242"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "461"
    input: "469"
    output: "470"
    name: "Reshape_243"
    op_type: "Reshape"
  }
  node {
    input: "470"
    output: "471"
    name: "Transpose_244"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "456"
    input: "2072"
    output: "473"
    name: "MatMul_245"
    op_type: "MatMul"
  }
  node {
    input: "459"
    output: "477"
    name: "Unsqueeze_246"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "477"
    input: "2073"
    input: "2074"
    input: "2075"
    output: "481"
    name: "Concat_247"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "473"
    input: "481"
    output: "482"
    name: "Reshape_248"
    op_type: "Reshape"
  }
  node {
    input: "456"
    input: "2076"
    output: "484"
    name: "MatMul_249"
    op_type: "MatMul"
  }
  node {
    input: "459"
    output: "488"
    name: "Unsqueeze_250"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "488"
    input: "2077"
    input: "2078"
    input: "2079"
    output: "492"
    name: "Concat_251"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "484"
    input: "492"
    output: "493"
    name: "Reshape_252"
    op_type: "Reshape"
  }
  node {
    input: "493"
    output: "494"
    name: "Transpose_253"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "482"
    output: "495"
    name: "Transpose_254"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "471"
    input: "495"
    output: "496"
    name: "MatMul_255"
    op_type: "MatMul"
  }
  node {
    input: "496"
    input: "308"
    output: "497"
    name: "Add_256"
    op_type: "Add"
  }
  node {
    input: "497"
    output: "498"
    name: "Cast_257"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "498"
    output: "499"
    name: "Softmax_258"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "499"
    input: "494"
    output: "500"
    name: "MatMul_259"
    op_type: "MatMul"
  }
  node {
    input: "500"
    output: "501"
    name: "Transpose_260"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "459"
    output: "504"
    name: "Unsqueeze_261"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "504"
    input: "2080"
    input: "2081"
    output: "507"
    name: "Concat_262"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "501"
    input: "507"
    output: "508"
    name: "Reshape_263"
    op_type: "Reshape"
  }
  node {
    input: "508"
    input: "2082"
    output: "510"
    name: "MatMul_264"
    op_type: "MatMul"
  }
  node {
    input: "448"
    input: "510"
    output: "511"
    name: "Add_265"
    op_type: "Add"
  }
  node {
    input: "511"
    output: "512"
    name: "Cast_266"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "513"
    name: "Constant_267"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "512"
    input: "513"
    output: "514"
    name: "Pow_268"
    op_type: "Pow"
  }
  node {
    input: "514"
    output: "515"
    name: "ReduceMean_269"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "516"
    name: "Constant_270"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "515"
    input: "516"
    output: "517"
    name: "Add_271"
    op_type: "Add"
  }
  node {
    input: "517"
    output: "518"
    name: "Sqrt_272"
    op_type: "Sqrt"
  }
  node {
    input: "512"
    input: "518"
    output: "519"
    name: "Div_273"
    op_type: "Div"
  }
  node {
    input: "decoder.block.1.layer.1.layer_norm.weight"
    input: "519"
    output: "520"
    name: "Mul_274"
    op_type: "Mul"
  }
  node {
    input: "520"
    output: "521"
    name: "Shape_275"
    op_type: "Shape"
  }
  node {
    output: "522"
    name: "Constant_276"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "521"
    input: "522"
    output: "523"
    name: "Gather_277"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "520"
    input: "2083"
    output: "525"
    name: "MatMul_278"
    op_type: "MatMul"
  }
  node {
    input: "523"
    output: "529"
    name: "Unsqueeze_279"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "529"
    input: "2084"
    input: "2085"
    input: "2086"
    output: "533"
    name: "Concat_280"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "525"
    input: "533"
    output: "534"
    name: "Reshape_281"
    op_type: "Reshape"
  }
  node {
    input: "534"
    output: "535"
    name: "Transpose_282"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "encoder_hidden_states"
    input: "2087"
    output: "537"
    name: "MatMul_283"
    op_type: "MatMul"
  }
  node {
    input: "523"
    output: "541"
    name: "Unsqueeze_284"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "541"
    input: "2088"
    input: "2089"
    input: "2090"
    output: "545"
    name: "Concat_285"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "537"
    input: "545"
    output: "546"
    name: "Reshape_286"
    op_type: "Reshape"
  }
  node {
    input: "encoder_hidden_states"
    input: "2091"
    output: "548"
    name: "MatMul_287"
    op_type: "MatMul"
  }
  node {
    input: "523"
    output: "552"
    name: "Unsqueeze_288"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "552"
    input: "2092"
    input: "2093"
    input: "2094"
    output: "556"
    name: "Concat_289"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "548"
    input: "556"
    output: "557"
    name: "Reshape_290"
    op_type: "Reshape"
  }
  node {
    input: "557"
    output: "558"
    name: "Transpose_291"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "546"
    output: "559"
    name: "Transpose_292"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 3
      ints: 1
      type: INTS
    }
  }
  node {
    input: "535"
    input: "559"
    output: "560"
    name: "MatMul_293"
    op_type: "MatMul"
  }
  node {
    input: "560"
    input: "417"
    output: "561"
    name: "Add_294"
    op_type: "Add"
  }
  node {
    input: "561"
    output: "562"
    name: "Cast_295"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "562"
    output: "563"
    name: "Softmax_296"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "563"
    input: "558"
    output: "564"
    name: "MatMul_297"
    op_type: "MatMul"
  }
  node {
    input: "564"
    output: "565"
    name: "Transpose_298"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "523"
    output: "568"
    name: "Unsqueeze_299"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "568"
    input: "2095"
    input: "2096"
    output: "571"
    name: "Concat_300"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "565"
    input: "571"
    output: "572"
    name: "Reshape_301"
    op_type: "Reshape"
  }
  node {
    input: "572"
    input: "2097"
    output: "574"
    name: "MatMul_302"
    op_type: "MatMul"
  }
  node {
    input: "512"
    input: "574"
    output: "575"
    name: "Add_303"
    op_type: "Add"
  }
  node {
    input: "575"
    output: "576"
    name: "Cast_304"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "577"
    name: "Constant_305"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "576"
    input: "577"
    output: "578"
    name: "Pow_306"
    op_type: "Pow"
  }
  node {
    input: "578"
    output: "579"
    name: "ReduceMean_307"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "580"
    name: "Constant_308"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "579"
    input: "580"
    output: "581"
    name: "Add_309"
    op_type: "Add"
  }
  node {
    input: "581"
    output: "582"
    name: "Sqrt_310"
    op_type: "Sqrt"
  }
  node {
    input: "576"
    input: "582"
    output: "583"
    name: "Div_311"
    op_type: "Div"
  }
  node {
    input: "decoder.block.1.layer.2.layer_norm.weight"
    input: "583"
    output: "584"
    name: "Mul_312"
    op_type: "Mul"
  }
  node {
    input: "584"
    input: "2098"
    output: "586"
    name: "MatMul_313"
    op_type: "MatMul"
  }
  node {
    input: "586"
    output: "587"
    name: "Relu_314"
    op_type: "Relu"
  }
  node {
    input: "587"
    input: "2099"
    output: "589"
    name: "MatMul_315"
    op_type: "MatMul"
  }
  node {
    input: "576"
    input: "589"
    output: "590"
    name: "Add_316"
    op_type: "Add"
  }
  node {
    input: "590"
