ir_version: 6
producer_name: "tf2onnx"
producer_version: "1.7.0"
graph {
  node {
    input: "input_1:0"
    output: "StatefulPartitionedCall/model/conv2d/Conv2D__46:0"
    name: "StatefulPartitionedCall/model/conv2d/Conv2D__46"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/conv2d/Conv2D__46:0"
    input: "StatefulPartitionedCall/model/conv2d/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda/Exp:0"
    name: "StatefulPartitionedCall/model/lambda/Exp"
    op_type: "Exp"
  }
  node {
    input: "Reshape__1345:0"
    input: "new_shape__2067"
    output: "Transpose__1378:0"
    name: "Transpose__1378"
    op_type: "Reshape"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda/Exp:0"
    output: "StatefulPartitionedCall/model/lambda/add:0"
    name: "StatefulPartitionedCall/model/lambda/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda/add:0"
    output: "StatefulPartitionedCall/model/lambda/Log:0"
    name: "StatefulPartitionedCall/model/lambda/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda/Log:0"
    output: "StatefulPartitionedCall/model/lambda/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda/mul:0"
    name: "StatefulPartitionedCall/model/lambda/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_1/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_1/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_1/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_1/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_1/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_1/add:0"
    name: "StatefulPartitionedCall/model/lambda_1/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_1/add:0"
    output: "StatefulPartitionedCall/model/lambda_1/Log:0"
    name: "StatefulPartitionedCall/model/lambda_1/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_1/Log:0"
    output: "StatefulPartitionedCall/model/lambda_1/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_1/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_1/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_1/mul:0"
    name: "StatefulPartitionedCall/model/lambda_1/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_1/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_3/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_3/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_3/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_3/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_3/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_3/add:0"
    name: "StatefulPartitionedCall/model/lambda_3/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_3/add:0"
    output: "StatefulPartitionedCall/model/lambda_3/Log:0"
    name: "StatefulPartitionedCall/model/lambda_3/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_3/Log:0"
    output: "StatefulPartitionedCall/model/lambda_3/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_3/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_3/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_3/mul:0"
    name: "StatefulPartitionedCall/model/lambda_3/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_3/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_4/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_4/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_4/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_4/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_4/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_4/add:0"
    name: "StatefulPartitionedCall/model/lambda_4/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_4/add:0"
    output: "StatefulPartitionedCall/model/lambda_4/Log:0"
    name: "StatefulPartitionedCall/model/lambda_4/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_4/Log:0"
    output: "StatefulPartitionedCall/model/lambda_4/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_4/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_4/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_4/mul:0"
    name: "StatefulPartitionedCall/model/lambda_4/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_4/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_5/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_5/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_5/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_5/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_5/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_5/add:0"
    name: "StatefulPartitionedCall/model/lambda_5/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_5/add:0"
    output: "StatefulPartitionedCall/model/lambda_5/Log:0"
    name: "StatefulPartitionedCall/model/lambda_5/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_5/Log:0"
    output: "StatefulPartitionedCall/model/lambda_5/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_5/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_5/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_5/mul:0"
    name: "StatefulPartitionedCall/model/lambda_5/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_3/mul:0"
    input: "StatefulPartitionedCall/model/lambda_5/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_add/add:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_add/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add/add:0"
    input: "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_6/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_6/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_6/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_6/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_6/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_6/add:0"
    name: "StatefulPartitionedCall/model/lambda_6/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_6/add:0"
    output: "StatefulPartitionedCall/model/lambda_6/Log:0"
    name: "StatefulPartitionedCall/model/lambda_6/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_6/Log:0"
    output: "StatefulPartitionedCall/model/lambda_6/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_6/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_6/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_6/mul:0"
    name: "StatefulPartitionedCall/model/lambda_6/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_1/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_2/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_2/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_2/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_2/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_2/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_2/add:0"
    name: "StatefulPartitionedCall/model/lambda_2/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_2/add:0"
    output: "StatefulPartitionedCall/model/lambda_2/Log:0"
    name: "StatefulPartitionedCall/model/lambda_2/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_2/Log:0"
    output: "StatefulPartitionedCall/model/lambda_2/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_2/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_2/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_2/mul:0"
    name: "StatefulPartitionedCall/model/lambda_2/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_6/mul:0"
    input: "StatefulPartitionedCall/model/lambda_2/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_concat/concat:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_concat/concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_concat/concat:0"
    input: "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_7/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_7/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_7/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_7/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_7/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_7/add:0"
    name: "StatefulPartitionedCall/model/lambda_7/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_7/add:0"
    output: "StatefulPartitionedCall/model/lambda_7/Log:0"
    name: "StatefulPartitionedCall/model/lambda_7/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_7/Log:0"
    output: "StatefulPartitionedCall/model/lambda_7/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_7/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_7/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_7/mul:0"
    name: "StatefulPartitionedCall/model/lambda_7/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_7/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_8/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_8/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_8/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_8/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_8/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_8/add:0"
    name: "StatefulPartitionedCall/model/lambda_8/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_8/add:0"
    output: "StatefulPartitionedCall/model/lambda_8/Log:0"
    name: "StatefulPartitionedCall/model/lambda_8/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_8/Log:0"
    output: "StatefulPartitionedCall/model/lambda_8/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_8/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_8/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_8/mul:0"
    name: "StatefulPartitionedCall/model/lambda_8/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_8/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_9/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_9/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_9/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_9/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_9/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_9/add:0"
    name: "StatefulPartitionedCall/model/lambda_9/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_9/add:0"
    output: "StatefulPartitionedCall/model/lambda_9/Log:0"
    name: "StatefulPartitionedCall/model/lambda_9/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_9/Log:0"
    output: "StatefulPartitionedCall/model/lambda_9/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_9/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_9/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_9/mul:0"
    name: "StatefulPartitionedCall/model/lambda_9/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_8/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_10/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_10/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_10/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_10/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_10/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_10/add:0"
    name: "StatefulPartitionedCall/model/lambda_10/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_10/add:0"
    output: "StatefulPartitionedCall/model/lambda_10/Log:0"
    name: "StatefulPartitionedCall/model/lambda_10/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_10/Log:0"
    output: "StatefulPartitionedCall/model/lambda_10/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_10/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_10/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_10/mul:0"
    name: "StatefulPartitionedCall/model/lambda_10/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_10/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_11/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_11/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_11/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_11/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_11/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_11/add:0"
    name: "StatefulPartitionedCall/model/lambda_11/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_11/add:0"
    output: "StatefulPartitionedCall/model/lambda_11/Log:0"
    name: "StatefulPartitionedCall/model/lambda_11/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_11/Log:0"
    output: "StatefulPartitionedCall/model/lambda_11/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_11/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_11/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_11/mul:0"
    name: "StatefulPartitionedCall/model/lambda_11/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_11/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_12/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_12/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_12/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_12/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_12/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_12/add:0"
    name: "StatefulPartitionedCall/model/lambda_12/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_12/add:0"
    output: "StatefulPartitionedCall/model/lambda_12/Log:0"
    name: "StatefulPartitionedCall/model/lambda_12/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_12/Log:0"
    output: "StatefulPartitionedCall/model/lambda_12/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_12/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_12/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_12/mul:0"
    name: "StatefulPartitionedCall/model/lambda_12/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_10/mul:0"
    input: "StatefulPartitionedCall/model/lambda_12/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_add_1/add_1:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_add_1/add_1"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_1/add_1:0"
    input: "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_13/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_13/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_13/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_13/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_13/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_13/add:0"
    name: "StatefulPartitionedCall/model/lambda_13/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_13/add:0"
    output: "StatefulPartitionedCall/model/lambda_13/Log:0"
    name: "StatefulPartitionedCall/model/lambda_13/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_13/Log:0"
    output: "StatefulPartitionedCall/model/lambda_13/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_13/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_13/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_13/mul:0"
    name: "StatefulPartitionedCall/model/lambda_13/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_13/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_14/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_14/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_14/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_14/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_14/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_14/add:0"
    name: "StatefulPartitionedCall/model/lambda_14/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_14/add:0"
    output: "StatefulPartitionedCall/model/lambda_14/Log:0"
    name: "StatefulPartitionedCall/model/lambda_14/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_14/Log:0"
    output: "StatefulPartitionedCall/model/lambda_14/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_14/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_14/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_14/mul:0"
    name: "StatefulPartitionedCall/model/lambda_14/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_1/add_1:0"
    input: "StatefulPartitionedCall/model/lambda_14/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_add_2/add_2:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_add_2/add_2"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_2/add_2:0"
    input: "StatefulPartitionedCall/model/conv2d_15/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_15/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_15/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_15/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_15/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_15/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_15/add:0"
    name: "StatefulPartitionedCall/model/lambda_15/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_15/add:0"
    output: "StatefulPartitionedCall/model/lambda_15/Log:0"
    name: "StatefulPartitionedCall/model/lambda_15/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_15/Log:0"
    output: "StatefulPartitionedCall/model/lambda_15/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_15/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_15/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_15/mul:0"
    name: "StatefulPartitionedCall/model/lambda_15/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_15/mul:0"
    input: "StatefulPartitionedCall/model/lambda_9/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_concat_1/concat_1:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_concat_1/concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_concat_1/concat_1:0"
    input: "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_16/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_16/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_16/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_16/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_16/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_16/add:0"
    name: "StatefulPartitionedCall/model/lambda_16/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_16/add:0"
    output: "StatefulPartitionedCall/model/lambda_16/Log:0"
    name: "StatefulPartitionedCall/model/lambda_16/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_16/Log:0"
    output: "StatefulPartitionedCall/model/lambda_16/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_16/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_16/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_16/mul:0"
    name: "StatefulPartitionedCall/model/lambda_16/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_16/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_17/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_17/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_17/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_17/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_17/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_17/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_17/add:0"
    name: "StatefulPartitionedCall/model/lambda_17/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_17/add:0"
    output: "StatefulPartitionedCall/model/lambda_17/Log:0"
    name: "StatefulPartitionedCall/model/lambda_17/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_17/Log:0"
    output: "StatefulPartitionedCall/model/lambda_17/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_17/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_17/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_17/mul:0"
    name: "StatefulPartitionedCall/model/lambda_17/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_17/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_19/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_19/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_19/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_19/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_19/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_19/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_19/add:0"
    name: "StatefulPartitionedCall/model/lambda_19/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_19/add:0"
    output: "StatefulPartitionedCall/model/lambda_19/Log:0"
    name: "StatefulPartitionedCall/model/lambda_19/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_19/Log:0"
    output: "StatefulPartitionedCall/model/lambda_19/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_19/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_19/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_19/mul:0"
    name: "StatefulPartitionedCall/model/lambda_19/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_19/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_20/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_20/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_20/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_20/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_20/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_20/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_20/add:0"
    name: "StatefulPartitionedCall/model/lambda_20/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_20/add:0"
    output: "StatefulPartitionedCall/model/lambda_20/Log:0"
    name: "StatefulPartitionedCall/model/lambda_20/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_20/Log:0"
    output: "StatefulPartitionedCall/model/lambda_20/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_20/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_20/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_20/mul:0"
    name: "StatefulPartitionedCall/model/lambda_20/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_20/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_21/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_21/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_21/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_21/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_21/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_21/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_21/add:0"
    name: "StatefulPartitionedCall/model/lambda_21/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_21/add:0"
    output: "StatefulPartitionedCall/model/lambda_21/Log:0"
    name: "StatefulPartitionedCall/model/lambda_21/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_21/Log:0"
    output: "StatefulPartitionedCall/model/lambda_21/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_21/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_21/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_21/mul:0"
    name: "StatefulPartitionedCall/model/lambda_21/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_19/mul:0"
    input: "StatefulPartitionedCall/model/lambda_21/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_add_3/add_3:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_add_3/add_3"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_3/add_3:0"
    input: "StatefulPartitionedCall/model/conv2d_22/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_22/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_22/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_22/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_22/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_22/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_22/add:0"
    name: "StatefulPartitionedCall/model/lambda_22/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_22/add:0"
    output: "StatefulPartitionedCall/model/lambda_22/Log:0"
    name: "StatefulPartitionedCall/model/lambda_22/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_22/Log:0"
    output: "StatefulPartitionedCall/model/lambda_22/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_22/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_22/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_22/mul:0"
    name: "StatefulPartitionedCall/model/lambda_22/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_22/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_23/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_23/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_23/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_23/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_23/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_23/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_23/add:0"
    name: "StatefulPartitionedCall/model/lambda_23/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_23/add:0"
    output: "StatefulPartitionedCall/model/lambda_23/Log:0"
    name: "StatefulPartitionedCall/model/lambda_23/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_23/Log:0"
    output: "StatefulPartitionedCall/model/lambda_23/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_23/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_23/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_23/mul:0"
    name: "StatefulPartitionedCall/model/lambda_23/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_3/add_3:0"
    input: "StatefulPartitionedCall/model/lambda_23/mul:0"
    output: "StatefulPartitionedCall/model/tf_op_layer_add_4/add_4:0"
    name: "StatefulPartitionedCall/model/tf_op_layer_add_4/add_4"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/tf_op_layer_add_4/add_4:0"
    input: "StatefulPartitionedCall/model/conv2d_24/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_24/Conv2D_bias_fused_bn"
    output: "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3:0"
    name: "StatefulPartitionedCall/model/conv2d_24/Conv2D"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3:0"
    output: "StatefulPartitionedCall/model/lambda_24/Exp:0"
    name: "StatefulPartitionedCall/model/lambda_24/Exp"
    op_type: "Exp"
  }
  node {
    input: "Transpose__1378:0"
    input: "StatefulPartitionedCall/model/lambda_24/Exp:0"
    output: "StatefulPartitionedCall/model/lambda_24/add:0"
    name: "StatefulPartitionedCall/model/lambda_24/add"
    op_type: "Add"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_24/add:0"
    output: "StatefulPartitionedCall/model/lambda_24/Log:0"
    name: "StatefulPartitionedCall/model/lambda_24/Log"
    op_type: "Log"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_24/Log:0"
    output: "StatefulPartitionedCall/model/lambda_24/Tanh:0"
    name: "StatefulPartitionedCall/model/lambda_24/Tanh"
    op_type: "Tanh"
  }
  node {
    input: "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3:0"
    input: "StatefulPartitionedCall/model/lambda_24/Tanh:0"
    output: "StatefulPartitionedCall/model/lambda_24/mul:0"
    name: "StatefulPartitionedCall/model/lambda_24/mul"
    op_type: "Mul"
  }
  node {
    input: "StatefulPartitionedCall/model/lambda_24/mul:0"
    input: "StatefulPartitionedCall/model/conv2d_25/Conv2D_weights_fused_bn"
    input: "StatefulPartitionedCall/model/conv2d_25/Conv2D_bias_fused_bn"
